FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
// Copyright (c) 2008 Rowley Associates Limited.
//
// This file may be distributed under the terms of the License Agreement
// provided with this software.
//
// THIS FILE IS PROVIDED AS IS WITH NO WARRANTY OF ANY KIND, INCLUDING THE
// WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.

#ifndef LPC2478_h
#define LPC2478_h

#include <Config.h>
#include <Types/GPIO.h>

#define USB_HOST_BASE 0xFFE0C000

#define HcRevision (*(volatile unsigned *)0xFFE0C000)
#define HcRevision_OFFSET 0x0
#define HcRevision_REV_MASK 0xFF
#define HcRevision_REV_BIT 0

#define HcControl (*(volatile unsigned *)0xFFE0C004)
#define HcControl_OFFSET 0x4
#define HcControl_CBSR_MASK 0x3
#define HcControl_CBSR_BIT 0
#define HcControl_PLE_MASK 0x4
#define HcControl_PLE 0x4
#define HcControl_PLE_BIT 2
#define HcControl_IE_MASK 0x8
#define HcControl_IE 0x8
#define HcControl_IE_BIT 3
#define HcControl_CLE_MASK 0x10
#define HcControl_CLE 0x10
#define HcControl_CLE_BIT 4
#define HcControl_BLE_MASK 0x20
#define HcControl_BLE 0x20
#define HcControl_BLE_BIT 5
#define HcControl_HCFS_MASK 0xC0
#define HcControl_HCFS_BIT 6
#define HcControl_IR_MASK 0x100
#define HcControl_IR 0x100
#define HcControl_IR_BIT 8
#define HcControl_RWC_MASK 0x200
#define HcControl_RWC 0x200
#define HcControl_RWC_BIT 9
#define HcControl_RWE_MASK 0x400
#define HcControl_RWE 0x400
#define HcControl_RWE_BIT 10

#define HcCommandStatus (*(volatile unsigned *)0xFFE0C008)
#define HcCommandStatus_OFFSET 0x8
#define HcCommandStatus_HCR_MASK 0x1
#define HcCommandStatus_HCR 0x1
#define HcCommandStatus_HCR_BIT 0
#define HcCommandStatus_CLR_MASK 0x2
#define HcCommandStatus_CLR 0x2
#define HcCommandStatus_CLR_BIT 1
#define HcCommandStatus_BLF_MASK 0x4
#define HcCommandStatus_BLF 0x4
#define HcCommandStatus_BLF_BIT 2
#define HcCommandStatus_OCR_MASK 0x8
#define HcCommandStatus_OCR 0x8
#define HcCommandStatus_OCR_BIT 3
#define HcCommandStatus_SOC_MASK 0xC0
#define HcCommandStatus_SOC_BIT 6

#define HcInterruptStatus (*(volatile unsigned *)0xFFE0C00C)
#define HcInterruptStatus_OFFSET 0xC
#define HcInterruptStatus_SO_MASK 0x1
#define HcInterruptStatus_SO 0x1
#define HcInterruptStatus_SO_BIT 0
#define HcInterruptStatus_WDH_MASK 0x2
#define HcInterruptStatus_WDH 0x2
#define HcInterruptStatus_WDH_BIT 1
#define HcInterruptStatus_SF_MASK 0x4
#define HcInterruptStatus_SF 0x4
#define HcInterruptStatus_SF_BIT 2
#define HcInterruptStatus_RD_MASK 0x8
#define HcInterruptStatus_RD 0x8
#define HcInterruptStatus_RD_BIT 3
#define HcInterruptStatus_UE_MASK 0x10
#define HcInterruptStatus_UE 0x10
#define HcInterruptStatus_UE_BIT 4
#define HcInterruptStatus_FNO_MASK 0x20
#define HcInterruptStatus_FNO 0x20
#define HcInterruptStatus_FNO_BIT 5
#define HcInterruptStatus_RHSC_MASK 0x40
#define HcInterruptStatus_RHSC 0x40
#define HcInterruptStatus_RHSC_BIT 6
#define HcInterruptStatus_OC_MASK 0x40000000
#define HcInterruptStatus_OC 0x40000000
#define HcInterruptStatus_OC_BIT 30

#define HcInterruptEnable (*(volatile unsigned *)0xFFE0C010)
#define HcInterruptEnable_OFFSET 0x10
#define HcInterruptEnable_SO_MASK 0x1
#define HcInterruptEnable_SO 0x1
#define HcInterruptEnable_SO_BIT 0
#define HcInterruptEnable_WDH_MASK 0x2
#define HcInterruptEnable_WDH 0x2
#define HcInterruptEnable_WDH_BIT 1
#define HcInterruptEnable_SF_MASK 0x4
#define HcInterruptEnable_SF 0x4
#define HcInterruptEnable_SF_BIT 2
#define HcInterruptEnable_RD_MASK 0x8
#define HcInterruptEnable_RD 0x8
#define HcInterruptEnable_RD_BIT 3
#define HcInterruptEnable_UE_MASK 0x10
#define HcInterruptEnable_UE 0x10
#define HcInterruptEnable_UE_BIT 4
#define HcInterruptEnable_FNO_MASK 0x20
#define HcInterruptEnable_FNO 0x20
#define HcInterruptEnable_FNO_BIT 5
#define HcInterruptEnable_RHSC_MASK 0x40
#define HcInterruptEnable_RHSC 0x40
#define HcInterruptEnable_RHSC_BIT 6
#define HcInterruptEnable_OC_MASK 0x40000000
#define HcInterruptEnable_OC 0x40000000
#define HcInterruptEnable_OC_BIT 30
#define HcInterruptEnable_MIE_MASK 0x80000000
#define HcInterruptEnable_MIE 0x80000000
#define HcInterruptEnable_MIE_BIT 31

#define HcInterruptDisable (*(volatile unsigned *)0xFFE0C014)
#define HcInterruptDisable_OFFSET 0x14
#define HcInterruptDisable_SO_MASK 0x1
#define HcInterruptDisable_SO 0x1
#define HcInterruptDisable_SO_BIT 0
#define HcInterruptDisable_WDH_MASK 0x2
#define HcInterruptDisable_WDH 0x2
#define HcInterruptDisable_WDH_BIT 1
#define HcInterruptDisable_SF_MASK 0x4
#define HcInterruptDisable_SF 0x4
#define HcInterruptDisable_SF_BIT 2
#define HcInterruptDisable_RD_MASK 0x8
#define HcInterruptDisable_RD 0x8
#define HcInterruptDisable_RD_BIT 3
#define HcInterruptDisable_UE_MASK 0x10
#define HcInterruptDisable_UE 0x10
#define HcInterruptDisable_UE_BIT 4
#define HcInterruptDisable_FNO_MASK 0x20
#define HcInterruptDisable_FNO 0x20
#define HcInterruptDisable_FNO_BIT 5
#define HcInterruptDisable_RHSC_MASK 0x40
#define HcInterruptDisable_RHSC 0x40
#define HcInterruptDisable_RHSC_BIT 6
#define HcInterruptDisable_OC_MASK 0x40000000
#define HcInterruptDisable_OC 0x40000000
#define HcInterruptDisable_OC_BIT 30
#define HcInterruptDisable_MIE_MASK 0x80000000
#define HcInterruptDisable_MIE 0x80000000
#define HcInterruptDisable_MIE_BIT 31

#define HcHCCA (*(volatile unsigned *)0xFFE0C018)
#define HcHCCA_OFFSET 0x18
#define HcHCCA_HCCA_MASK 0xFFFFFF00
#define HcHCCA_HCCA_BIT 8

#define HcPeriodCurrentED (*(volatile unsigned *)0xFFE0C01C)
#define HcPeriodCurrentED_OFFSET 0x1C
#define HcPeriodCurrentED_PCED_MASK 0xFFFFFFF0
#define HcPeriodCurrentED_PCED_BIT 4

#define HcControlHeadED (*(volatile unsigned *)0xFFE0C020)
#define HcControlHeadED_OFFSET 0x20
#define HcControlHeadED_CHED_MASK 0xFFFFFFF0
#define HcControlHeadED_CHED_BIT 4

#define HcControlCurrentED (*(volatile unsigned *)0xFFE0C024)
#define HcControlCurrentED_OFFSET 0x24
#define HcControlCurrentED_CCED_MASK 0xFFFFFFF0
#define HcControlCurrentED_CCED_BIT 4

#define HcBulkHeadED (*(volatile unsigned *)0xFFE0C028)
#define HcBulkHeadED_OFFSET 0x28
#define HcBulkHeadED_BHED_MASK 0xFFFFFFF0
#define HcBulkHeadED_BHED_BIT 4

#define HcBulkCurrentED (*(volatile unsigned *)0xFFE0C02C)
#define HcBulkCurrentED_OFFSET 0x2C
#define HcBulkCurrentED_BCED_MASK 0xFFFFFFF0
#define HcBulkCurrentED_BCED_BIT 4

