FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define FIO4DIRH (*(volatile unsigned short *)0x3FFFC082)
#define FIO4DIRH_OFFSET 0x82

#define FIO4MASK (*(volatile unsigned long *)0x3FFFC090)
#define FIO4MASK_OFFSET 0x90

#define FIO4MASK0 (*(volatile unsigned char *)0x3FFFC090)
#define FIO4MASK0_OFFSET 0x90

#define FIO4MASK1 (*(volatile unsigned char *)0x3FFFC091)
#define FIO4MASK1_OFFSET 0x91

#define FIO4MASK2 (*(volatile unsigned char *)0x3FFFC092)
#define FIO4MASK2_OFFSET 0x92

#define FIO4MASK3 (*(volatile unsigned char *)0x3FFFC093)
#define FIO4MASK3_OFFSET 0x93

#define FIO4MASKL (*(volatile unsigned short *)0x3FFFC090)
#define FIO4MASKL_OFFSET 0x90

#define FIO4MASKH (*(volatile unsigned short *)0x3FFFC092)
#define FIO4MASKH_OFFSET 0x92

#define FIO4PIN (*(volatile unsigned long *)0x3FFFC094)
#define FIO4PIN_OFFSET 0x94

#define FIO4PIN0 (*(volatile unsigned char *)0x3FFFC094)
#define FIO4PIN0_OFFSET 0x94

#define FIO4PIN1 (*(volatile unsigned char *)0x3FFFC095)
#define FIO4PIN1_OFFSET 0x95

#define FIO4PIN2 (*(volatile unsigned char *)0x3FFFC096)
#define FIO4PIN2_OFFSET 0x96

#define FIO4PIN3 (*(volatile unsigned char *)0x3FFFC097)
#define FIO4PIN3_OFFSET 0x97

#define FIO4PINL (*(volatile unsigned short *)0x3FFFC094)
#define FIO4PINL_OFFSET 0x94

#define FIO4PINH (*(volatile unsigned short *)0x3FFFC096)
#define FIO4PINH_OFFSET 0x96

#define FIO4SET (*(volatile unsigned long *)0x3FFFC098)
#define FIO4SET_OFFSET 0x98

#define FIO4SET0 (*(volatile unsigned char *)0x3FFFC098)
#define FIO4SET0_OFFSET 0x98

#define FIO4SET1 (*(volatile unsigned char *)0x3FFFC099)
#define FIO4SET1_OFFSET 0x99

#define FIO4SET2 (*(volatile unsigned char *)0x3FFFC09A)
#define FIO4SET2_OFFSET 0x9A

#define FIO4SET3 (*(volatile unsigned char *)0x3FFFC09B)
#define FIO4SET3_OFFSET 0x9B

#define FIO4SETL (*(volatile unsigned short *)0x3FFFC098)
#define FIO4SETL_OFFSET 0x98

#define FIO4SETH (*(volatile unsigned short *)0x3FFFC09A)
#define FIO4SETH_OFFSET 0x9A

#define FIO4CLR (*(volatile unsigned long *)0x3FFFC09C)
#define FIO4CLR_OFFSET 0x9C

#define FIO4CLR0 (*(volatile unsigned char *)0x3FFFC09C)
#define FIO4CLR0_OFFSET 0x9C

#define FIO4CLR1 (*(volatile unsigned char *)0x3FFFC09D)
#define FIO4CLR1_OFFSET 0x9D

#define FIO4CLR2 (*(volatile unsigned char *)0x3FFFC09E)
#define FIO4CLR2_OFFSET 0x9E

#define FIO4CLR3 (*(volatile unsigned char *)0x3FFFC09F)
#define FIO4CLR3_OFFSET 0x9F

#define FIO4CLRL (*(volatile unsigned short *)0x3FFFC09C)
#define FIO4CLRL_OFFSET 0x9C

#define FIO4CLRH (*(volatile unsigned short *)0x3FFFC09E)
#define FIO4CLRH_OFFSET 0x9E

#define WDT_BASE 0xE0000000

#define WDMOD (*(volatile unsigned long *)0xE0000000)
#define WDMOD_OFFSET 0x0
#define WDMOD_WDEN_MASK 0x1
#define WDMOD_WDEN 0x1
#define WDMOD_WDEN_BIT 0
#define WDMOD_WDRESET_MASK 0x2
#define WDMOD_WDRESET 0x2
#define WDMOD_WDRESET_BIT 1
#define WDMOD_WDTOF_MASK 0x4
#define WDMOD_WDTOF 0x4
#define WDMOD_WDTOF_BIT 2
#define WDMOD_WDINT_MASK 0x8
#define WDMOD_WDINT 0x8
#define WDMOD_WDINT_BIT 3

#define WDTC (*(volatile unsigned long *)0xE0000004)
#define WDTC_OFFSET 0x4

#define WDFEED (*(volatile unsigned long *)0xE0000008)
#define WDFEED_OFFSET 0x8

#define WDTV (*(volatile unsigned long *)0xE000000C)
#define WDTV_OFFSET 0xC

#define WDCLKSEL (*(volatile unsigned long *)0xE0000010)
#define WDCLKSEL_OFFSET 0x10
#define WDCLKSEL_WDSEL_MASK 0x3
#define WDCLKSEL_WDSEL_BIT 0

#define TIMER0_BASE 0xE0004000

#define T0IR (*(volatile unsigned char *)0xE0004000)
#define T0IR_OFFSET 0x0
#define T0IR_MR0_MASK 0x1
#define T0IR_MR0 0x1
#define T0IR_MR0_BIT 0
#define T0IR_MR1_MASK 0x2
#define T0IR_MR1 0x2
#define T0IR_MR1_BIT 1
#define T0IR_MR2_MASK 0x4
#define T0IR_MR2 0x4
#define T0IR_MR2_BIT 2
#define T0IR_MR3_MASK 0x8
#define T0IR_MR3 0x8
#define T0IR_MR3_BIT 3
#define T0IR_CR0_MASK 0x10
#define T0IR_CR0 0x10
#define T0IR_CR0_BIT 4
#define T0IR_CR1_MASK 0x20
#define T0IR_CR1 0x20
#define T0IR_CR1_BIT 5
#define T0IR_CR2_MASK 0x40
#define T0IR_CR2 0x40
#define T0IR_CR2_BIT 6
#define T0IR_CR3_MASK 0x80
#define T0IR_CR3 0x80
#define T0IR_CR3_BIT 7

#define T0TCR (*(volatile unsigned char *)0xE0004004)
#define T0TCR_OFFSET 0x4
#define T0TCR_Counter_Enable_MASK 0x1
#define T0TCR_Counter_Enable 0x1
#define T0TCR_Counter_Enable_BIT 0
#define T0TCR_Counter_Reset_MASK 0x2
#define T0TCR_Counter_Reset 0x2
#define T0TCR_Counter_Reset_BIT 1

#define T0TC (*(volatile unsigned long *)0xE0004008)
#define T0TC_OFFSET 0x8

#define T0PR (*(volatile unsigned long *)0xE000400C)
#define T0PR_OFFSET 0xC

#define T0PC (*(volatile unsigned long *)0xE0004010)
#define T0PC_OFFSET 0x10

#define T0MCR (*(volatile unsigned short *)0xE0004014)
#define T0MCR_OFFSET 0x14
#define T0MCR_MR0I_MASK 0x1
#define T0MCR_MR0I 0x1
#define T0MCR_MR0I_BIT 0
#define T0MCR_MR0R_MASK 0x2
#define T0MCR_MR0R 0x2
#define T0MCR_MR0R_BIT 1
#define T0MCR_MR0S_MASK 0x4
#define T0MCR_MR0S 0x4
#define T0MCR_MR0S_BIT 2
#define T0MCR_MR1I_MASK 0x8
#define T0MCR_MR1I 0x8
#define T0MCR_MR1I_BIT 3
#define T0MCR_MR1R_MASK 0x10
#define T0MCR_MR1R 0x10
#define T0MCR_MR1R_BIT 4
#define T0MCR_MR1S_MASK 0x20
#define T0MCR_MR1S 0x20
#define T0MCR_MR1S_BIT 5
#define T0MCR_MR2I_MASK 0x40
#define T0MCR_MR2I 0x40
#define T0MCR_MR2I_BIT 6
#define T0MCR_MR2R_MASK 0x80
#define T0MCR_MR2R 0x80
#define T0MCR_MR2R_BIT 7
#define T0MCR_MR2S_MASK 0x100
#define T0MCR_MR2S 0x100
#define T0MCR_MR2S_BIT 8
#define T0MCR_MR3I_MASK 0x200
#define T0MCR_MR3I 0x200
#define T0MCR_MR3I_BIT 9
#define T0MCR_MR3R_MASK 0x400
#define T0MCR_MR3R 0x400
#define T0MCR_MR3R_BIT 10
#define T0MCR_MR3S_MASK 0x800
#define T0MCR_MR3S 0x800
#define T0MCR_MR3S_BIT 11

#define T0MR0 (*(volatile unsigned long *)0xE0004018)
#define T0MR0_OFFSET 0x18

#define T0MR1 (*(volatile unsigned long *)0xE000401C)
#define T0MR1_OFFSET 0x1C

#define T0MR2 (*(volatile unsigned long *)0xE0004020)
#define T0MR2_OFFSET 0x20

#define T0MR3 (*(volatile unsigned long *)0xE0004024)
#define T0MR3_OFFSET 0x24

#define T0CCR (*(volatile unsigned short *)0xE0004028)
#define T0CCR_OFFSET 0x28
#define T0CCR_CAP0RE_MASK 0x1
#define T0CCR_CAP0RE 0x1
#define T0CCR_CAP0RE_BIT 0
#define T0CCR_CAP0FE_MASK 0x2
#define T0CCR_CAP0FE 0x2
#define T0CCR_CAP0FE_BIT 1
#define T0CCR_CAP0I_MASK 0x4
#define T0CCR_CAP0I 0x4
#define T0CCR_CAP0I_BIT 2
#define T0CCR_CAP1RE_MASK 0x8
#define T0CCR_CAP1RE 0x8
#define T0CCR_CAP1RE_BIT 3
#define T0CCR_CAP1FE_MASK 0x10
#define T0CCR_CAP1FE 0x10
#define T0CCR_CAP1FE_BIT 4
#define T0CCR_CAP1I_MASK 0x20
#define T0CCR_CAP1I 0x20
#define T0CCR_CAP1I_BIT 5
#define T0CCR_CAP2RE_MASK 0x40
#define T0CCR_CAP2RE 0x40
#define T0CCR_CAP2RE_BIT 6
#define T0CCR_CAP2FE_MASK 0x80
#define T0CCR_CAP2FE 0x80
#define T0CCR_CAP2FE_BIT 7
#define T0CCR_CAP2I_MASK 0x100
#define T0CCR_CAP2I 0x100
#define T0CCR_CAP2I_BIT 8
#define T0CCR_CAP3RE_MASK 0x200
#define T0CCR_CAP3RE 0x200
#define T0CCR_CAP3RE_BIT 9
#define T0CCR_CAP3FE_MASK 0x400
#define T0CCR_CAP3FE 0x400
#define T0CCR_CAP3FE_BIT 10
#define T0CCR_CAP3I_MASK 0x800
#define T0CCR_CAP3I 0x800
#define T0CCR_CAP3I_BIT 11

#define T0CR0 (*(volatile unsigned long *)0xE000402C)
#define T0CR0_OFFSET 0x2C

