FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define PWM0PR (*(volatile unsigned long *)0xE001400C)
#define PWM0PR_OFFSET 0xC

#define PWM0PC (*(volatile unsigned long *)0xE0014010)
#define PWM0PC_OFFSET 0x10

#define PWM0MCR (*(volatile unsigned long *)0xE0014014)
#define PWM0MCR_OFFSET 0x14
#define PWM0MCR_PWMMR0I_MASK 0x1
#define PWM0MCR_PWMMR0I 0x1
#define PWM0MCR_PWMMR0I_BIT 0
#define PWM0MCR_PWMMR0R_MASK 0x2
#define PWM0MCR_PWMMR0R 0x2
#define PWM0MCR_PWMMR0R_BIT 1
#define PWM0MCR_PWMMR0S_MASK 0x4
#define PWM0MCR_PWMMR0S 0x4
#define PWM0MCR_PWMMR0S_BIT 2
#define PWM0MCR_PWMMR1I_MASK 0x8
#define PWM0MCR_PWMMR1I 0x8
#define PWM0MCR_PWMMR1I_BIT 3
#define PWM0MCR_PWMMR1R_MASK 0x10
#define PWM0MCR_PWMMR1R 0x10
#define PWM0MCR_PWMMR1R_BIT 4
#define PWM0MCR_PWMMR1S_MASK 0x20
#define PWM0MCR_PWMMR1S 0x20
#define PWM0MCR_PWMMR1S_BIT 5
#define PWM0MCR_PWMMR2I_MASK 0x40
#define PWM0MCR_PWMMR2I 0x40
#define PWM0MCR_PWMMR2I_BIT 6
#define PWM0MCR_PWMMR2R_MASK 0x80
#define PWM0MCR_PWMMR2R 0x80
#define PWM0MCR_PWMMR2R_BIT 7
#define PWM0MCR_PWMMR2S_MASK 0x100
#define PWM0MCR_PWMMR2S 0x100
#define PWM0MCR_PWMMR2S_BIT 8
#define PWM0MCR_PWMMR3I_MASK 0x200
#define PWM0MCR_PWMMR3I 0x200
#define PWM0MCR_PWMMR3I_BIT 9
#define PWM0MCR_PWMMR3R_MASK 0x400
#define PWM0MCR_PWMMR3R 0x400
#define PWM0MCR_PWMMR3R_BIT 10
#define PWM0MCR_PWMMR3S_MASK 0x800
#define PWM0MCR_PWMMR3S 0x800
#define PWM0MCR_PWMMR3S_BIT 11
#define PWM0MCR_PWMMR4I_MASK 0x1000
#define PWM0MCR_PWMMR4I 0x1000
#define PWM0MCR_PWMMR4I_BIT 12
#define PWM0MCR_PWMMR4R_MASK 0x2000
#define PWM0MCR_PWMMR4R 0x2000
#define PWM0MCR_PWMMR4R_BIT 13
#define PWM0MCR_PWMMR4S_MASK 0x4000
#define PWM0MCR_PWMMR4S 0x4000
#define PWM0MCR_PWMMR4S_BIT 14
#define PWM0MCR_PWMMR5I_MASK 0x8000
#define PWM0MCR_PWMMR5I 0x8000
#define PWM0MCR_PWMMR5I_BIT 15
#define PWM0MCR_PWMMR5R_MASK 0x10000
#define PWM0MCR_PWMMR5R 0x10000
#define PWM0MCR_PWMMR5R_BIT 16
#define PWM0MCR_PWMMR5S_MASK 0x20000
#define PWM0MCR_PWMMR5S 0x20000
#define PWM0MCR_PWMMR5S_BIT 17
#define PWM0MCR_PWMMR6I_MASK 0x40000
#define PWM0MCR_PWMMR6I 0x40000
#define PWM0MCR_PWMMR6I_BIT 18
#define PWM0MCR_PWMMR6R_MASK 0x80000
#define PWM0MCR_PWMMR6R 0x80000
#define PWM0MCR_PWMMR6R_BIT 19
#define PWM0MCR_PWMMR6S_MASK 0x100000
#define PWM0MCR_PWMMR6S 0x100000
#define PWM0MCR_PWMMR6S_BIT 20

#define PWM0MR0 (*(volatile unsigned long *)0xE0014018)
#define PWM0MR0_OFFSET 0x18

#define PWM0MR1 (*(volatile unsigned long *)0xE001401C)
#define PWM0MR1_OFFSET 0x1C

#define PWM0MR2 (*(volatile unsigned long *)0xE0014020)
#define PWM0MR2_OFFSET 0x20

#define PWM0MR3 (*(volatile unsigned long *)0xE0014024)
#define PWM0MR3_OFFSET 0x24

#define PWM0MR4 (*(volatile unsigned long *)0xE0014040)
#define PWM0MR4_OFFSET 0x40

#define PWM0MR5 (*(volatile unsigned long *)0xE0014044)
#define PWM0MR5_OFFSET 0x44

#define PWM0MR6 (*(volatile unsigned long *)0xE0014048)
#define PWM0MR6_OFFSET 0x48

#define PWM0PCR (*(volatile unsigned long *)0xE001404C)
#define PWM0PCR_OFFSET 0x4C
#define PWM0PCR_PWMSEL2_MASK 0x4
#define PWM0PCR_PWMSEL2 0x4
#define PWM0PCR_PWMSEL2_BIT 2
#define PWM0PCR_PWMSEL3_MASK 0x8
#define PWM0PCR_PWMSEL3 0x8
#define PWM0PCR_PWMSEL3_BIT 3
#define PWM0PCR_PWMSEL4_MASK 0x10
#define PWM0PCR_PWMSEL4 0x10
#define PWM0PCR_PWMSEL4_BIT 4
#define PWM0PCR_PWMSEL5_MASK 0x20
#define PWM0PCR_PWMSEL5 0x20
#define PWM0PCR_PWMSEL5_BIT 5
#define PWM0PCR_PWMSEL6_MASK 0x40
#define PWM0PCR_PWMSEL6 0x40
#define PWM0PCR_PWMSEL6_BIT 6
#define PWM0PCR_PWMENA1_MASK 0x200
#define PWM0PCR_PWMENA1 0x200
#define PWM0PCR_PWMENA1_BIT 9
#define PWM0PCR_PWMENA2_MASK 0x400
#define PWM0PCR_PWMENA2 0x400
#define PWM0PCR_PWMENA2_BIT 10
#define PWM0PCR_PWMENA3_MASK 0x800
#define PWM0PCR_PWMENA3 0x800
#define PWM0PCR_PWMENA3_BIT 11
#define PWM0PCR_PWMENA4_MASK 0x1000
#define PWM0PCR_PWMENA4 0x1000
#define PWM0PCR_PWMENA4_BIT 12
#define PWM0PCR_PWMENA5_MASK 0x2000
#define PWM0PCR_PWMENA5 0x2000
#define PWM0PCR_PWMENA5_BIT 13
#define PWM0PCR_PWMENA6_MASK 0x4000
#define PWM0PCR_PWMENA6 0x4000
#define PWM0PCR_PWMENA6_BIT 14

#define PWM0LER (*(volatile unsigned long *)0xE0014050)
#define PWM0LER_OFFSET 0x50
#define PWM0LER_Enable_PWM_Match_0_Latch_MASK 0x1
#define PWM0LER_Enable_PWM_Match_0_Latch 0x1
#define PWM0LER_Enable_PWM_Match_0_Latch_BIT 0
#define PWM0LER_Enable_PWM_Match_1_Latch_MASK 0x2
#define PWM0LER_Enable_PWM_Match_1_Latch 0x2
#define PWM0LER_Enable_PWM_Match_1_Latch_BIT 1
#define PWM0LER_Enable_PWM_Match_2_Latch_MASK 0x4
#define PWM0LER_Enable_PWM_Match_2_Latch 0x4
#define PWM0LER_Enable_PWM_Match_2_Latch_BIT 2
#define PWM0LER_Enable_PWM_Match_3_Latch_MASK 0x8
#define PWM0LER_Enable_PWM_Match_3_Latch 0x8
#define PWM0LER_Enable_PWM_Match_3_Latch_BIT 3
#define PWM0LER_Enable_PWM_Match_4_Latch_MASK 0x10
#define PWM0LER_Enable_PWM_Match_4_Latch 0x10
#define PWM0LER_Enable_PWM_Match_4_Latch_BIT 4
#define PWM0LER_Enable_PWM_Match_5_Latch_MASK 0x20
#define PWM0LER_Enable_PWM_Match_5_Latch 0x20
#define PWM0LER_Enable_PWM_Match_5_Latch_BIT 5
#define PWM0LER_Enable_PWM_Match_6_Latch_MASK 0x40
#define PWM0LER_Enable_PWM_Match_6_Latch 0x40
#define PWM0LER_Enable_PWM_Match_6_Latch_BIT 6

#define PWM1_BASE 0xE0018000

#define PWM1IR (*(volatile unsigned long *)0xE0018000)
#define PWM1IR_OFFSET 0x0
#define PWM1IR_PWMMR0_Interrupt_MASK 0x1
#define PWM1IR_PWMMR0_Interrupt 0x1
#define PWM1IR_PWMMR0_Interrupt_BIT 0
#define PWM1IR_PWMMR1_Interrupt_MASK 0x2
#define PWM1IR_PWMMR1_Interrupt 0x2
#define PWM1IR_PWMMR1_Interrupt_BIT 1
#define PWM1IR_PWMMR2_Interrupt_MASK 0x4
#define PWM1IR_PWMMR2_Interrupt 0x4
#define PWM1IR_PWMMR2_Interrupt_BIT 2
#define PWM1IR_PWMMR3_Interrupt_MASK 0x8
#define PWM1IR_PWMMR3_Interrupt 0x8
#define PWM1IR_PWMMR3_Interrupt_BIT 3
#define PWM1IR_PWMMR4_Interrupt_MASK 0x100
#define PWM1IR_PWMMR4_Interrupt 0x100
#define PWM1IR_PWMMR4_Interrupt_BIT 8
#define PWM1IR_PWMMR5_Interrupt_MASK 0x200
#define PWM1IR_PWMMR5_Interrupt 0x200
#define PWM1IR_PWMMR5_Interrupt_BIT 9
#define PWM1IR_PWMMR6_Interrupt_MASK 0x400
#define PWM1IR_PWMMR6_Interrupt 0x400
#define PWM1IR_PWMMR6_Interrupt_BIT 10

#define PWM1TCR (*(volatile unsigned long *)0xE0018004)
#define PWM1TCR_OFFSET 0x4
#define PWM1TCR_Counter_Enable_MASK 0x1
#define PWM1TCR_Counter_Enable 0x1
#define PWM1TCR_Counter_Enable_BIT 0
#define PWM1TCR_Counter_Reset_MASK 0x2
#define PWM1TCR_Counter_Reset 0x2
#define PWM1TCR_Counter_Reset_BIT 1
#define PWM1TCR_PWM_Enable_MASK 0x8
#define PWM1TCR_PWM_Enable 0x8
#define PWM1TCR_PWM_Enable_BIT 3

#define PWM1TC (*(volatile unsigned long *)0xE0018008)
#define PWM1TC_OFFSET 0x8

#define PWM1PR (*(volatile unsigned long *)0xE001800C)
#define PWM1PR_OFFSET 0xC

#define PWM1PC (*(volatile unsigned long *)0xE0018010)
#define PWM1PC_OFFSET 0x10

