FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define PWM1MCR (*(volatile unsigned long *)0xE0018014)
#define PWM1MCR_OFFSET 0x14
#define PWM1MCR_PWMMR0I_MASK 0x1
#define PWM1MCR_PWMMR0I 0x1
#define PWM1MCR_PWMMR0I_BIT 0
#define PWM1MCR_PWMMR0R_MASK 0x2
#define PWM1MCR_PWMMR0R 0x2
#define PWM1MCR_PWMMR0R_BIT 1
#define PWM1MCR_PWMMR0S_MASK 0x4
#define PWM1MCR_PWMMR0S 0x4
#define PWM1MCR_PWMMR0S_BIT 2
#define PWM1MCR_PWMMR1I_MASK 0x8
#define PWM1MCR_PWMMR1I 0x8
#define PWM1MCR_PWMMR1I_BIT 3
#define PWM1MCR_PWMMR1R_MASK 0x10
#define PWM1MCR_PWMMR1R 0x10
#define PWM1MCR_PWMMR1R_BIT 4
#define PWM1MCR_PWMMR1S_MASK 0x20
#define PWM1MCR_PWMMR1S 0x20
#define PWM1MCR_PWMMR1S_BIT 5
#define PWM1MCR_PWMMR2I_MASK 0x40
#define PWM1MCR_PWMMR2I 0x40
#define PWM1MCR_PWMMR2I_BIT 6
#define PWM1MCR_PWMMR2R_MASK 0x80
#define PWM1MCR_PWMMR2R 0x80
#define PWM1MCR_PWMMR2R_BIT 7
#define PWM1MCR_PWMMR2S_MASK 0x100
#define PWM1MCR_PWMMR2S 0x100
#define PWM1MCR_PWMMR2S_BIT 8
#define PWM1MCR_PWMMR3I_MASK 0x200
#define PWM1MCR_PWMMR3I 0x200
#define PWM1MCR_PWMMR3I_BIT 9
#define PWM1MCR_PWMMR3R_MASK 0x400
#define PWM1MCR_PWMMR3R 0x400
#define PWM1MCR_PWMMR3R_BIT 10
#define PWM1MCR_PWMMR3S_MASK 0x800
#define PWM1MCR_PWMMR3S 0x800
#define PWM1MCR_PWMMR3S_BIT 11
#define PWM1MCR_PWMMR4I_MASK 0x1000
#define PWM1MCR_PWMMR4I 0x1000
#define PWM1MCR_PWMMR4I_BIT 12
#define PWM1MCR_PWMMR4R_MASK 0x2000
#define PWM1MCR_PWMMR4R 0x2000
#define PWM1MCR_PWMMR4R_BIT 13
#define PWM1MCR_PWMMR4S_MASK 0x4000
#define PWM1MCR_PWMMR4S 0x4000
#define PWM1MCR_PWMMR4S_BIT 14
#define PWM1MCR_PWMMR5I_MASK 0x8000
#define PWM1MCR_PWMMR5I 0x8000
#define PWM1MCR_PWMMR5I_BIT 15
#define PWM1MCR_PWMMR5R_MASK 0x10000
#define PWM1MCR_PWMMR5R 0x10000
#define PWM1MCR_PWMMR5R_BIT 16
#define PWM1MCR_PWMMR5S_MASK 0x20000
#define PWM1MCR_PWMMR5S 0x20000
#define PWM1MCR_PWMMR5S_BIT 17
#define PWM1MCR_PWMMR6I_MASK 0x40000
#define PWM1MCR_PWMMR6I 0x40000
#define PWM1MCR_PWMMR6I_BIT 18
#define PWM1MCR_PWMMR6R_MASK 0x80000
#define PWM1MCR_PWMMR6R 0x80000
#define PWM1MCR_PWMMR6R_BIT 19
#define PWM1MCR_PWMMR6S_MASK 0x100000
#define PWM1MCR_PWMMR6S 0x100000
#define PWM1MCR_PWMMR6S_BIT 20

#define PWM1MR0 (*(volatile unsigned long *)0xE0018018)
#define PWM1MR0_OFFSET 0x18

#define PWM1MR1 (*(volatile unsigned long *)0xE001801C)
#define PWM1MR1_OFFSET 0x1C

#define PWM1MR2 (*(volatile unsigned long *)0xE0018020)
#define PWM1MR2_OFFSET 0x20

#define PWM1MR3 (*(volatile unsigned long *)0xE0018024)
#define PWM1MR3_OFFSET 0x24

#define PWM1CCR (*(volatile unsigned long *)0xE0018028)
#define PWM1CCR_OFFSET 0x28
#define PWM1CCR_CAP0RE_MASK 0x1
#define PWM1CCR_CAP0RE 0x1
#define PWM1CCR_CAP0RE_BIT 0
#define PWM1CCR_CAP0FE_MASK 0x2
#define PWM1CCR_CAP0FE 0x2
#define PWM1CCR_CAP0FE_BIT 1
#define PWM1CCR_CAP0I_MASK 0x4
#define PWM1CCR_CAP0I 0x4
#define PWM1CCR_CAP0I_BIT 2
#define PWM1CCR_CAP1RE_MASK 0x8
#define PWM1CCR_CAP1RE 0x8
#define PWM1CCR_CAP1RE_BIT 3
#define PWM1CCR_CAP1FE_MASK 0x10
#define PWM1CCR_CAP1FE 0x10
#define PWM1CCR_CAP1FE_BIT 4
#define PWM1CCR_CAP1I_MASK 0x20
#define PWM1CCR_CAP1I 0x20
#define PWM1CCR_CAP1I_BIT 5
#define PWM1CCR_CAP2RE_MASK 0x80
#define PWM1CCR_CAP2RE 0x80
#define PWM1CCR_CAP2RE_BIT 7
#define PWM1CCR_CAP2FE_MASK 0x80
#define PWM1CCR_CAP2FE 0x80
#define PWM1CCR_CAP2FE_BIT 7
#define PWM1CCR_CAP2I_MASK 0x100
#define PWM1CCR_CAP2I 0x100
#define PWM1CCR_CAP2I_BIT 8
#define PWM1CCR_CAP3RE_MASK 0x200
#define PWM1CCR_CAP3RE 0x200
#define PWM1CCR_CAP3RE_BIT 9
#define PWM1CCR_CAP3FE_MASK 0x400
#define PWM1CCR_CAP3FE 0x400
#define PWM1CCR_CAP3FE_BIT 10
#define PWM1CCR_CAP3I_MASK 0x800
#define PWM1CCR_CAP3I 0x800
#define PWM1CCR_CAP3I_BIT 11

#define PWM1CR0 (*(volatile unsigned long *)0xE001802C)
#define PWM1CR0_OFFSET 0x2C

#define PWM1CR1 (*(volatile unsigned long *)0xE0018030)
#define PWM1CR1_OFFSET 0x30

#define PWM1CR2 (*(volatile unsigned long *)0xE0018034)
#define PWM1CR2_OFFSET 0x34

#define PWM1CR3 (*(volatile unsigned long *)0xE0018038)
#define PWM1CR3_OFFSET 0x38

#define PWM1EMR (*(volatile unsigned long *)0xE001803C)
#define PWM1EMR_OFFSET 0x3C
#define PWM1EMR_EM0_MASK 0x1
#define PWM1EMR_EM0 0x1
#define PWM1EMR_EM0_BIT 0
#define PWM1EMR_EM1_MASK 0x2
#define PWM1EMR_EM1 0x2
#define PWM1EMR_EM1_BIT 1
#define PWM1EMR_EM2_MASK 0x4
#define PWM1EMR_EM2 0x4
#define PWM1EMR_EM2_BIT 2
#define PWM1EMR_EM3_MASK 0x8
#define PWM1EMR_EM3 0x8
#define PWM1EMR_EM3_BIT 3
#define PWM1EMR_EMC0_MASK 0x30
#define PWM1EMR_EMC0_BIT 4
#define PWM1EMR_EMC1_MASK 0xC0
#define PWM1EMR_EMC1_BIT 6
#define PWM1EMR_EMC2_MASK 0x300
#define PWM1EMR_EMC2_BIT 8
#define PWM1EMR_EMC3_MASK 0xC00
#define PWM1EMR_EMC3_BIT 10

#define PWM1MR4 (*(volatile unsigned long *)0xE0018040)
#define PWM1MR4_OFFSET 0x40

#define PWM1MR5 (*(volatile unsigned long *)0xE0018044)
#define PWM1MR5_OFFSET 0x44

#define PWM1MR6 (*(volatile unsigned long *)0xE0018048)
#define PWM1MR6_OFFSET 0x48

#define PWM1PCR (*(volatile unsigned long *)0xE001804C)
#define PWM1PCR_OFFSET 0x4C
#define PWM1PCR_PWMSEL2_MASK 0x4
#define PWM1PCR_PWMSEL2 0x4
#define PWM1PCR_PWMSEL2_BIT 2
#define PWM1PCR_PWMSEL3_MASK 0x8
#define PWM1PCR_PWMSEL3 0x8
#define PWM1PCR_PWMSEL3_BIT 3
#define PWM1PCR_PWMSEL4_MASK 0x10
#define PWM1PCR_PWMSEL4 0x10
#define PWM1PCR_PWMSEL4_BIT 4
#define PWM1PCR_PWMSEL5_MASK 0x20
#define PWM1PCR_PWMSEL5 0x20
#define PWM1PCR_PWMSEL5_BIT 5
#define PWM1PCR_PWMSEL6_MASK 0x40
#define PWM1PCR_PWMSEL6 0x40
#define PWM1PCR_PWMSEL6_BIT 6
#define PWM1PCR_PWMENA1_MASK 0x200
#define PWM1PCR_PWMENA1 0x200
#define PWM1PCR_PWMENA1_BIT 9
#define PWM1PCR_PWMENA2_MASK 0x400
#define PWM1PCR_PWMENA2 0x400
#define PWM1PCR_PWMENA2_BIT 10
#define PWM1PCR_PWMENA3_MASK 0x800
#define PWM1PCR_PWMENA3 0x800
#define PWM1PCR_PWMENA3_BIT 11
#define PWM1PCR_PWMENA4_MASK 0x1000
#define PWM1PCR_PWMENA4 0x1000
#define PWM1PCR_PWMENA4_BIT 12
#define PWM1PCR_PWMENA5_MASK 0x2000
#define PWM1PCR_PWMENA5 0x2000
#define PWM1PCR_PWMENA5_BIT 13
#define PWM1PCR_PWMENA6_MASK 0x4000
#define PWM1PCR_PWMENA6 0x4000
#define PWM1PCR_PWMENA6_BIT 14

#define PWM1LER (*(volatile unsigned long *)0xE0018050)
#define PWM1LER_OFFSET 0x50
#define PWM1LER_Enable_PWM_Match_0_Latch_MASK 0x1
#define PWM1LER_Enable_PWM_Match_0_Latch 0x1
#define PWM1LER_Enable_PWM_Match_0_Latch_BIT 0
#define PWM1LER_Enable_PWM_Match_1_Latch_MASK 0x2
#define PWM1LER_Enable_PWM_Match_1_Latch 0x2
#define PWM1LER_Enable_PWM_Match_1_Latch_BIT 1
#define PWM1LER_Enable_PWM_Match_2_Latch_MASK 0x4
#define PWM1LER_Enable_PWM_Match_2_Latch 0x4
#define PWM1LER_Enable_PWM_Match_2_Latch_BIT 2
#define PWM1LER_Enable_PWM_Match_3_Latch_MASK 0x8
#define PWM1LER_Enable_PWM_Match_3_Latch 0x8
#define PWM1LER_Enable_PWM_Match_3_Latch_BIT 3
#define PWM1LER_Enable_PWM_Match_4_Latch_MASK 0x10
#define PWM1LER_Enable_PWM_Match_4_Latch 0x10
#define PWM1LER_Enable_PWM_Match_4_Latch_BIT 4
#define PWM1LER_Enable_PWM_Match_5_Latch_MASK 0x20
#define PWM1LER_Enable_PWM_Match_5_Latch 0x20
#define PWM1LER_Enable_PWM_Match_5_Latch_BIT 5
#define PWM1LER_Enable_PWM_Match_6_Latch_MASK 0x40
#define PWM1LER_Enable_PWM_Match_6_Latch 0x40
#define PWM1LER_Enable_PWM_Match_6_Latch_BIT 6

#define PWM1CTCR (*(volatile unsigned long *)0xE0018070)
#define PWM1CTCR_OFFSET 0x70
#define PWM1CTCR_Counter_Timer_Mode_MASK 0x3
#define PWM1CTCR_Counter_Timer_Mode_BIT 0
#define PWM1CTCR_Count_Input_Select_MASK 0xC
#define PWM1CTCR_Count_Input_Select_BIT 2

#define I2C0_BASE 0xE001C000

