FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define MIN (*(volatile unsigned long *)0xE0024024)
#define MIN_OFFSET 0x24

#define HOUR (*(volatile unsigned long *)0xE0024028)
#define HOUR_OFFSET 0x28

#define DOM (*(volatile unsigned long *)0xE002402C)
#define DOM_OFFSET 0x2C

#define DOW (*(volatile unsigned long *)0xE0024030)
#define DOW_OFFSET 0x30

#define DOY (*(volatile unsigned long *)0xE0024034)
#define DOY_OFFSET 0x34

#define MONTH (*(volatile unsigned long *)0xE0024038)
#define MONTH_OFFSET 0x38

#define YEAR (*(volatile unsigned long *)0xE002403C)
#define YEAR_OFFSET 0x3C

#define ALSEC (*(volatile unsigned long *)0xE0024060)
#define ALSEC_OFFSET 0x60

#define ALMIN (*(volatile unsigned long *)0xE0024064)
#define ALMIN_OFFSET 0x64

#define ALHOUR (*(volatile unsigned long *)0xE0024068)
#define ALHOUR_OFFSET 0x68

#define ALDOM (*(volatile unsigned long *)0xE002406C)
#define ALDOM_OFFSET 0x6C

#define ALDOW (*(volatile unsigned long *)0xE0024070)
#define ALDOW_OFFSET 0x70

#define ALDOY (*(volatile unsigned long *)0xE0024074)
#define ALDOY_OFFSET 0x74

#define ALMON (*(volatile unsigned long *)0xE0024078)
#define ALMON_OFFSET 0x78

#define ALYEAR (*(volatile unsigned long *)0xE002407C)
#define ALYEAR_OFFSET 0x7C

#define PREINT (*(volatile unsigned long *)0xE0024080)
#define PREINT_OFFSET 0x80

#define PREFRAC (*(volatile unsigned long *)0xE0024084)
#define PREFRAC_OFFSET 0x84

#define GPIO_BASE 0xE0028000

#define IO0PIN (*(volatile unsigned long *)0xE0028000)
#define IO0PIN_OFFSET 0x0

#define IO0SET (*(volatile unsigned long *)0xE0028004)
#define IO0SET_OFFSET 0x4

#define IO0DIR (*(volatile unsigned long *)0xE0028008)
#define IO0DIR_OFFSET 0x8

#define IO0CLR (*(volatile unsigned long *)0xE002800C)
#define IO0CLR_OFFSET 0xC

#define IO1PIN (*(volatile unsigned long *)0xE0028010)
#define IO1PIN_OFFSET 0x10

#define IO1SET (*(volatile unsigned long *)0xE0028014)
#define IO1SET_OFFSET 0x14

#define IO1DIR (*(volatile unsigned long *)0xE0028018)
#define IO1DIR_OFFSET 0x18

#define IO1CLR (*(volatile unsigned long *)0xE002801C)
#define IO1CLR_OFFSET 0x1C

#define IOIntStatus (*(volatile unsigned long *)0xE0028080)
#define IOIntStatus_OFFSET 0x80
#define IOIntStatus_P0Int_MASK 0x1
#define IOIntStatus_P0Int 0x1
#define IOIntStatus_P0Int_BIT 0
#define IOIntStatus_P2Int_MASK 0x4
#define IOIntStatus_P2Int 0x4
#define IOIntStatus_P2Int_BIT 2

#define IO0IntStatR (*(volatile unsigned long *)0xE0028084)
#define IO0IntStatR_OFFSET 0x84

#define IO0IntStatF (*(volatile unsigned long *)0xE0028088)
#define IO0IntStatF_OFFSET 0x88

#define IO0IntClr (*(volatile unsigned long *)0xE002808C)
#define IO0IntClr_OFFSET 0x8C

#define IO0IntEnR (*(volatile unsigned long *)0xE0028090)
#define IO0IntEnR_OFFSET 0x90

#define IO0IntEnF (*(volatile unsigned long *)0xE0028094)
#define IO0IntEnF_OFFSET 0x94

#define IO2IntStatR (*(volatile unsigned long *)0xE00280A4)
#define IO2IntStatR_OFFSET 0xA4

#define IO2IntStatF (*(volatile unsigned long *)0xE00280A8)
#define IO2IntStatF_OFFSET 0xA8

#define IO2IntClr (*(volatile unsigned long *)0xE00280AC)
#define IO2IntClr_OFFSET 0xAC

#define IO2IntEnR (*(volatile unsigned long *)0xE00280B0)
#define IO2IntEnR_OFFSET 0xB0

#define IO2IntEnF (*(volatile unsigned long *)0xE00280B4)
#define IO2IntEnF_OFFSET 0xB4

#define PCB_BASE 0xE002C000

#define PINSEL0 (*(volatile unsigned long *)0xE002C000)
#define PINSEL0_OFFSET 0x0

#define PINSEL1 (*(volatile unsigned long *)0xE002C004)
#define PINSEL1_OFFSET 0x4

#define PINSEL2 (*(volatile unsigned long *)0xE002C008)
#define PINSEL2_OFFSET 0x8

#define PINSEL3 (*(volatile unsigned long *)0xE002C00C)
#define PINSEL3_OFFSET 0xC

#define PINSEL4 (*(volatile unsigned long *)0xE002C010)
#define PINSEL4_OFFSET 0x10

#define PINSEL5 (*(volatile unsigned long *)0xE002C014)
#define PINSEL5_OFFSET 0x14

#define PINSEL6 (*(volatile unsigned long *)0xE002C018)
#define PINSEL6_OFFSET 0x18

#define PINSEL7 (*(volatile unsigned long *)0xE002C01C)
#define PINSEL7_OFFSET 0x1C

#define PINSEL8 (*(volatile unsigned long *)0xE002C020)
#define PINSEL8_OFFSET 0x20

#define PINSEL9 (*(volatile unsigned long *)0xE002C024)
#define PINSEL9_OFFSET 0x24

#define PINSEL10 (*(volatile unsigned long *)0xE002C028)
#define PINSEL10_OFFSET 0x28

#define PINSEL11 (*(volatile unsigned long *)0xE002C02C)
#define PINSEL11_OFFSET 0x2C

#define PINMODE0 (*(volatile unsigned long *)0xE002C040)
#define PINMODE0_OFFSET 0x40

#define PINMODE1 (*(volatile unsigned long *)0xE002C044)
#define PINMODE1_OFFSET 0x44

#define PINMODE2 (*(volatile unsigned long *)0xE002C048)
#define PINMODE2_OFFSET 0x48

#define PINMODE3 (*(volatile unsigned long *)0xE002C04C)
#define PINMODE3_OFFSET 0x4C

#define PINMODE4 (*(volatile unsigned long *)0xE002C050)
#define PINMODE4_OFFSET 0x50

#define PINMODE5 (*(volatile unsigned long *)0xE002C054)
#define PINMODE5_OFFSET 0x54

#define PINMODE6 (*(volatile unsigned long *)0xE002C058)
#define PINMODE6_OFFSET 0x58

#define PINMODE7 (*(volatile unsigned long *)0xE002C05C)
#define PINMODE7_OFFSET 0x5C

#define PINMODE8 (*(volatile unsigned long *)0xE002C060)
#define PINMODE8_OFFSET 0x60

#define PINMODE9 (*(volatile unsigned long *)0xE002C064)
#define PINMODE9_OFFSET 0x64

#define PINMODE10 (*(volatile unsigned long *)0xE002C068)
#define PINMODE10_OFFSET 0x68

#define SSP1_BASE 0xE0030000

#define SSP1CR0 (*(volatile unsigned long *)0xE0030000)
#define SSP1CR0_OFFSET 0x0
#define SSP1CR0_SCR_MASK 0xFF00
#define SSP1CR0_SCR_BIT 8
#define SSP1CR0_CPHA_MASK 0x80
#define SSP1CR0_CPHA 0x80
#define SSP1CR0_CPHA_BIT 7
#define SSP1CR0_CPOL_MASK 0x40
#define SSP1CR0_CPOL 0x40
#define SSP1CR0_CPOL_BIT 6
#define SSP1CR0_FRF_MASK 0x30
#define SSP1CR0_FRF_BIT 4
#define SSP1CR0_DSS_MASK 0xF
#define SSP1CR0_DSS_BIT 0

#define SSP1CR1 (*(volatile unsigned long *)0xE0030004)
#define SSP1CR1_OFFSET 0x4
#define SSP1CR1_SOD_MASK 0x8
#define SSP1CR1_SOD 0x8
#define SSP1CR1_SOD_BIT 3
#define SSP1CR1_MS_MASK 0x4
#define SSP1CR1_MS 0x4
#define SSP1CR1_MS_BIT 2
#define SSP1CR1_SSE_MASK 0x2
#define SSP1CR1_SSE 0x2
#define SSP1CR1_SSE_BIT 1
#define SSP1CR1_LBE_MASK 0x1
#define SSP1CR1_LBE 0x1
#define SSP1CR1_LBE_BIT 0

#define SSP1DR (*(volatile unsigned long *)0xE0030008)
#define SSP1DR_OFFSET 0x8

#define SSP1SR (*(volatile unsigned long *)0xE003000C)
#define SSP1SR_OFFSET 0xC
#define SSP1SR_BSY_MASK 0x10
#define SSP1SR_BSY 0x10
#define SSP1SR_BSY_BIT 4
#define SSP1SR_RFF_MASK 0x8
#define SSP1SR_RFF 0x8
#define SSP1SR_RFF_BIT 3
#define SSP1SR_RNE_MASK 0x4
#define SSP1SR_RNE 0x4
#define SSP1SR_RNE_BIT 2
#define SSP1SR_TNF_MASK 0x2
#define SSP1SR_TNF 0x2
#define SSP1SR_TNF_BIT 1
#define SSP1SR_TFE_MASK 0x1
#define SSP1SR_TFE 0x1
#define SSP1SR_TFE_BIT 0

#define SSP1CPSR (*(volatile unsigned long *)0xE0030010)
#define SSP1CPSR_OFFSET 0x10
#define SSP1CPSR_CPSDVSR_MASK 0xFF
#define SSP1CPSR_CPSDVSR_BIT 0

#define SSP1IMSC (*(volatile unsigned long *)0xE0030014)
#define SSP1IMSC_OFFSET 0x14
#define SSP1IMSC_TXIM_MASK 0x8
#define SSP1IMSC_TXIM 0x8
#define SSP1IMSC_TXIM_BIT 3
#define SSP1IMSC_RXIM_MASK 0x4
#define SSP1IMSC_RXIM 0x4
#define SSP1IMSC_RXIM_BIT 2
#define SSP1IMSC_RTIM_MASK 0x2
#define SSP1IMSC_RTIM 0x2
#define SSP1IMSC_RTIM_BIT 1
#define SSP1IMSC_RORIM_MASK 0x1
#define SSP1IMSC_RORIM 0x1
#define SSP1IMSC_RORIM_BIT 0

