FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define U3IIR (*(volatile unsigned long *)0xE007C008)
#define U3IIR_OFFSET 0x8
#define U3IIR_IntStatus_MASK 0x1
#define U3IIR_IntStatus 0x1
#define U3IIR_IntStatus_BIT 0
#define U3IIR_IntId_MASK 0xE
#define U3IIR_IntId_BIT 1
#define U3IIR_FIFO_Enable_MASK 0xC0
#define U3IIR_FIFO_Enable_BIT 6
#define U3IIR_ABEOInt_MASK 0x100
#define U3IIR_ABEOInt 0x100
#define U3IIR_ABEOInt_BIT 8
#define U3IIR_ABTOInt_MASK 0x200
#define U3IIR_ABTOInt 0x200
#define U3IIR_ABTOInt_BIT 9

#define U3FCR (*(volatile unsigned char *)0xE007C008)
#define U3FCR_OFFSET 0x8
#define U3FCR_FIFO_Enable_MASK 0x1
#define U3FCR_FIFO_Enable 0x1
#define U3FCR_FIFO_Enable_BIT 0
#define U3FCR_Rx_FIFO_Reset_MASK 0x2
#define U3FCR_Rx_FIFO_Reset 0x2
#define U3FCR_Rx_FIFO_Reset_BIT 1
#define U3FCR_Tx_FIFO_Reset_MASK 0x4
#define U3FCR_Tx_FIFO_Reset 0x4
#define U3FCR_Tx_FIFO_Reset_BIT 2
#define U3FCR_Rx_Trigger_Level_Select_MASK 0xC0
#define U3FCR_Rx_Trigger_Level_Select_BIT 6

#define U3LCR (*(volatile unsigned char *)0xE007C00C)
#define U3LCR_OFFSET 0xC
#define U3LCR_Word_Length_Select_MASK 0x3
#define U3LCR_Word_Length_Select_BIT 0
#define U3LCR_Stop_Bit_Select_MASK 0x4
#define U3LCR_Stop_Bit_Select 0x4
#define U3LCR_Stop_Bit_Select_BIT 2
#define U3LCR_Parity_Enable_MASK 0x8
#define U3LCR_Parity_Enable 0x8
#define U3LCR_Parity_Enable_BIT 3
#define U3LCR_Parity_Select_MASK 0x30
#define U3LCR_Parity_Select_BIT 4
#define U3LCR_Break_Control_MASK 0x40
#define U3LCR_Break_Control 0x40
#define U3LCR_Break_Control_BIT 6
#define U3LCR_Divisor_Latch_Access_Bit_MASK 0x80
#define U3LCR_Divisor_Latch_Access_Bit 0x80
#define U3LCR_Divisor_Latch_Access_Bit_BIT 7

#define U3LSR (*(volatile unsigned char *)0xE007C014)
#define U3LSR_OFFSET 0x14
#define U3LSR_RDR_MASK 0x1
#define U3LSR_RDR 0x1
#define U3LSR_RDR_BIT 0
#define U3LSR_OE_MASK 0x2
#define U3LSR_OE 0x2
#define U3LSR_OE_BIT 1
#define U3LSR_PE_MASK 0x4
#define U3LSR_PE 0x4
#define U3LSR_PE_BIT 2
#define U3LSR_FE_MASK 0x8
#define U3LSR_FE 0x8
#define U3LSR_FE_BIT 3
#define U3LSR_BI_MASK 0x10
#define U3LSR_BI 0x10
#define U3LSR_BI_BIT 4
#define U3LSR_THRE_MASK 0x20
#define U3LSR_THRE 0x20
#define U3LSR_THRE_BIT 5
#define U3LSR_TEMT_MASK 0x40
#define U3LSR_TEMT 0x40
#define U3LSR_TEMT_BIT 6
#define U3LSR_RXFE_MASK 0x80
#define U3LSR_RXFE 0x80
#define U3LSR_RXFE_BIT 7

#define U3SCR (*(volatile unsigned char *)0xE007C01C)
#define U3SCR_OFFSET 0x1C

#define U3ACR (*(volatile unsigned long *)0xE007C020)
#define U3ACR_OFFSET 0x20
#define U3ACR_Start_MASK 0x1
#define U3ACR_Start 0x1
#define U3ACR_Start_BIT 0
#define U3ACR_Mode_MASK 0x2
#define U3ACR_Mode 0x2
#define U3ACR_Mode_BIT 1
#define U3ACR_AutoRestart_MASK 0x4
#define U3ACR_AutoRestart 0x4
#define U3ACR_AutoRestart_BIT 2
#define U3ACR_ABEOIntClr_MASK 0x100
#define U3ACR_ABEOIntClr 0x100
#define U3ACR_ABEOIntClr_BIT 8
#define U3ACR_ABTOIntClr_MASK 0x200
#define U3ACR_ABTOIntClr 0x200
#define U3ACR_ABTOIntClr_BIT 9

#define U3ICR (*(volatile unsigned long *)0xE007C024)
#define U3ICR_OFFSET 0x24
#define U3ICR_IrDAEn_MASK 0x1
#define U3ICR_IrDAEn 0x1
#define U3ICR_IrDAEn_BIT 0
#define U3ICR_IrDAInv_MASK 0x2
#define U3ICR_IrDAInv 0x2
#define U3ICR_IrDAInv_BIT 1
#define U3ICR_FixPulse_En_MASK 0x4
#define U3ICR_FixPulse_En 0x4
#define U3ICR_FixPulse_En_BIT 2
#define U3ICR_PulseDiv_MASK 0x38
#define U3ICR_PulseDiv_BIT 3

#define U3FDR (*(volatile unsigned long *)0xE007C028)
#define U3FDR_OFFSET 0x28
#define U3FDR_DIVADDVAL_MASK 0xF
#define U3FDR_DIVADDVAL_BIT 0
#define U3FDR_MULVAL_MASK 0xF0
#define U3FDR_MULVAL_BIT 4

#define U3TER (*(volatile unsigned char *)0xE007C030)
#define U3TER_OFFSET 0x30
#define U3TER_TXEN_MASK 0x80
#define U3TER_TXEN 0x80
#define U3TER_TXEN_BIT 7

#define I2C2_BASE 0xE0080000

#define I2C2CONSET (*(volatile unsigned char *)0xE0080000)
#define I2C2CONSET_OFFSET 0x0
#define I2C2CONSET_AA_MASK 0x4
#define I2C2CONSET_AA 0x4
#define I2C2CONSET_AA_BIT 2
#define I2C2CONSET_SI_MASK 0x8
#define I2C2CONSET_SI 0x8
#define I2C2CONSET_SI_BIT 3
#define I2C2CONSET_STO_MASK 0x10
#define I2C2CONSET_STO 0x10
#define I2C2CONSET_STO_BIT 4
#define I2C2CONSET_STA_MASK 0x20
#define I2C2CONSET_STA 0x20
#define I2C2CONSET_STA_BIT 5
#define I2C2CONSET_I2EN_MASK 0x40
#define I2C2CONSET_I2EN 0x40
#define I2C2CONSET_I2EN_BIT 6

#define I2C2STAT (*(volatile unsigned char *)0xE0080004)
#define I2C2STAT_OFFSET 0x4
#define I2C2STAT_Status_MASK 0x7C
#define I2C2STAT_Status_BIT 2

#define I2C2DAT (*(volatile unsigned char *)0xE0080008)
#define I2C2DAT_OFFSET 0x8

#define I2C2ADR (*(volatile unsigned char *)0xE008000C)
#define I2C2ADR_OFFSET 0xC
#define I2C2ADR_GC_MASK 0x1
#define I2C2ADR_GC 0x1
#define I2C2ADR_GC_BIT 0
#define I2C2ADR_Address_MASK 0x7E
#define I2C2ADR_Address_BIT 1

#define I2C2SCLH (*(volatile unsigned short *)0xE0080010)
#define I2C2SCLH_OFFSET 0x10

#define I2C2SCLL (*(volatile unsigned short *)0xE0080014)
#define I2C2SCLL_OFFSET 0x14

#define I2C2CONCLR (*(volatile unsigned char *)0xE0080018)
#define I2C2CONCLR_OFFSET 0x18
#define I2C2CONCLR_AAC_MASK 0x4
#define I2C2CONCLR_AAC 0x4
#define I2C2CONCLR_AAC_BIT 2
#define I2C2CONCLR_SIC_MASK 0x8
#define I2C2CONCLR_SIC 0x8
#define I2C2CONCLR_SIC_BIT 3
#define I2C2CONCLR_STAC_MASK 0x20
#define I2C2CONCLR_STAC 0x20
#define I2C2CONCLR_STAC_BIT 5
#define I2C2CONCLR_I2ENC_MASK 0x40
#define I2C2CONCLR_I2ENC 0x40
#define I2C2CONCLR_I2ENC_BIT 6

#define I2S_BASE 0xE0088000

#define I2SDAO (*(volatile unsigned long *)0xE0088000)
#define I2SDAO_OFFSET 0x0
#define I2SDAO_wordwidth_MASK 0x3
#define I2SDAO_wordwidth_BIT 0
#define I2SDAO_mono_MASK 0x4
#define I2SDAO_mono 0x4
#define I2SDAO_mono_BIT 2
#define I2SDAO_stop_MASK 0x8
#define I2SDAO_stop 0x8
#define I2SDAO_stop_BIT 3
#define I2SDAO_reset_MASK 0x10
#define I2SDAO_reset 0x10
#define I2SDAO_reset_BIT 4
#define I2SDAO_ws_sel_MASK 0x20
#define I2SDAO_ws_sel 0x20
#define I2SDAO_ws_sel_BIT 5
#define I2SDAO_ws_halfperiod_MASK 0x3FC0
#define I2SDAO_ws_halfperiod_BIT 6
#define I2SDAO_mute_MASK 0x8000
#define I2SDAO_mute 0x8000
#define I2SDAO_mute_BIT 15

#define I2SDAI (*(volatile unsigned long *)0xE0088004)
#define I2SDAI_OFFSET 0x4
#define I2SDAI_wordwidth_MASK 0x3
#define I2SDAI_wordwidth_BIT 0
#define I2SDAI_mono_MASK 0x4
#define I2SDAI_mono 0x4
#define I2SDAI_mono_BIT 2
#define I2SDAI_stop_MASK 0x8
#define I2SDAI_stop 0x8
#define I2SDAI_stop_BIT 3
#define I2SDAI_reset_MASK 0x10
#define I2SDAI_reset 0x10
#define I2SDAI_reset_BIT 4
#define I2SDAI_ws_sel_MASK 0x20
#define I2SDAI_ws_sel 0x20
#define I2SDAI_ws_sel_BIT 5
#define I2SDAI_ws_halfperiod_MASK 0x3FC0
#define I2SDAI_ws_halfperiod_BIT 6

#define I2STXFIFO (*(volatile unsigned long *)0xE0088008)
#define I2STXFIFO_OFFSET 0x8

#define I2SRXFIFO (*(volatile unsigned long *)0xE008800C)
#define I2SRXFIFO_OFFSET 0xC

#define I2SSTATE (*(volatile unsigned long *)0xE0088010)
#define I2SSTATE_OFFSET 0x10
#define I2SSTATE_irq_MASK 0x1
#define I2SSTATE_irq 0x1
#define I2SSTATE_irq_BIT 0
#define I2SSTATE_dmareq1_MASK 0x2
#define I2SSTATE_dmareq1 0x2
#define I2SSTATE_dmareq1_BIT 1
#define I2SSTATE_dmareq2_MASK 0x4
#define I2SSTATE_dmareq2 0x4
#define I2SSTATE_dmareq2_BIT 2
#define I2SSTATE_rx_level_MASK 0xFF00
#define I2SSTATE_rx_level_BIT 8
#define I2SSTATE_tx_level_MASK 0xFF0000
#define I2SSTATE_tx_level_BIT 16

#define I2SDMA1 (*(volatile unsigned long *)0xE0088014)
#define I2SDMA1_OFFSET 0x14
#define I2SDMA1_rx_dma1_enable_MASK 0x1
#define I2SDMA1_rx_dma1_enable 0x1
#define I2SDMA1_rx_dma1_enable_BIT 0
#define I2SDMA1_tx_dma1_enable_MASK 0x2
#define I2SDMA1_tx_dma1_enable 0x2
#define I2SDMA1_tx_dma1_enable_BIT 1
#define I2SDMA1_rx_depth_dma1_MASK 0xFF00
#define I2SDMA1_rx_depth_dma1_BIT 8
#define I2SDMA1_tx_depth_dma1_MASK 0xFF0000
#define I2SDMA1_tx_depth_dma1_BIT 16

#define I2SDMA2 (*(volatile unsigned long *)0xE0088018)
#define I2SDMA2_OFFSET 0x18
#define I2SDMA2_rx_dma2_enable_MASK 0x1
#define I2SDMA2_rx_dma2_enable 0x1
#define I2SDMA2_rx_dma2_enable_BIT 0
#define I2SDMA2_tx_dma2_enable_MASK 0x2
#define I2SDMA2_tx_dma2_enable 0x2
#define I2SDMA2_tx_dma2_enable_BIT 1
#define I2SDMA2_rx_depth_dma2_MASK 0xFF00
#define I2SDMA2_rx_depth_dma2_BIT 8
#define I2SDMA2_tx_depth_dma2_MASK 0xFF0000
#define I2SDMA2_tx_depth_dma2_BIT 16

#define I2SIRQ (*(volatile unsigned long *)0xE008801C)
#define I2SIRQ_OFFSET 0x1C
#define I2SIRQ_rx_irq_enable_MASK 0x1
#define I2SIRQ_rx_irq_enable 0x1
#define I2SIRQ_rx_irq_enable_BIT 0
#define I2SIRQ_tx_irq_enable_MASK 0x2
#define I2SIRQ_tx_irq_enable 0x2
#define I2SIRQ_tx_irq_enable_BIT 1
#define I2SIRQ_rx_depth_irq_MASK 0xFF00
#define I2SIRQ_rx_depth_irq_BIT 8
#define I2SIRQ_tx_depth_irq_MASK 0xFF0000
#define I2SIRQ_tx_depth_irq_BIT 16

#define I2STXRATE (*(volatile unsigned long *)0xE0088020)
#define I2STXRATE_OFFSET 0x20
#define I2STXRATE_tx_rate_MASK 0x3FF
#define I2STXRATE_tx_rate_BIT 0

#define I2SRXRATE (*(volatile unsigned long *)0xE0088024)
#define I2SRXRATE_OFFSET 0x24
#define I2SRXRATE_rx_rate_MASK 0x3FF
#define I2SRXRATE_rx_rate_BIT 0

#define MCI_BASE 0xE008C000

#define MCIPower (*(volatile unsigned long *)0xE008C000)
#define MCIPower_OFFSET 0x0
#define MCIPower_Ctrl_MASK 0x3
#define MCIPower_Ctrl_BIT 0
#define MCIPower_OpenDrain_MASK 0x40
#define MCIPower_OpenDrain 0x40
#define MCIPower_OpenDrain_BIT 6
#define MCIPower_Rod_MASK 0x80
#define MCIPower_Rod 0x80
#define MCIPower_Rod_BIT 7

#define MCIClock (*(volatile unsigned long *)0xE008C004)
#define MCIClock_OFFSET 0x4
#define MCIClock_ClkDiv_MASK 0xFF
#define MCIClock_ClkDiv_BIT 0
#define MCIClock_Enable_MASK 0x100
#define MCIClock_Enable 0x100
#define MCIClock_Enable_BIT 8
#define MCIClock_PwrSave_MASK 0x200
#define MCIClock_PwrSave 0x200
#define MCIClock_PwrSave_BIT 9
#define MCIClock_Bypass_MASK 0x400
#define MCIClock_Bypass 0x400
#define MCIClock_Bypass_BIT 10
#define MCIClock_WideBus_MASK 0x800
#define MCIClock_WideBus 0x800
#define MCIClock_WideBus_BIT 11

#define MCIArgument (*(volatile unsigned long *)0xE008C008)
#define MCIArgument_OFFSET 0x8

#define MCICommand (*(volatile unsigned long *)0xE008C00C)
#define MCICommand_OFFSET 0xC
#define MCICommand_CmdIndex_MASK 0x3F
#define MCICommand_CmdIndex_BIT 0
#define MCICommand_Response_MASK 0x40
#define MCICommand_Response 0x40
#define MCICommand_Response_BIT 6
#define MCICommand_LongRsp_MASK 0x80
#define MCICommand_LongRsp 0x80
#define MCICommand_LongRsp_BIT 7
#define MCICommand_Interrupt_MASK 0x100
#define MCICommand_Interrupt 0x100
#define MCICommand_Interrupt_BIT 8
#define MCICommand_Pending_MASK 0x200
#define MCICommand_Pending 0x200
#define MCICommand_Pending_BIT 9
#define MCICommand_Enable_MASK 0x400
#define MCICommand_Enable 0x400
#define MCICommand_Enable_BIT 10

#define MCIRespCmd (*(volatile unsigned long *)0xE008C010)
#define MCIRespCmd_OFFSET 0x10
#define MCIRespCmd_RespCmd_MASK 0x3F
#define MCIRespCmd_RespCmd_BIT 0

#define MCIResponse0 (*(volatile unsigned long *)0xE008C014)
#define MCIResponse0_OFFSET 0x14

#define MCIResponse1 (*(volatile unsigned long *)0xE008C018)
#define MCIResponse1_OFFSET 0x18

