FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define PLLSTAT (*(volatile unsigned long *)0xE01FC088)
#define PLLSTAT_OFFSET 0x88
#define PLLSTAT_MSEL_MASK 0x7FFF
#define PLLSTAT_MSEL_BIT 0
#define PLLSTAT_NSEL_MASK 0xFF0000
#define PLLSTAT_NSEL_BIT 16
#define PLLSTAT_PLLE_MASK 0x1000000
#define PLLSTAT_PLLE 0x1000000
#define PLLSTAT_PLLE_BIT 24
#define PLLSTAT_PLLC_MASK 0x2000000
#define PLLSTAT_PLLC 0x2000000
#define PLLSTAT_PLLC_BIT 25
#define PLLSTAT_PLOCK_MASK 0x4000000
#define PLLSTAT_PLOCK 0x4000000
#define PLLSTAT_PLOCK_BIT 26

#define PLLFEED (*(volatile unsigned char *)0xE01FC08C)
#define PLLFEED_OFFSET 0x8C

#define PCON (*(volatile unsigned char *)0xE01FC0C0)
#define PCON_OFFSET 0xC0
#define PCON_IDL_MASK 0x1
#define PCON_IDL 0x1
#define PCON_IDL_BIT 0
#define PCON_PD_MASK 0x2
#define PCON_PD 0x2
#define PCON_PD_BIT 1
#define PCON_BODPDM_MASK 0x4
#define PCON_BODPDM 0x4
#define PCON_BODPDM_BIT 2
#define PCON_BOGD_MASK 0x8
#define PCON_BOGD 0x8
#define PCON_BOGD_BIT 3
#define PCON_BORD_MASK 0x10
#define PCON_BORD 0x10
#define PCON_BORD_BIT 4
#define PCON_PM2_MASK 0x80
#define PCON_PM2 0x80
#define PCON_PM2_BIT 7

#define PCONP (*(volatile unsigned long *)0xE01FC0C4)
#define PCONP_OFFSET 0xC4
#define PCONP_PCTIM0_MASK 0x2
#define PCONP_PCTIM0 0x2
#define PCONP_PCTIM0_BIT 1
#define PCONP_PCTIM1_MASK 0x4
#define PCONP_PCTIM1 0x4
#define PCONP_PCTIM1_BIT 2
#define PCONP_PCUART0_MASK 0x8
#define PCONP_PCUART0 0x8
#define PCONP_PCUART0_BIT 3
#define PCONP_PCUART1_MASK 0x10
#define PCONP_PCUART1 0x10
#define PCONP_PCUART1_BIT 4
#define PCONP_PCPWM0_MASK 0x20
#define PCONP_PCPWM0 0x20
#define PCONP_PCPWM0_BIT 5
#define PCONP_PCPWM1_MASK 0x40
#define PCONP_PCPWM1 0x40
#define PCONP_PCPWM1_BIT 6
#define PCONP_PCI2C0_MASK 0x80
#define PCONP_PCI2C0 0x80
#define PCONP_PCI2C0_BIT 7
#define PCONP_PCSPI_MASK 0x100
#define PCONP_PCSPI 0x100
#define PCONP_PCSPI_BIT 8
#define PCONP_PCRTC_MASK 0x200
#define PCONP_PCRTC 0x200
#define PCONP_PCRTC_BIT 9
#define PCONP_PCSSP1_MASK 0x400
#define PCONP_PCSSP1 0x400
#define PCONP_PCSSP1_BIT 10
#define PCONP_PCEMC_MASK 0x800
#define PCONP_PCEMC 0x800
#define PCONP_PCEMC_BIT 11
#define PCONP_PCAD_MASK 0x1000
#define PCONP_PCAD 0x1000
#define PCONP_PCAD_BIT 12
#define PCONP_PCAN1_MASK 0x2000
#define PCONP_PCAN1 0x2000
#define PCONP_PCAN1_BIT 13
#define PCONP_PCAN2_MASK 0x4000
#define PCONP_PCAN2 0x4000
#define PCONP_PCAN2_BIT 14
#define PCONP_PCI2C1_MASK 0x80000
#define PCONP_PCI2C1 0x80000
#define PCONP_PCI2C1_BIT 19
#define PCONP_PCLCD_MASK 0x100000
#define PCONP_PCLCD 0x100000
#define PCONP_PCLCD_BIT 20
#define PCONP_PCSSP0_MASK 0x200000
#define PCONP_PCSSP0 0x200000
#define PCONP_PCSSP0_BIT 21
#define PCONP_PCTIM2_MASK 0x400000
#define PCONP_PCTIM2 0x400000
#define PCONP_PCTIM2_BIT 22
#define PCONP_PCTIM3_MASK 0x800000
#define PCONP_PCTIM3 0x800000
#define PCONP_PCTIM3_BIT 23
#define PCONP_PCUART2_MASK 0x1000000
#define PCONP_PCUART2 0x1000000
#define PCONP_PCUART2_BIT 24
#define PCONP_PCUART3_MASK 0x2000000
#define PCONP_PCUART3 0x2000000
#define PCONP_PCUART3_BIT 25
#define PCONP_PCI2C2_MASK 0x4000000
#define PCONP_PCI2C2 0x4000000
#define PCONP_PCI2C2_BIT 26
#define PCONP_PCI2CS_MASK 0x8000000
#define PCONP_PCI2CS 0x8000000
#define PCONP_PCI2CS_BIT 27
#define PCONP_PCSDC_MASK 0x10000000
#define PCONP_PCSDC 0x10000000
#define PCONP_PCSDC_BIT 28
#define PCONP_PCGPDMA_MASK 0x20000000
#define PCONP_PCGPDMA 0x20000000
#define PCONP_PCGPDMA_BIT 29
#define PCONP_PCENET_MASK 0x40000000
#define PCONP_PCENET 0x40000000
#define PCONP_PCENET_BIT 30
#define PCONP_PUSB_MASK 0x80000000
#define PCONP_PUSB 0x80000000
#define PCONP_PUSB_BIT 31

#define CCLKCFG (*(volatile unsigned long *)0xE01FC104)
#define CCLKCFG_OFFSET 0x104
#define CCLKCFG_CCLKSEL_MASK 0xFF
#define CCLKCFG_CCLKSEL_BIT 0

#define USBCLKCFG (*(volatile unsigned long *)0xE01FC108)
#define USBCLKCFG_OFFSET 0x108
#define USBCLKCFG_USBSEL_MASK 0xF
#define USBCLKCFG_USBSEL_BIT 0

#define CLKSRCSEL (*(volatile unsigned char *)0xE01FC10C)
#define CLKSRCSEL_OFFSET 0x10C
#define CLKSRCSEL_CLKSRC_MASK 0x3
#define CLKSRCSEL_CLKSRC_BIT 0

#define EXTINT (*(volatile unsigned char *)0xE01FC140)
#define EXTINT_OFFSET 0x140
#define EXTINT_EINT0_MASK 0x1
#define EXTINT_EINT0 0x1
#define EXTINT_EINT0_BIT 0
#define EXTINT_EINT1_MASK 0x2
#define EXTINT_EINT1 0x2
#define EXTINT_EINT1_BIT 1
#define EXTINT_EINT2_MASK 0x4
#define EXTINT_EINT2 0x4
#define EXTINT_EINT2_BIT 2
#define EXTINT_EINT3_MASK 0x8
#define EXTINT_EINT3 0x8
#define EXTINT_EINT3_BIT 3

#define INTWAKE (*(volatile unsigned short *)0xE01FC144)
#define INTWAKE_OFFSET 0x144
#define INTWAKE_EXTWAKE0_MASK 0x1
#define INTWAKE_EXTWAKE0 0x1
#define INTWAKE_EXTWAKE0_BIT 0
#define INTWAKE_EXTWAKE1_MASK 0x2
#define INTWAKE_EXTWAKE1 0x2
#define INTWAKE_EXTWAKE1_BIT 1
#define INTWAKE_EXTWAKE2_MASK 0x4
#define INTWAKE_EXTWAKE2 0x4
#define INTWAKE_EXTWAKE2_BIT 2
#define INTWAKE_EXTWAKE3_MASK 0x8
#define INTWAKE_EXTWAKE3 0x8
#define INTWAKE_EXTWAKE3_BIT 3
#define INTWAKE_ETHWAKE_MASK 0x10
#define INTWAKE_ETHWAKE 0x10
#define INTWAKE_ETHWAKE_BIT 4
#define INTWAKE_USBWAKE_MASK 0x20
#define INTWAKE_USBWAKE 0x20
#define INTWAKE_USBWAKE_BIT 5
#define INTWAKE_CANWAKE_MASK 0x40
#define INTWAKE_CANWAKE 0x40
#define INTWAKE_CANWAKE_BIT 6
#define INTWAKE_GPIOWAKE_MASK 0x80
#define INTWAKE_GPIOWAKE 0x80
#define INTWAKE_GPIOWAKE_BIT 7
#define INTWAKE_BODWAKE_MASK 0x4000
#define INTWAKE_BODWAKE 0x4000
#define INTWAKE_BODWAKE_BIT 14
#define INTWAKE_RTCWAKE_MASK 0x8000
#define INTWAKE_RTCWAKE 0x8000
#define INTWAKE_RTCWAKE_BIT 15

#define EXTMODE (*(volatile unsigned char *)0xE01FC148)
#define EXTMODE_OFFSET 0x148
#define EXTMODE_EXTMODE0_MASK 0x1
#define EXTMODE_EXTMODE0 0x1
#define EXTMODE_EXTMODE0_BIT 0
#define EXTMODE_EXTMODE1_MASK 0x2
#define EXTMODE_EXTMODE1 0x2
#define EXTMODE_EXTMODE1_BIT 1
#define EXTMODE_EXTMODE2_MASK 0x4
#define EXTMODE_EXTMODE2 0x4
#define EXTMODE_EXTMODE2_BIT 2
#define EXTMODE_EXTMODE3_MASK 0x8
#define EXTMODE_EXTMODE3 0x8
#define EXTMODE_EXTMODE3_BIT 3

#define EXTPOLAR (*(volatile unsigned char *)0xE01FC14C)
#define EXTPOLAR_OFFSET 0x14C
#define EXTPOLAR_EXTPOLAR0_MASK 0x1
#define EXTPOLAR_EXTPOLAR0 0x1
#define EXTPOLAR_EXTPOLAR0_BIT 0
#define EXTPOLAR_EXTPOLAR1_MASK 0x2
#define EXTPOLAR_EXTPOLAR1 0x2
#define EXTPOLAR_EXTPOLAR1_BIT 1
#define EXTPOLAR_EXTPOLAR2_MASK 0x4
#define EXTPOLAR_EXTPOLAR2 0x4
#define EXTPOLAR_EXTPOLAR2_BIT 2
#define EXTPOLAR_EXTPOLAR3_MASK 0x8
#define EXTPOLAR_EXTPOLAR3 0x8
#define EXTPOLAR_EXTPOLAR3_BIT 3

#define RSID (*(volatile unsigned char *)0xE01FC180)
#define RSID_OFFSET 0x180
#define RSID_POR_MASK 0x1
#define RSID_POR 0x1
#define RSID_POR_BIT 0
#define RSID_EXTR_MASK 0x2
#define RSID_EXTR 0x2
#define RSID_EXTR_BIT 1
#define RSID_WDTR_MASK 0x4
#define RSID_WDTR 0x4
#define RSID_WDTR_BIT 2
#define RSID_BODR_MASK 0x8
#define RSID_BODR 0x8
#define RSID_BODR_BIT 3

