FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define RSV (*(volatile unsigned *)0xFFE00160)
#define RSV_OFFSET 0x160
#define RSV_Receive_byte_count_MASK 0xFFFF
#define RSV_Receive_byte_count_BIT 0
#define RSV_Packet_previously_ignored_MASK 0x10000
#define RSV_Packet_previously_ignored 0x10000
#define RSV_Packet_previously_ignored_BIT 16
#define RSV_RXDV_event_previously_seen_MASK 0x20000
#define RSV_RXDV_event_previously_seen 0x20000
#define RSV_RXDV_event_previously_seen_BIT 17
#define RSV_Carrier_event_previously_seen_MASK 0x40000
#define RSV_Carrier_event_previously_seen 0x40000
#define RSV_Carrier_event_previously_seen_BIT 18
#define RSV_Receive_code_violation_MASK 0x80000
#define RSV_Receive_code_violation 0x80000
#define RSV_Receive_code_violation_BIT 19
#define RSV_CRC_error_MASK 0x100000
#define RSV_CRC_error 0x100000
#define RSV_CRC_error_BIT 20
#define RSV_Length_check_error_MASK 0x200000
#define RSV_Length_check_error 0x200000
#define RSV_Length_check_error_BIT 21
#define RSV_Length_out_of_range_MASK 0x400000
#define RSV_Length_out_of_range 0x400000
#define RSV_Length_out_of_range_BIT 22
#define RSV_Receive_OK_MASK 0x800000
#define RSV_Receive_OK 0x800000
#define RSV_Receive_OK_BIT 23
#define RSV_Multicast_MASK 0x1000000
#define RSV_Multicast 0x1000000
#define RSV_Multicast_BIT 24
#define RSV_Broadcast_MASK 0x2000000
#define RSV_Broadcast 0x2000000
#define RSV_Broadcast_BIT 25
#define RSV_Dribble_Nibble_MASK 0x4000000
#define RSV_Dribble_Nibble 0x4000000
#define RSV_Dribble_Nibble_BIT 26
#define RSV_Control_frame_MASK 0x8000000
#define RSV_Control_frame 0x8000000
#define RSV_Control_frame_BIT 27
#define RSV_PAUSE_MASK 0x10000000
#define RSV_PAUSE 0x10000000
#define RSV_PAUSE_BIT 28
#define RSV_Unsupported_Opcode_MASK 0x20000000
#define RSV_Unsupported_Opcode 0x20000000
#define RSV_Unsupported_Opcode_BIT 29
#define RSV_VLAN_MASK 0x40000000
#define RSV_VLAN 0x40000000
#define RSV_VLAN_BIT 30

#define FlowControlCounter (*(volatile unsigned *)0xFFE00170)
#define FlowControlCounter_OFFSET 0x170
#define FlowControlCounter_MirrorCounter_MASK 0xFFFF
#define FlowControlCounter_MirrorCounter_BIT 0
#define FlowControlCounter_Pause_Timer_MASK 0xFFFF0000
#define FlowControlCounter_Pause_Timer_BIT 16

#define FlowControlStatus (*(volatile unsigned *)0xFFE00174)
#define FlowControlStatus_OFFSET 0x174

#define RxFilterCtrl (*(volatile unsigned *)0xFFE00200)
#define RxFilterCtrl_OFFSET 0x200
#define RxFilterCtrl_AcceptUnicastEn_MASK 0x1
#define RxFilterCtrl_AcceptUnicastEn 0x1
#define RxFilterCtrl_AcceptUnicastEn_BIT 0
#define RxFilterCtrl_AcceptBroadcastEn_MASK 0x2
#define RxFilterCtrl_AcceptBroadcastEn 0x2
#define RxFilterCtrl_AcceptBroadcastEn_BIT 1
#define RxFilterCtrl_AcceptMulticastEn_MASK 0x4
#define RxFilterCtrl_AcceptMulticastEn 0x4
#define RxFilterCtrl_AcceptMulticastEn_BIT 2
#define RxFilterCtrl_AcceptUnicastHashEn_MASK 0x8
#define RxFilterCtrl_AcceptUnicastHashEn 0x8
#define RxFilterCtrl_AcceptUnicastHashEn_BIT 3
#define RxFilterCtrl_AcceptMulticastHashEn_MASK 0x10
#define RxFilterCtrl_AcceptMulticastHashEn 0x10
#define RxFilterCtrl_AcceptMulticastHashEn_BIT 4
#define RxFilterCtrl_AcceptPerfectEn_MASK 0x20
#define RxFilterCtrl_AcceptPerfectEn 0x20
#define RxFilterCtrl_AcceptPerfectEn_BIT 5
#define RxFilterCtrl_MagicPacketEnWoL_MASK 0x1000
#define RxFilterCtrl_MagicPacketEnWoL 0x1000
#define RxFilterCtrl_MagicPacketEnWoL_BIT 12
#define RxFilterCtrl_RxFilterEnWoL_MASK 0x2000
#define RxFilterCtrl_RxFilterEnWoL 0x2000
#define RxFilterCtrl_RxFilterEnWoL_BIT 13

#define RxFilterWoLStatus (*(volatile unsigned *)0xFFE00204)
#define RxFilterWoLStatus_OFFSET 0x204
#define RxFilterWoLStatus_AcceptUnicastWoL_MASK 0x1
#define RxFilterWoLStatus_AcceptUnicastWoL 0x1
#define RxFilterWoLStatus_AcceptUnicastWoL_BIT 0
#define RxFilterWoLStatus_AcceptBroadcastWoL_MASK 0x2
#define RxFilterWoLStatus_AcceptBroadcastWoL 0x2
#define RxFilterWoLStatus_AcceptBroadcastWoL_BIT 1
#define RxFilterWoLStatus_AcceptMulticastWoL_MASK 0x4
#define RxFilterWoLStatus_AcceptMulticastWoL 0x4
#define RxFilterWoLStatus_AcceptMulticastWoL_BIT 2
#define RxFilterWoLStatus_AcceptUnicastHashWoL_MASK 0x8
#define RxFilterWoLStatus_AcceptUnicastHashWoL 0x8
#define RxFilterWoLStatus_AcceptUnicastHashWoL_BIT 3
#define RxFilterWoLStatus_AcceptMulticastHashWoL_MASK 0x10
#define RxFilterWoLStatus_AcceptMulticastHashWoL 0x10
#define RxFilterWoLStatus_AcceptMulticastHashWoL_BIT 4
#define RxFilterWoLStatus_AcceptPerfectWoL_MASK 0x20
#define RxFilterWoLStatus_AcceptPerfectWoL 0x20
#define RxFilterWoLStatus_AcceptPerfectWoL_BIT 5
#define RxFilterWoLStatus_RxFilterWoL_MASK 0x80
#define RxFilterWoLStatus_RxFilterWoL 0x80
#define RxFilterWoLStatus_RxFilterWoL_BIT 7
#define RxFilterWoLStatus_MagicPacketWoL_MASK 0x100
#define RxFilterWoLStatus_MagicPacketWoL 0x100
#define RxFilterWoLStatus_MagicPacketWoL_BIT 8

#define RxFilterWoLClear (*(volatile unsigned *)0xFFE00208)
#define RxFilterWoLClear_OFFSET 0x208
#define RxFilterWoLClear_AcceptUnicastWoLClr_MASK 0x1
#define RxFilterWoLClear_AcceptUnicastWoLClr 0x1
#define RxFilterWoLClear_AcceptUnicastWoLClr_BIT 0
#define RxFilterWoLClear_AcceptBroadcastWoLClr_MASK 0x2
#define RxFilterWoLClear_AcceptBroadcastWoLClr 0x2
#define RxFilterWoLClear_AcceptBroadcastWoLClr_BIT 1
#define RxFilterWoLClear_AcceptMulticastWoLClr_MASK 0x4
#define RxFilterWoLClear_AcceptMulticastWoLClr 0x4
#define RxFilterWoLClear_AcceptMulticastWoLClr_BIT 2
#define RxFilterWoLClear_AcceptUnicastHashWoLClr_MASK 0x8
#define RxFilterWoLClear_AcceptUnicastHashWoLClr 0x8
#define RxFilterWoLClear_AcceptUnicastHashWoLClr_BIT 3
#define RxFilterWoLClear_AcceptMulticastHashWoLClr_MASK 0x10
#define RxFilterWoLClear_AcceptMulticastHashWoLClr 0x10
#define RxFilterWoLClear_AcceptMulticastHashWoLClr_BIT 4
#define RxFilterWoLClear_AcceptPerfectWoLClr_MASK 0x20
#define RxFilterWoLClear_AcceptPerfectWoLClr 0x20
#define RxFilterWoLClear_AcceptPerfectWoLClr_BIT 5
#define RxFilterWoLClear_RxFilterWoLClr_MASK 0x80
#define RxFilterWoLClear_RxFilterWoLClr 0x80
#define RxFilterWoLClear_RxFilterWoLClr_BIT 7
#define RxFilterWoLClear_MagicPacketWoLClr_MASK 0x100
#define RxFilterWoLClear_MagicPacketWoLClr 0x100
#define RxFilterWoLClear_MagicPacketWoLClr_BIT 8

#define HashFilterL (*(volatile unsigned *)0xFFE00210)
#define HashFilterL_OFFSET 0x210

#define HashFilterH (*(volatile unsigned *)0xFFE00214)
#define HashFilterH_OFFSET 0x214

