FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define DMACRawIntTCStatus (*(volatile unsigned *)0xFFE04014)
#define DMACRawIntTCStatus_OFFSET 0x14
#define DMACRawIntTCStatus_RawIntTCStatus0_MASK 0x1
#define DMACRawIntTCStatus_RawIntTCStatus0 0x1
#define DMACRawIntTCStatus_RawIntTCStatus0_BIT 0
#define DMACRawIntTCStatus_RawIntTCStatus1_MASK 0x2
#define DMACRawIntTCStatus_RawIntTCStatus1 0x2
#define DMACRawIntTCStatus_RawIntTCStatus1_BIT 1

#define DMACRawIntErrorStatus (*(volatile unsigned *)0xFFE04018)
#define DMACRawIntErrorStatus_OFFSET 0x18
#define DMACRawIntErrorStatus_RawIntErrorStatus0_MASK 0x1
#define DMACRawIntErrorStatus_RawIntErrorStatus0 0x1
#define DMACRawIntErrorStatus_RawIntErrorStatus0_BIT 0
#define DMACRawIntErrorStatus_RawIntErrorStatus1_MASK 0x2
#define DMACRawIntErrorStatus_RawIntErrorStatus1 0x2
#define DMACRawIntErrorStatus_RawIntErrorStatus1_BIT 1

#define DMACEnbldChns (*(volatile unsigned *)0xFFE0401C)
#define DMACEnbldChns_OFFSET 0x1C
#define DMACEnbldChns_EnabledChannels0_MASK 0x1
#define DMACEnbldChns_EnabledChannels0 0x1
#define DMACEnbldChns_EnabledChannels0_BIT 0
#define DMACEnbldChns_EnabledChannels1_MASK 0x2
#define DMACEnbldChns_EnabledChannels1 0x2
#define DMACEnbldChns_EnabledChannels1_BIT 1

#define DMACSoftBReq (*(volatile unsigned *)0xFFE04020)
#define DMACSoftBReq_OFFSET 0x20
#define DMACSoftBReq_SoftBReqSSP0Tx_MASK 0x1
#define DMACSoftBReq_SoftBReqSSP0Tx 0x1
#define DMACSoftBReq_SoftBReqSSP0Tx_BIT 0
#define DMACSoftBReq_SoftBReqSSP0Rx_MASK 0x2
#define DMACSoftBReq_SoftBReqSSP0Rx 0x2
#define DMACSoftBReq_SoftBReqSSP0Rx_BIT 1
#define DMACSoftBReq_SoftBReqSSP1Tx_MASK 0x4
#define DMACSoftBReq_SoftBReqSSP1Tx 0x4
#define DMACSoftBReq_SoftBReqSSP1Tx_BIT 2
#define DMACSoftBReq_SoftBReqSSP1Rx_MASK 0x8
#define DMACSoftBReq_SoftBReqSSP1Rx 0x8
#define DMACSoftBReq_SoftBReqSSP1Rx_BIT 3
#define DMACSoftBReq_SoftBReqSDMMC_MASK 0x10
#define DMACSoftBReq_SoftBReqSDMMC 0x10
#define DMACSoftBReq_SoftBReqSDMMC_BIT 4

#define DMACSoftSReq (*(volatile unsigned *)0xFFE04024)
#define DMACSoftSReq_OFFSET 0x24
#define DMACSoftSReq_SoftReqSSP0Tx_MASK 0x1
#define DMACSoftSReq_SoftReqSSP0Tx 0x1
#define DMACSoftSReq_SoftReqSSP0Tx_BIT 0
#define DMACSoftSReq_SoftReqSSP0Rx_MASK 0x2
#define DMACSoftSReq_SoftReqSSP0Rx 0x2
#define DMACSoftSReq_SoftReqSSP0Rx_BIT 1
#define DMACSoftSReq_SoftReqSSP1Tx_MASK 0x4
#define DMACSoftSReq_SoftReqSSP1Tx 0x4
#define DMACSoftSReq_SoftReqSSP1Tx_BIT 2
#define DMACSoftSReq_SoftReqSSP1Rx_MASK 0x8
#define DMACSoftSReq_SoftReqSSP1Rx 0x8
#define DMACSoftSReq_SoftReqSSP1Rx_BIT 3
#define DMACSoftSReq_SoftReqSDMMC_MASK 0x10
#define DMACSoftSReq_SoftReqSDMMC 0x10
#define DMACSoftSReq_SoftReqSDMMC_BIT 4
#define DMACSoftSReq_SoftReqI2S0_MASK 0x20
#define DMACSoftSReq_SoftReqI2S0 0x20
#define DMACSoftSReq_SoftReqI2S0_BIT 5
#define DMACSoftSReq_SoftReqI2S1_MASK 0x40
#define DMACSoftSReq_SoftReqI2S1 0x40
#define DMACSoftSReq_SoftReqI2S1_BIT 6

#define DMACSoftLBReq (*(volatile unsigned *)0xFFE04028)
#define DMACSoftLBReq_OFFSET 0x28
#define DMACSoftLBReq_SoftLBReqSDMMC_MASK 0x10
#define DMACSoftLBReq_SoftLBReqSDMMC 0x10
#define DMACSoftLBReq_SoftLBReqSDMMC_BIT 4

#define DMACSoftSLReq (*(volatile unsigned *)0xFFE0402C)
#define DMACSoftSLReq_OFFSET 0x2C
#define DMACSoftSLReq_SoftLSReqSDMMC_MASK 0x10
#define DMACSoftSLReq_SoftLSReqSDMMC 0x10
#define DMACSoftSLReq_SoftLSReqSDMMC_BIT 4

#define DMACConfiguration (*(volatile unsigned *)0xFFE04030)
#define DMACConfiguration_OFFSET 0x30
#define DMACConfiguration_E_MASK 0x1
#define DMACConfiguration_E 0x1
#define DMACConfiguration_E_BIT 0
#define DMACConfiguration_M_MASK 0x1
#define DMACConfiguration_M 0x1
#define DMACConfiguration_M_BIT 0

#define DMACSync (*(volatile unsigned *)0xFFE04034)
#define DMACSync_OFFSET 0x34
#define DMACSync_DMACSync_MASK 0xFFFF
#define DMACSync_DMACSync_BIT 0

#define DMACC0SrcAddr (*(volatile unsigned *)0xFFE04100)
#define DMACC0SrcAddr_OFFSET 0x100

#define DMACC0DestAddr (*(volatile unsigned *)0xFFE04104)
#define DMACC0DestAddr_OFFSET 0x104

#define DMACC0LLI (*(volatile unsigned *)0xFFE04108)
#define DMACC0LLI_OFFSET 0x108

#define DMACC0Control (*(volatile unsigned *)0xFFE0410C)
#define DMACC0Control_OFFSET 0x10C
#define DMACC0Control_TransferSize_MASK 0xFFF
#define DMACC0Control_TransferSize_BIT 0
#define DMACC0Control_SBSize_MASK 0x7000
#define DMACC0Control_SBSize_BIT 12
#define DMACC0Control_DBSize_MASK 0x38000
#define DMACC0Control_DBSize_BIT 15
#define DMACC0Control_SWidth_MASK 0x1C0000
#define DMACC0Control_SWidth_BIT 18
#define DMACC0Control_DWidth_MASK 0xE00000
#define DMACC0Control_DWidth_BIT 21
#define DMACC0Control_SI_MASK 0x4000000
#define DMACC0Control_SI 0x4000000
#define DMACC0Control_SI_BIT 26
#define DMACC0Control_DI_MASK 0x8000000
#define DMACC0Control_DI 0x8000000
#define DMACC0Control_DI_BIT 27
#define DMACC0Control_Prot_MASK 0x70000000
#define DMACC0Control_Prot_BIT 28
#define DMACC0Control_I_MASK 0x80000000
#define DMACC0Control_I 0x80000000
#define DMACC0Control_I_BIT 31

#define DMACC0Configuration (*(volatile unsigned *)0xFFE04110)
#define DMACC0Configuration_OFFSET 0x110
#define DMACC0Configuration_E_MASK 0x1
#define DMACC0Configuration_E 0x1
#define DMACC0Configuration_E_BIT 0
#define DMACC0Configuration_SrcPeripheral_MASK 0x1E
#define DMACC0Configuration_SrcPeripheral_BIT 1
#define DMACC0Configuration_DestPeripheral_MASK 0x3C0
#define DMACC0Configuration_DestPeripheral_BIT 6
#define DMACC0Configuration_FlowCntrl_MASK 0x3800
#define DMACC0Configuration_FlowCntrl_BIT 11
#define DMACC0Configuration_IE_MASK 0x4000
#define DMACC0Configuration_IE 0x4000
#define DMACC0Configuration_IE_BIT 14
#define DMACC0Configuration_ITC_MASK 0x8000
#define DMACC0Configuration_ITC 0x8000
#define DMACC0Configuration_ITC_BIT 15
#define DMACC0Configuration_L_MASK 0x10000
#define DMACC0Configuration_L 0x10000
#define DMACC0Configuration_L_BIT 16
#define DMACC0Configuration_A_MASK 0x20000
#define DMACC0Configuration_A 0x20000
#define DMACC0Configuration_A_BIT 17
#define DMACC0Configuration_H_MASK 0x40000
#define DMACC0Configuration_H 0x40000
#define DMACC0Configuration_H_BIT 18

#define DMACC1SrcAddr (*(volatile unsigned *)0xFFE04120)
#define DMACC1SrcAddr_OFFSET 0x120

#define DMACC1DestAddr (*(volatile unsigned *)0xFFE04124)
#define DMACC1DestAddr_OFFSET 0x124

