FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define DMACC1LLI (*(volatile unsigned *)0xFFE04128)
#define DMACC1LLI_OFFSET 0x128

#define DMACC1Control (*(volatile unsigned *)0xFFE0412C)
#define DMACC1Control_OFFSET 0x12C
#define DMACC1Control_TransferSize_MASK 0xFFF
#define DMACC1Control_TransferSize_BIT 0
#define DMACC1Control_SBSize_MASK 0x7000
#define DMACC1Control_SBSize_BIT 12
#define DMACC1Control_DBSize_MASK 0x38000
#define DMACC1Control_DBSize_BIT 15
#define DMACC1Control_SWidth_MASK 0x1C0000
#define DMACC1Control_SWidth_BIT 18
#define DMACC1Control_DWidth_MASK 0xE00000
#define DMACC1Control_DWidth_BIT 21
#define DMACC1Control_SI_MASK 0x4000000
#define DMACC1Control_SI 0x4000000
#define DMACC1Control_SI_BIT 26
#define DMACC1Control_DI_MASK 0x8000000
#define DMACC1Control_DI 0x8000000
#define DMACC1Control_DI_BIT 27
#define DMACC1Control_Prot_MASK 0x70000000
#define DMACC1Control_Prot_BIT 28
#define DMACC1Control_I_MASK 0x80000000
#define DMACC1Control_I 0x80000000
#define DMACC1Control_I_BIT 31

#define DMACC1Configuration (*(volatile unsigned *)0xFFE04130)
#define DMACC1Configuration_OFFSET 0x130
#define DMACC1Configuration_E_MASK 0x1
#define DMACC1Configuration_E 0x1
#define DMACC1Configuration_E_BIT 0
#define DMACC1Configuration_SrcPeripheral_MASK 0x1E
#define DMACC1Configuration_SrcPeripheral_BIT 1
#define DMACC1Configuration_DestPeripheral_MASK 0x3C0
#define DMACC1Configuration_DestPeripheral_BIT 6
#define DMACC1Configuration_FlowCntrl_MASK 0x3800
#define DMACC1Configuration_FlowCntrl_BIT 11
#define DMACC1Configuration_IE_MASK 0x4000
#define DMACC1Configuration_IE 0x4000
#define DMACC1Configuration_IE_BIT 14
#define DMACC1Configuration_ITC_MASK 0x8000
#define DMACC1Configuration_ITC 0x8000
#define DMACC1Configuration_ITC_BIT 15
#define DMACC1Configuration_L_MASK 0x10000
#define DMACC1Configuration_L 0x10000
#define DMACC1Configuration_L_BIT 16
#define DMACC1Configuration_A_MASK 0x20000
#define DMACC1Configuration_A 0x20000
#define DMACC1Configuration_A_BIT 17
#define DMACC1Configuration_H_MASK 0x40000
#define DMACC1Configuration_H 0x40000
#define DMACC1Configuration_H_BIT 18

#define EMC_BASE 0xFFE08000

#define EMCControl (*(volatile unsigned long *)0xFFE08000)
#define EMCControl_OFFSET 0x0
#define EMCControl_E_MASK 0x1
#define EMCControl_E 0x1
#define EMCControl_E_BIT 0
#define EMCControl_M_MASK 0x2
#define EMCControl_M 0x2
#define EMCControl_M_BIT 1
#define EMCControl_L_MASK 0x4
#define EMCControl_L 0x4
#define EMCControl_L_BIT 2

#define EMCStatus (*(volatile unsigned long *)0xFFE08004)
#define EMCStatus_OFFSET 0x4
#define EMCStatus_B_MASK 0x1
#define EMCStatus_B 0x1
#define EMCStatus_B_BIT 0
#define EMCStatus_S_MASK 0x2
#define EMCStatus_S 0x2
#define EMCStatus_S_BIT 1
#define EMCStatus_SA_MASK 0x4
#define EMCStatus_SA 0x4
#define EMCStatus_SA_BIT 2

#define EMCConfig (*(volatile unsigned long *)0xFFE08008)
#define EMCConfig_OFFSET 0x8
#define EMCConfig_Endian_mode_MASK 0x1
#define EMCConfig_Endian_mode 0x1
#define EMCConfig_Endian_mode_BIT 0

#define EMCStaticExtendedWait (*(volatile unsigned long *)0xFFE08080)
#define EMCStaticExtendedWait_OFFSET 0x80
#define EMCStaticExtendedWait_EXTENDEDWAIT_MASK 0x3FF
#define EMCStaticExtendedWait_EXTENDEDWAIT_BIT 0

#define EMCDynamicControl (*(volatile unsigned long *)0xFFE08020)
#define EMCDynamicControl_OFFSET 0x20
#define EMCDynamicControl_CE_MASK 0x1
#define EMCDynamicControl_CE 0x1
#define EMCDynamicControl_CE_BIT 0
#define EMCDynamicControl_CS_MASK 0x2
#define EMCDynamicControl_CS 0x2
#define EMCDynamicControl_CS_BIT 1
#define EMCDynamicControl_SR_MASK 0x4
#define EMCDynamicControl_SR 0x4
#define EMCDynamicControl_SR_BIT 2
#define EMCDynamicControl_MMC_MASK 0x20
#define EMCDynamicControl_MMC 0x20
#define EMCDynamicControl_MMC_BIT 5
#define EMCDynamicControl_I_MASK 0x180
#define EMCDynamicControl_I_BIT 7
#define EMCDynamicControl_DP_MASK 0x2000
#define EMCDynamicControl_DP 0x2000
#define EMCDynamicControl_DP_BIT 13

#define EMCDynamicRefresh (*(volatile unsigned long *)0xFFE08024)
#define EMCDynamicRefresh_OFFSET 0x24
#define EMCDynamicRefresh_REFRESH_MASK 0x7FF
#define EMCDynamicRefresh_REFRESH_BIT 0

#define EMCDynamicReadConfig (*(volatile unsigned long *)0xFFE08028)
#define EMCDynamicReadConfig_OFFSET 0x28
#define EMCDynamicReadConfig_RD_MASK 0x3
#define EMCDynamicReadConfig_RD_BIT 0

#define EMCDynamictRP (*(volatile unsigned long *)0xFFE08030)
#define EMCDynamictRP_OFFSET 0x30
#define EMCDynamictRP_tRP_MASK 0xF
#define EMCDynamictRP_tRP_BIT 0

#define EMCDynamictRAS (*(volatile unsigned long *)0xFFE08034)
#define EMCDynamictRAS_OFFSET 0x34
#define EMCDynamictRAS_tRAS_MASK 0xF
#define EMCDynamictRAS_tRAS_BIT 0

#define EMCDynamictSREX (*(volatile unsigned long *)0xFFE08038)
#define EMCDynamictSREX_OFFSET 0x38
#define EMCDynamictSREX_tSREX_MASK 0xF
#define EMCDynamictSREX_tSREX_BIT 0

#define EMCDynamictAPR (*(volatile unsigned long *)0xFFE0803C)
#define EMCDynamictAPR_OFFSET 0x3C
#define EMCDynamictAPR_tAPR_MASK 0xF
#define EMCDynamictAPR_tAPR_BIT 0

#define EMCDynamictDAL (*(volatile unsigned long *)0xFFE08040)
#define EMCDynamictDAL_OFFSET 0x40
#define EMCDynamictDAL_tDAL_MASK 0xF
#define EMCDynamictDAL_tDAL_BIT 0

#define EMCDynamictWR (*(volatile unsigned long *)0xFFE08044)
#define EMCDynamictWR_OFFSET 0x44
#define EMCDynamictWR_tWR_MASK 0xF
#define EMCDynamictWR_tWR_BIT 0

#define EMCDynamictRC (*(volatile unsigned long *)0xFFE08048)
#define EMCDynamictRC_OFFSET 0x48
#define EMCDynamictRC_tRC_MASK 0xF
#define EMCDynamictRC_tRC_BIT 0

#define EMCDynamictRFC (*(volatile unsigned long *)0xFFE0804C)
#define EMCDynamictRFC_OFFSET 0x4C
#define EMCDynamictRFC_tRFC_MASK 0xF
#define EMCDynamictRFC_tRFC_BIT 0

#define EMCDynamictXSR (*(volatile unsigned long *)0xFFE08050)
#define EMCDynamictXSR_OFFSET 0x50
#define EMCDynamictXSR_tXSR_MASK 0xF
#define EMCDynamictXSR_tXSR_BIT 0

#define EMCDynamictRRD (*(volatile unsigned long *)0xFFE08054)
#define EMCDynamictRRD_OFFSET 0x54
#define EMCDynamictRRD_tRRD_MASK 0xF
#define EMCDynamictRRD_tRRD_BIT 0

#define EMCDynamictMRD (*(volatile unsigned long *)0xFFE08058)
#define EMCDynamictMRD_OFFSET 0x58
#define EMCDynamictMRD_tMRD_MASK 0xF
#define EMCDynamictMRD_tMRD_BIT 0

