FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define EMCDynamicConfig0 (*(volatile unsigned *)0xFFE08100)
#define EMCDynamicConfig0_OFFSET 0x100
#define EMCDynamicConfig0_MD_MASK 0x18
#define EMCDynamicConfig0_MD_BIT 3
#define EMCDynamicConfig0_AM_bits7_12_MASK 0x1F80
#define EMCDynamicConfig0_AM_bits7_12_BIT 7
#define EMCDynamicConfig0_AM_bit14_MASK 0x4000
#define EMCDynamicConfig0_AM_bit14 0x4000
#define EMCDynamicConfig0_AM_bit14_BIT 14
#define EMCDynamicConfig0_B_MASK 0x80000
#define EMCDynamicConfig0_B 0x80000
#define EMCDynamicConfig0_B_BIT 19
#define EMCDynamicConfig0_P_MASK 0x100000
#define EMCDynamicConfig0_P 0x100000
#define EMCDynamicConfig0_P_BIT 20

#define EMCDynamicRasCas0 (*(volatile unsigned *)0xFFE08104)
#define EMCDynamicRasCas0_OFFSET 0x104
#define EMCDynamicRasCas0_RAS_MASK 0x3
#define EMCDynamicRasCas0_RAS_BIT 0
#define EMCDynamicRasCas0_CAS_MASK 0x300
#define EMCDynamicRasCas0_CAS_BIT 8

#define EMCDynamicConfig1 (*(volatile unsigned *)0xFFE08120)
#define EMCDynamicConfig1_OFFSET 0x120
#define EMCDynamicConfig1_MD_MASK 0x18
#define EMCDynamicConfig1_MD_BIT 3
#define EMCDynamicConfig1_AM_bits7_12_MASK 0x1F80
#define EMCDynamicConfig1_AM_bits7_12_BIT 7
#define EMCDynamicConfig1_AM_bit14_MASK 0x4000
#define EMCDynamicConfig1_AM_bit14 0x4000
#define EMCDynamicConfig1_AM_bit14_BIT 14
#define EMCDynamicConfig1_B_MASK 0x80000
#define EMCDynamicConfig1_B 0x80000
#define EMCDynamicConfig1_B_BIT 19
#define EMCDynamicConfig1_P_MASK 0x100000
#define EMCDynamicConfig1_P 0x100000
#define EMCDynamicConfig1_P_BIT 20

#define EMCDynamicRasCas1 (*(volatile unsigned *)0xFFE08124)
#define EMCDynamicRasCas1_OFFSET 0x124
#define EMCDynamicRasCas1_RAS_MASK 0x3
#define EMCDynamicRasCas1_RAS_BIT 0
#define EMCDynamicRasCas1_CAS_MASK 0x300
#define EMCDynamicRasCas1_CAS_BIT 8

#define EMCDynamicConfig2 (*(volatile unsigned *)0xFFE08140)
#define EMCDynamicConfig2_OFFSET 0x140
#define EMCDynamicConfig2_MD_MASK 0x18
#define EMCDynamicConfig2_MD_BIT 3
#define EMCDynamicConfig2_AM_bits7_12_MASK 0x1F80
#define EMCDynamicConfig2_AM_bits7_12_BIT 7
#define EMCDynamicConfig2_AM_bit14_MASK 0x4000
#define EMCDynamicConfig2_AM_bit14 0x4000
#define EMCDynamicConfig2_AM_bit14_BIT 14
#define EMCDynamicConfig2_B_MASK 0x80000
#define EMCDynamicConfig2_B 0x80000
#define EMCDynamicConfig2_B_BIT 19
#define EMCDynamicConfig2_P_MASK 0x100000
#define EMCDynamicConfig2_P 0x100000
#define EMCDynamicConfig2_P_BIT 20

#define EMCDynamicRasCas2 (*(volatile unsigned *)0xFFE08144)
#define EMCDynamicRasCas2_OFFSET 0x144
#define EMCDynamicRasCas2_RAS_MASK 0x3
#define EMCDynamicRasCas2_RAS_BIT 0
#define EMCDynamicRasCas2_CAS_MASK 0x300
#define EMCDynamicRasCas2_CAS_BIT 8

#define EMCDynamicConfig3 (*(volatile unsigned *)0xFFE08160)
#define EMCDynamicConfig3_OFFSET 0x160
#define EMCDynamicConfig3_MD_MASK 0x18
#define EMCDynamicConfig3_MD_BIT 3
#define EMCDynamicConfig3_AM_bits7_12_MASK 0x1F80
#define EMCDynamicConfig3_AM_bits7_12_BIT 7
#define EMCDynamicConfig3_AM_bit14_MASK 0x4000
#define EMCDynamicConfig3_AM_bit14 0x4000
#define EMCDynamicConfig3_AM_bit14_BIT 14
#define EMCDynamicConfig3_B_MASK 0x80000
#define EMCDynamicConfig3_B 0x80000
#define EMCDynamicConfig3_B_BIT 19
#define EMCDynamicConfig3_P_MASK 0x100000
#define EMCDynamicConfig3_P 0x100000
#define EMCDynamicConfig3_P_BIT 20

#define EMCDynamicRasCas3 (*(volatile unsigned *)0xFFE08164)
#define EMCDynamicRasCas3_OFFSET 0x164
#define EMCDynamicRasCas3_RAS_MASK 0x3
#define EMCDynamicRasCas3_RAS_BIT 0
#define EMCDynamicRasCas3_CAS_MASK 0x300
#define EMCDynamicRasCas3_CAS_BIT 8

#define EMCStaticConfig0 (*(volatile unsigned *)0xFFE08200)
#define EMCStaticConfig0_OFFSET 0x200
#define EMCStaticConfig0_MW_MASK 0x3
#define EMCStaticConfig0_MW_BIT 0
#define EMCStaticConfig0_PM_MASK 0x8
#define EMCStaticConfig0_PM 0x8
#define EMCStaticConfig0_PM_BIT 3
#define EMCStaticConfig0_PC_MASK 0x40
#define EMCStaticConfig0_PC 0x40
#define EMCStaticConfig0_PC_BIT 6
#define EMCStaticConfig0_PB_MASK 0x80
#define EMCStaticConfig0_PB 0x80
#define EMCStaticConfig0_PB_BIT 7
#define EMCStaticConfig0_EW_MASK 0x100
#define EMCStaticConfig0_EW 0x100
#define EMCStaticConfig0_EW_BIT 8
#define EMCStaticConfig0_B_MASK 0x80000
#define EMCStaticConfig0_B 0x80000
#define EMCStaticConfig0_B_BIT 19
#define EMCStaticConfig0_P_MASK 0x100000
#define EMCStaticConfig0_P 0x100000
#define EMCStaticConfig0_P_BIT 20

#define EMCStaticWaitWen0 (*(volatile unsigned *)0xFFE08204)
#define EMCStaticWaitWen0_OFFSET 0x204
#define EMCStaticWaitWen0_WAITWEN_MASK 0xF
#define EMCStaticWaitWen0_WAITWEN_BIT 0

#define EMCStaticWaitOen0 (*(volatile unsigned *)0xFFE08208)
#define EMCStaticWaitOen0_OFFSET 0x208
#define EMCStaticWaitOen0_WAITOEN_MASK 0xF
#define EMCStaticWaitOen0_WAITOEN_BIT 0

#define EMCStaticWaitRd0 (*(volatile unsigned *)0xFFE0820C)
#define EMCStaticWaitRd0_OFFSET 0x20C
#define EMCStaticWaitRd0_WAITRD_MASK 0x1F
#define EMCStaticWaitRd0_WAITRD_BIT 0

#define EMCStaticWaitPage0 (*(volatile unsigned *)0xFFE08210)
#define EMCStaticWaitPage0_OFFSET 0x210
#define EMCStaticWaitPage0_WAITPAGE_MASK 0x1F
#define EMCStaticWaitPage0_WAITPAGE_BIT 0

#define EMCStaticWaitWr0 (*(volatile unsigned *)0xFFE08214)
#define EMCStaticWaitWr0_OFFSET 0x214
#define EMCStaticWaitWr0_WAITWR_MASK 0x1F
#define EMCStaticWaitWr0_WAITWR_BIT 0

#define EMCStaticWaitTurn0 (*(volatile unsigned *)0xFFE08218)
#define EMCStaticWaitTurn0_OFFSET 0x218
#define EMCStaticWaitTurn0_WAITTURN_MASK 0xF
#define EMCStaticWaitTurn0_WAITTURN_BIT 0

#define EMCStaticConfig1 (*(volatile unsigned *)0xFFE08220)
#define EMCStaticConfig1_OFFSET 0x220
#define EMCStaticConfig1_MW_MASK 0x3
#define EMCStaticConfig1_MW_BIT 0
#define EMCStaticConfig1_PM_MASK 0x8
#define EMCStaticConfig1_PM 0x8
#define EMCStaticConfig1_PM_BIT 3
#define EMCStaticConfig1_PC_MASK 0x40
#define EMCStaticConfig1_PC 0x40
#define EMCStaticConfig1_PC_BIT 6
#define EMCStaticConfig1_PB_MASK 0x80
#define EMCStaticConfig1_PB 0x80
#define EMCStaticConfig1_PB_BIT 7
#define EMCStaticConfig1_EW_MASK 0x100
#define EMCStaticConfig1_EW 0x100
#define EMCStaticConfig1_EW_BIT 8
#define EMCStaticConfig1_B_MASK 0x80000
#define EMCStaticConfig1_B 0x80000
#define EMCStaticConfig1_B_BIT 19
#define EMCStaticConfig1_P_MASK 0x100000
#define EMCStaticConfig1_P 0x100000
#define EMCStaticConfig1_P_BIT 20

#define EMCStaticWaitWen1 (*(volatile unsigned *)0xFFE08224)
#define EMCStaticWaitWen1_OFFSET 0x224
#define EMCStaticWaitWen1_WAITWEN_MASK 0xF
#define EMCStaticWaitWen1_WAITWEN_BIT 0

