FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define EMCStaticWaitOen1 (*(volatile unsigned *)0xFFE08228)
#define EMCStaticWaitOen1_OFFSET 0x228
#define EMCStaticWaitOen1_WAITOEN_MASK 0xF
#define EMCStaticWaitOen1_WAITOEN_BIT 0

#define EMCStaticWaitRd1 (*(volatile unsigned *)0xFFE0822C)
#define EMCStaticWaitRd1_OFFSET 0x22C
#define EMCStaticWaitRd1_WAITRD_MASK 0x1F
#define EMCStaticWaitRd1_WAITRD_BIT 0

#define EMCStaticWaitPage1 (*(volatile unsigned *)0xFFE08230)
#define EMCStaticWaitPage1_OFFSET 0x230
#define EMCStaticWaitPage1_WAITPAGE_MASK 0x1F
#define EMCStaticWaitPage1_WAITPAGE_BIT 0

#define EMCStaticWaitWr1 (*(volatile unsigned *)0xFFE08234)
#define EMCStaticWaitWr1_OFFSET 0x234
#define EMCStaticWaitWr1_WAITWR_MASK 0x1F
#define EMCStaticWaitWr1_WAITWR_BIT 0

#define EMCStaticWaitTurn1 (*(volatile unsigned *)0xFFE08238)
#define EMCStaticWaitTurn1_OFFSET 0x238
#define EMCStaticWaitTurn1_WAITTURN_MASK 0xF
#define EMCStaticWaitTurn1_WAITTURN_BIT 0

#define EMCStaticConfig2 (*(volatile unsigned *)0xFFE08240)
#define EMCStaticConfig2_OFFSET 0x240
#define EMCStaticConfig2_MW_MASK 0x3
#define EMCStaticConfig2_MW_BIT 0
#define EMCStaticConfig2_PM_MASK 0x8
#define EMCStaticConfig2_PM 0x8
#define EMCStaticConfig2_PM_BIT 3
#define EMCStaticConfig2_PC_MASK 0x40
#define EMCStaticConfig2_PC 0x40
#define EMCStaticConfig2_PC_BIT 6
#define EMCStaticConfig2_PB_MASK 0x80
#define EMCStaticConfig2_PB 0x80
#define EMCStaticConfig2_PB_BIT 7
#define EMCStaticConfig2_EW_MASK 0x100
#define EMCStaticConfig2_EW 0x100
#define EMCStaticConfig2_EW_BIT 8
#define EMCStaticConfig2_B_MASK 0x80000
#define EMCStaticConfig2_B 0x80000
#define EMCStaticConfig2_B_BIT 19
#define EMCStaticConfig2_P_MASK 0x100000
#define EMCStaticConfig2_P 0x100000
#define EMCStaticConfig2_P_BIT 20

#define EMCStaticWaitWen2 (*(volatile unsigned *)0xFFE08244)
#define EMCStaticWaitWen2_OFFSET 0x244
#define EMCStaticWaitWen2_WAITWEN_MASK 0xF
#define EMCStaticWaitWen2_WAITWEN_BIT 0

#define EMCStaticWaitOen2 (*(volatile unsigned *)0xFFE08248)
#define EMCStaticWaitOen2_OFFSET 0x248
#define EMCStaticWaitOen2_WAITOEN_MASK 0xF
#define EMCStaticWaitOen2_WAITOEN_BIT 0

#define EMCStaticWaitRd2 (*(volatile unsigned *)0xFFE0824C)
#define EMCStaticWaitRd2_OFFSET 0x24C
#define EMCStaticWaitRd2_WAITRD_MASK 0x1F
#define EMCStaticWaitRd2_WAITRD_BIT 0

#define EMCStaticWaitPage2 (*(volatile unsigned *)0xFFE08250)
#define EMCStaticWaitPage2_OFFSET 0x250
#define EMCStaticWaitPage2_WAITPAGE_MASK 0x1F
#define EMCStaticWaitPage2_WAITPAGE_BIT 0

#define EMCStaticWaitWr2 (*(volatile unsigned *)0xFFE08254)
#define EMCStaticWaitWr2_OFFSET 0x254
#define EMCStaticWaitWr2_WAITWR_MASK 0x1F
#define EMCStaticWaitWr2_WAITWR_BIT 0

#define EMCStaticWaitTurn2 (*(volatile unsigned *)0xFFE08258)
#define EMCStaticWaitTurn2_OFFSET 0x258
#define EMCStaticWaitTurn2_WAITTURN_MASK 0xF
#define EMCStaticWaitTurn2_WAITTURN_BIT 0

#define EMCStaticConfig3 (*(volatile unsigned *)0xFFE08260)
#define EMCStaticConfig3_OFFSET 0x260
#define EMCStaticConfig3_MW_MASK 0x3
#define EMCStaticConfig3_MW_BIT 0
#define EMCStaticConfig3_PM_MASK 0x8
#define EMCStaticConfig3_PM 0x8
#define EMCStaticConfig3_PM_BIT 3
#define EMCStaticConfig3_PC_MASK 0x40
#define EMCStaticConfig3_PC 0x40
#define EMCStaticConfig3_PC_BIT 6
#define EMCStaticConfig3_PB_MASK 0x80
#define EMCStaticConfig3_PB 0x80
#define EMCStaticConfig3_PB_BIT 7
#define EMCStaticConfig3_EW_MASK 0x100
#define EMCStaticConfig3_EW 0x100
#define EMCStaticConfig3_EW_BIT 8
#define EMCStaticConfig3_B_MASK 0x80000
#define EMCStaticConfig3_B 0x80000
#define EMCStaticConfig3_B_BIT 19
#define EMCStaticConfig3_P_MASK 0x100000
#define EMCStaticConfig3_P 0x100000
#define EMCStaticConfig3_P_BIT 20

#define EMCStaticWaitWen3 (*(volatile unsigned *)0xFFE08264)
#define EMCStaticWaitWen3_OFFSET 0x264
#define EMCStaticWaitWen3_WAITWEN_MASK 0xF
#define EMCStaticWaitWen3_WAITWEN_BIT 0

#define EMCStaticWaitOen3 (*(volatile unsigned *)0xFFE08268)
#define EMCStaticWaitOen3_OFFSET 0x268
#define EMCStaticWaitOen3_WAITOEN_MASK 0xF
#define EMCStaticWaitOen3_WAITOEN_BIT 0

#define EMCStaticWaitRd3 (*(volatile unsigned *)0xFFE0826C)
#define EMCStaticWaitRd3_OFFSET 0x26C
#define EMCStaticWaitRd3_WAITRD_MASK 0x1F
#define EMCStaticWaitRd3_WAITRD_BIT 0

#define EMCStaticWaitPage3 (*(volatile unsigned *)0xFFE08270)
#define EMCStaticWaitPage3_OFFSET 0x270
#define EMCStaticWaitPage3_WAITPAGE_MASK 0x1F
#define EMCStaticWaitPage3_WAITPAGE_BIT 0

#define EMCStaticWaitWr3 (*(volatile unsigned *)0xFFE08274)
#define EMCStaticWaitWr3_OFFSET 0x274
#define EMCStaticWaitWr3_WAITWR_MASK 0x1F
#define EMCStaticWaitWr3_WAITWR_BIT 0

#define EMCStaticWaitTurn3 (*(volatile unsigned *)0xFFE08278)
#define EMCStaticWaitTurn3_OFFSET 0x278
#define EMCStaticWaitTurn3_WAITTURN_MASK 0xF
#define EMCStaticWaitTurn3_WAITTURN_BIT 0

#define USB_BASE 0xFFE0C000

#define OTGIntSt (*(volatile unsigned *)0xFFE0C100)
#define OTGIntSt_OFFSET 0x100
#define OTGIntSt_TMR_MASK 0x1
#define OTGIntSt_TMR 0x1
#define OTGIntSt_TMR_BIT 0
#define OTGIntSt_REMOVE_PU_MASK 0x2
#define OTGIntSt_REMOVE_PU 0x2
#define OTGIntSt_REMOVE_PU_BIT 1
#define OTGIntSt_HNP_FAILURE_MASK 0x4
#define OTGIntSt_HNP_FAILURE 0x4
#define OTGIntSt_HNP_FAILURE_BIT 2
#define OTGIntSt_HNP_SUCCESS_MASK 0x8
#define OTGIntSt_HNP_SUCCESS 0x8
#define OTGIntSt_HNP_SUCCESS_BIT 3

#define OTGIntEn (*(volatile unsigned *)0xFFE0C104)
#define OTGIntEn_OFFSET 0x104
#define OTGIntEn_TMR_MASK 0x1
#define OTGIntEn_TMR 0x1
#define OTGIntEn_TMR_BIT 0
#define OTGIntEn_REMOVE_PU_MASK 0x2
#define OTGIntEn_REMOVE_PU 0x2
#define OTGIntEn_REMOVE_PU_BIT 1
#define OTGIntEn_HNP_FAILURE_MASK 0x4
#define OTGIntEn_HNP_FAILURE 0x4
#define OTGIntEn_HNP_FAILURE_BIT 2
#define OTGIntEn_HNP_SUCCESS_MASK 0x8
#define OTGIntEn_HNP_SUCCESS 0x8
#define OTGIntEn_HNP_SUCCESS_BIT 3

#define OTGIntSet (*(volatile unsigned *)0xFFE0C108)
#define OTGIntSet_OFFSET 0x108
#define OTGIntSet_TMR_MASK 0x1
#define OTGIntSet_TMR 0x1
#define OTGIntSet_TMR_BIT 0
#define OTGIntSet_REMOVE_PU_MASK 0x2
#define OTGIntSet_REMOVE_PU 0x2
#define OTGIntSet_REMOVE_PU_BIT 1
#define OTGIntSet_HNP_FAILURE_MASK 0x4
#define OTGIntSet_HNP_FAILURE 0x4
#define OTGIntSet_HNP_FAILURE_BIT 2
#define OTGIntSet_HNP_SUCCESS_MASK 0x8
#define OTGIntSet_HNP_SUCCESS 0x8
#define OTGIntSet_HNP_SUCCESS_BIT 3

#define OTGIntClr (*(volatile unsigned *)0xFFE0C10C)
#define OTGIntClr_OFFSET 0x10C
#define OTGIntClr_TMR_MASK 0x1
#define OTGIntClr_TMR 0x1
#define OTGIntClr_TMR_BIT 0
#define OTGIntClr_REMOVE_PU_MASK 0x2
#define OTGIntClr_REMOVE_PU 0x2
#define OTGIntClr_REMOVE_PU_BIT 1
#define OTGIntClr_HNP_FAILURE_MASK 0x4
#define OTGIntClr_HNP_FAILURE 0x4
#define OTGIntClr_HNP_FAILURE_BIT 2
#define OTGIntClr_HNP_SUCCESS_MASK 0x8
#define OTGIntClr_HNP_SUCCESS 0x8
#define OTGIntClr_HNP_SUCCESS_BIT 3

#define OTGStCtrl (*(volatile unsigned *)0xFFE0C110)
#define OTGStCtrl_OFFSET 0x110
#define OTGStCtrl_PORT_FUNC_MASK 0x3
#define OTGStCtrl_PORT_FUNC_BIT 0
#define OTGStCtrl_TMR_SCALE_MASK 0xC
#define OTGStCtrl_TMR_SCALE_BIT 2
#define OTGStCtrl_TMR_MODE_MASK 0x10
#define OTGStCtrl_TMR_MODE 0x10
#define OTGStCtrl_TMR_MODE_BIT 4
#define OTGStCtrl_TMR_EN_MASK 0x20
#define OTGStCtrl_TMR_EN 0x20
#define OTGStCtrl_TMR_EN_BIT 5
#define OTGStCtrl_TMR_RST_MASK 0x40
#define OTGStCtrl_TMR_RST 0x40
#define OTGStCtrl_TMR_RST_BIT 6
#define OTGStCtrl_B_HNP_TRACK_MASK 0x100
#define OTGStCtrl_B_HNP_TRACK 0x100
#define OTGStCtrl_B_HNP_TRACK_BIT 8
#define OTGStCtrl_A_HNP_TRACK_MASK 0x200
#define OTGStCtrl_A_HNP_TRACK 0x200
#define OTGStCtrl_A_HNP_TRACK_BIT 9
#define OTGStCtrl_PU_REMOVED_MASK 0x400
#define OTGStCtrl_PU_REMOVED 0x400
#define OTGStCtrl_PU_REMOVED_BIT 10
#define OTGStCtrl_TMR_CNT_MASK 0xFFFF0000
#define OTGStCtrl_TMR_CNT_BIT 16

