FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define USBClkSt (*(volatile unsigned *)0xFFE0CFF8)
#define USBClkSt_OFFSET 0xFF8
#define USBClkSt_DEV_CLK_EN_MASK 0x2
#define USBClkSt_DEV_CLK_EN 0x2
#define USBClkSt_DEV_CLK_EN_BIT 1
#define USBClkSt_PORTSEL_CLK_EN_MASK 0x8
#define USBClkSt_PORTSEL_CLK_EN 0x8
#define USBClkSt_PORTSEL_CLK_EN_BIT 3
#define USBClkSt_AHB_CLK_EN_MASK 0x10
#define USBClkSt_AHB_CLK_EN 0x10
#define USBClkSt_AHB_CLK_EN_BIT 4

#define OTGClkCtrl (*(volatile unsigned *)0xFFE0CFF4)
#define OTGClkCtrl_OFFSET 0xFF4
#define OTGClkCtrl_HOST_CLK_EN_MASK 0x1
#define OTGClkCtrl_HOST_CLK_EN 0x1
#define OTGClkCtrl_HOST_CLK_EN_BIT 0
#define OTGClkCtrl_DEV_CLK_EN_MASK 0x2
#define OTGClkCtrl_DEV_CLK_EN 0x2
#define OTGClkCtrl_DEV_CLK_EN_BIT 1
#define OTGClkCtrl_I2C_CLK_EN_MASK 0x4
#define OTGClkCtrl_I2C_CLK_EN 0x4
#define OTGClkCtrl_I2C_CLK_EN_BIT 2
#define OTGClkCtrl_OTG_CLK_EN_MASK 0x8
#define OTGClkCtrl_OTG_CLK_EN 0x8
#define OTGClkCtrl_OTG_CLK_EN_BIT 3
#define OTGClkCtrl_AHB_CLK_EN_MASK 0x10
#define OTGClkCtrl_AHB_CLK_EN 0x10
#define OTGClkCtrl_AHB_CLK_EN_BIT 4

#define OTGClkSt (*(volatile unsigned *)0xFFE0CFF8)
#define OTGClkSt_OFFSET 0xFF8
#define OTGClkSt_HOST_CLK_EN_MASK 0x1
#define OTGClkSt_HOST_CLK_EN 0x1
#define OTGClkSt_HOST_CLK_EN_BIT 0
#define OTGClkSt_DEV_CLK_EN_MASK 0x2
#define OTGClkSt_DEV_CLK_EN 0x2
#define OTGClkSt_DEV_CLK_EN_BIT 1
#define OTGClkSt_I2C_CLK_EN_MASK 0x4
#define OTGClkSt_I2C_CLK_EN 0x4
#define OTGClkSt_I2C_CLK_EN_BIT 2
#define OTGClkSt_OTG_CLK_EN_MASK 0x8
#define OTGClkSt_OTG_CLK_EN 0x8
#define OTGClkSt_OTG_CLK_EN_BIT 3
#define OTGClkSt_AHB_CLK_EN_MASK 0x10
#define OTGClkSt_AHB_CLK_EN 0x10
#define OTGClkSt_AHB_CLK_EN_BIT 4

#define LCD_BASE 0xFFE10000

#define LCD_TIMH (*(volatile unsigned *)0xFFE10000)
#define LCD_TIMH_OFFSET 0x0
#define LCD_TIMH_PPL_MASK 0xFC
#define LCD_TIMH_PPL_BIT 2
#define LCD_TIMH_HSW_MASK 0xFF00
#define LCD_TIMH_HSW_BIT 8
#define LCD_TIMH_HFP_MASK 0xFF0000
#define LCD_TIMH_HFP_BIT 16
#define LCD_TIMH_HBP_MASK 0xFF000000
#define LCD_TIMH_HBP_BIT 24

#define LCD_TIMV (*(volatile unsigned *)0xFFE10004)
#define LCD_TIMV_OFFSET 0x4
#define LCD_TIMV_LPP_MASK 0x3FF
#define LCD_TIMV_LPP_BIT 0
#define LCD_TIMV_VSW_MASK 0xFC00
#define LCD_TIMV_VSW_BIT 10
#define LCD_TIMV_VFP_MASK 0xFF0000
#define LCD_TIMV_VFP_BIT 16
#define LCD_TIMV_VBP_MASK 0xFF000000
#define LCD_TIMV_VBP_BIT 24

#define LCD_POL (*(volatile unsigned *)0xFFE10008)
#define LCD_POL_OFFSET 0x8
#define LCD_POL_PCD_LO_MASK 0x1F
#define LCD_POL_PCD_LO_BIT 0
#define LCD_POL_CLKSEL_MASK 0x20
#define LCD_POL_CLKSEL 0x20
#define LCD_POL_CLKSEL_BIT 5
#define LCD_POL_ACB_MASK 0x7C0
#define LCD_POL_ACB_BIT 6
#define LCD_POL_IVS_MASK 0x800
#define LCD_POL_IVS 0x800
#define LCD_POL_IVS_BIT 11
#define LCD_POL_IHS_MASK 0x1000
#define LCD_POL_IHS 0x1000
#define LCD_POL_IHS_BIT 12
#define LCD_POL_IPC_MASK 0x2000
#define LCD_POL_IPC 0x2000
#define LCD_POL_IPC_BIT 13
#define LCD_POL_IOE_MASK 0x4000
#define LCD_POL_IOE 0x4000
#define LCD_POL_IOE_BIT 14
#define LCD_POL_CPL_MASK 0x3FF0000
#define LCD_POL_CPL_BIT 16
#define LCD_POL_BCD_MASK 0x4000000
#define LCD_POL_BCD 0x4000000
#define LCD_POL_BCD_BIT 26
#define LCD_POL_PCD_HI_MASK 0xF8000000
#define LCD_POL_PCD_HI_BIT 27

#define LCD_LE (*(volatile unsigned *)0xFFE1000C)
#define LCD_LE_OFFSET 0xC
#define LCD_LE_LED_MASK 0x7F
#define LCD_LE_LED_BIT 0
#define LCD_LE_LEE_MASK 0x10000
#define LCD_LE_LEE 0x10000
#define LCD_LE_LEE_BIT 16

#define LCD_UPBASE (*(volatile unsigned *)0xFFE10010)
#define LCD_UPBASE_OFFSET 0x10
#define LCD_UPBASE_LCDUPBASE_MASK 0xFFFFFFF8
#define LCD_UPBASE_LCDUPBASE_BIT 3

#define LCD_LPBASE (*(volatile unsigned *)0xFFE10014)
#define LCD_LPBASE_OFFSET 0x14
#define LCD_LPBASE_LCDLPBASE_MASK 0xFFFFFFF8
#define LCD_LPBASE_LCDLPBASE_BIT 3

#define LCD_CTRL (*(volatile unsigned *)0xFFE10018)
#define LCD_CTRL_OFFSET 0x18
#define LCD_CTRL_LcdEn_MASK 0x1
#define LCD_CTRL_LcdEn 0x1
#define LCD_CTRL_LcdEn_BIT 0
#define LCD_CTRL_LcdBpp_MASK 0xE
#define LCD_CTRL_LcdBpp_BIT 1
#define LCD_CTRL_LcdBW_MASK 0x10
#define LCD_CTRL_LcdBW 0x10
#define LCD_CTRL_LcdBW_BIT 4
#define LCD_CTRL_LcdTFT_MASK 0x20
#define LCD_CTRL_LcdTFT 0x20
#define LCD_CTRL_LcdTFT_BIT 5
#define LCD_CTRL_LcdMon8_MASK 0x40
#define LCD_CTRL_LcdMon8 0x40
#define LCD_CTRL_LcdMon8_BIT 6
#define LCD_CTRL_LcdDual_MASK 0x80
#define LCD_CTRL_LcdDual 0x80
#define LCD_CTRL_LcdDual_BIT 7
#define LCD_CTRL_BGR_MASK 0x100
#define LCD_CTRL_BGR 0x100
#define LCD_CTRL_BGR_BIT 8
#define LCD_CTRL_BEBO_MASK 0x200
#define LCD_CTRL_BEBO 0x200
#define LCD_CTRL_BEBO_BIT 9
#define LCD_CTRL_BEPO_MASK 0x400
#define LCD_CTRL_BEPO 0x400
#define LCD_CTRL_BEPO_BIT 10
#define LCD_CTRL_LcdPwr_MASK 0x800
#define LCD_CTRL_LcdPwr 0x800
#define LCD_CTRL_LcdPwr_BIT 11
#define LCD_CTRL_LcdVComp_MASK 0x3000
#define LCD_CTRL_LcdVComp_BIT 12
#define LCD_CTRL_WATERMARK_MASK 0x10000
#define LCD_CTRL_WATERMARK 0x10000
#define LCD_CTRL_WATERMARK_BIT 16

#define LCD_INTMSK (*(volatile unsigned *)0xFFE1001C)
#define LCD_INTMSK_OFFSET 0x1C
#define LCD_INTMSK_FUFIM_MASK 0x2
#define LCD_INTMSK_FUFIM 0x2
#define LCD_INTMSK_FUFIM_BIT 1
#define LCD_INTMSK_LNBUIM_MASK 0x4
#define LCD_INTMSK_LNBUIM 0x4
#define LCD_INTMSK_LNBUIM_BIT 2
#define LCD_INTMSK_VCompIM_MASK 0x8
#define LCD_INTMSK_VCompIM 0x8
#define LCD_INTMSK_VCompIM_BIT 3
#define LCD_INTMSK_BERIM_MASK 0x10
#define LCD_INTMSK_BERIM 0x10
#define LCD_INTMSK_BERIM_BIT 4

#define LCD_INTRAW (*(volatile unsigned *)0xFFE10020)
#define LCD_INTRAW_OFFSET 0x20
#define LCD_INTRAW_FUFRIS_MASK 0x2
#define LCD_INTRAW_FUFRIS 0x2
#define LCD_INTRAW_FUFRIS_BIT 1
#define LCD_INTRAW_LNBURIS_MASK 0x4
#define LCD_INTRAW_LNBURIS 0x4
#define LCD_INTRAW_LNBURIS_BIT 2
#define LCD_INTRAW_VCompRIS_MASK 0x8
#define LCD_INTRAW_VCompRIS 0x8
#define LCD_INTRAW_VCompRIS_BIT 3
#define LCD_INTRAW_BERRAW_MASK 0x10
#define LCD_INTRAW_BERRAW 0x10
#define LCD_INTRAW_BERRAW_BIT 4

#define LCD_INTSTAT (*(volatile unsigned *)0xFFE10024)
#define LCD_INTSTAT_OFFSET 0x24
#define LCD_INTSTAT_FUFMIS_MASK 0x2
#define LCD_INTSTAT_FUFMIS 0x2
#define LCD_INTSTAT_FUFMIS_BIT 1
#define LCD_INTSTAT_LNBUMIS_MASK 0x4
#define LCD_INTSTAT_LNBUMIS 0x4
#define LCD_INTSTAT_LNBUMIS_BIT 2
#define LCD_INTSTAT_VCompMIS_MASK 0x8
#define LCD_INTSTAT_VCompMIS 0x8
#define LCD_INTSTAT_VCompMIS_BIT 3
#define LCD_INTSTAT_BERMIS_MASK 0x10
#define LCD_INTSTAT_BERMIS 0x10
#define LCD_INTSTAT_BERMIS_BIT 4

#define LCD_INTCLR (*(volatile unsigned *)0xFFE10028)
#define LCD_INTCLR_OFFSET 0x28
#define LCD_INTCLR_FUFIC_MASK 0x2
#define LCD_INTCLR_FUFIC 0x2
#define LCD_INTCLR_FUFIC_BIT 1
#define LCD_INTCLR_LNBUIC_MASK 0x4
#define LCD_INTCLR_LNBUIC 0x4
#define LCD_INTCLR_LNBUIC_BIT 2
#define LCD_INTCLR_VCompIC_MASK 0x8
#define LCD_INTCLR_VCompIC 0x8
#define LCD_INTCLR_VCompIC_BIT 3
#define LCD_INTCLR_BERIC_MASK 0x10
#define LCD_INTCLR_BERIC 0x10
#define LCD_INTCLR_BERIC_BIT 4

#define LCD_UPCURR (*(volatile unsigned *)0xFFE1002C)
#define LCD_UPCURR_OFFSET 0x2C

