FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define LCD_LPCURR (*(volatile unsigned *)0xFFE10030)
#define LCD_LPCURR_OFFSET 0x30

#define LCD_PAL0 (*(volatile unsigned long *)0xFFE10200)
#define LCD_PAL0_OFFSET 0x200

#define LCD_PAL1 (*(volatile unsigned long *)0xFFE10204)
#define LCD_PAL1_OFFSET 0x204

#define LCD_PAL2 (*(volatile unsigned long *)0xFFE10208)
#define LCD_PAL2_OFFSET 0x208

#define LCD_PAL3 (*(volatile unsigned long *)0xFFE1020C)
#define LCD_PAL3_OFFSET 0x20C

#define LCD_PAL4 (*(volatile unsigned long *)0xFFE10210)
#define LCD_PAL4_OFFSET 0x210

#define LCD_PAL5 (*(volatile unsigned long *)0xFFE10214)
#define LCD_PAL5_OFFSET 0x214

#define LCD_PAL6 (*(volatile unsigned long *)0xFFE10218)
#define LCD_PAL6_OFFSET 0x218

#define LCD_PAL7 (*(volatile unsigned long *)0xFFE1021C)
#define LCD_PAL7_OFFSET 0x21C

#define LCD_PAL8 (*(volatile unsigned long *)0xFFE10220)
#define LCD_PAL8_OFFSET 0x220

#define LCD_PAL9 (*(volatile unsigned long *)0xFFE10224)
#define LCD_PAL9_OFFSET 0x224

#define LCD_PAL10 (*(volatile unsigned long *)0xFFE10228)
#define LCD_PAL10_OFFSET 0x228

#define LCD_PAL11 (*(volatile unsigned long *)0xFFE1022C)
#define LCD_PAL11_OFFSET 0x22C

#define LCD_PAL12 (*(volatile unsigned long *)0xFFE10230)
#define LCD_PAL12_OFFSET 0x230

#define LCD_PAL13 (*(volatile unsigned long *)0xFFE10234)
#define LCD_PAL13_OFFSET 0x234

#define LCD_PAL14 (*(volatile unsigned long *)0xFFE10238)
#define LCD_PAL14_OFFSET 0x238

#define LCD_PAL15 (*(volatile unsigned long *)0xFFE1023C)
#define LCD_PAL15_OFFSET 0x23C

#define LCD_PAL16 (*(volatile unsigned long *)0xFFE10240)
#define LCD_PAL16_OFFSET 0x240

#define LCD_PAL17 (*(volatile unsigned long *)0xFFE10244)
#define LCD_PAL17_OFFSET 0x244

#define LCD_PAL18 (*(volatile unsigned long *)0xFFE10248)
#define LCD_PAL18_OFFSET 0x248

#define LCD_PAL19 (*(volatile unsigned long *)0xFFE1024C)
#define LCD_PAL19_OFFSET 0x24C

#define LCD_PAL20 (*(volatile unsigned long *)0xFFE10250)
#define LCD_PAL20_OFFSET 0x250

#define LCD_PAL21 (*(volatile unsigned long *)0xFFE10254)
#define LCD_PAL21_OFFSET 0x254

#define LCD_PAL22 (*(volatile unsigned long *)0xFFE10258)
#define LCD_PAL22_OFFSET 0x258

#define LCD_PAL23 (*(volatile unsigned long *)0xFFE1025C)
#define LCD_PAL23_OFFSET 0x25C

#define LCD_PAL24 (*(volatile unsigned long *)0xFFE10260)
#define LCD_PAL24_OFFSET 0x260

#define LCD_PAL25 (*(volatile unsigned long *)0xFFE10264)
#define LCD_PAL25_OFFSET 0x264

#define LCD_PAL26 (*(volatile unsigned long *)0xFFE10268)
#define LCD_PAL26_OFFSET 0x268

#define LCD_PAL27 (*(volatile unsigned long *)0xFFE1026C)
#define LCD_PAL27_OFFSET 0x26C

#define LCD_PAL28 (*(volatile unsigned long *)0xFFE10270)
#define LCD_PAL28_OFFSET 0x270

#define LCD_PAL29 (*(volatile unsigned long *)0xFFE10274)
#define LCD_PAL29_OFFSET 0x274

#define LCD_PAL30 (*(volatile unsigned long *)0xFFE10278)
#define LCD_PAL30_OFFSET 0x278

#define LCD_PAL31 (*(volatile unsigned long *)0xFFE1027C)
#define LCD_PAL31_OFFSET 0x27C

#define LCD_PAL32 (*(volatile unsigned long *)0xFFE10280)
#define LCD_PAL32_OFFSET 0x280

#define LCD_PAL33 (*(volatile unsigned long *)0xFFE10284)
#define LCD_PAL33_OFFSET 0x284

#define LCD_PAL34 (*(volatile unsigned long *)0xFFE10288)
#define LCD_PAL34_OFFSET 0x288

#define LCD_PAL35 (*(volatile unsigned long *)0xFFE1028C)
#define LCD_PAL35_OFFSET 0x28C

#define LCD_PAL36 (*(volatile unsigned long *)0xFFE10290)
#define LCD_PAL36_OFFSET 0x290

#define LCD_PAL37 (*(volatile unsigned long *)0xFFE10294)
#define LCD_PAL37_OFFSET 0x294

#define LCD_PAL38 (*(volatile unsigned long *)0xFFE10298)
#define LCD_PAL38_OFFSET 0x298

#define LCD_PAL39 (*(volatile unsigned long *)0xFFE1029C)
#define LCD_PAL39_OFFSET 0x29C

#define LCD_PAL40 (*(volatile unsigned long *)0xFFE102A0)
#define LCD_PAL40_OFFSET 0x2A0

#define LCD_PAL41 (*(volatile unsigned long *)0xFFE102A4)
#define LCD_PAL41_OFFSET 0x2A4

#define LCD_PAL42 (*(volatile unsigned long *)0xFFE102A8)
#define LCD_PAL42_OFFSET 0x2A8

#define LCD_PAL43 (*(volatile unsigned long *)0xFFE102AC)
#define LCD_PAL43_OFFSET 0x2AC

#define LCD_PAL44 (*(volatile unsigned long *)0xFFE102B0)
#define LCD_PAL44_OFFSET 0x2B0

#define LCD_PAL45 (*(volatile unsigned long *)0xFFE102B4)
#define LCD_PAL45_OFFSET 0x2B4

#define LCD_PAL46 (*(volatile unsigned long *)0xFFE102B8)
#define LCD_PAL46_OFFSET 0x2B8

#define LCD_PAL47 (*(volatile unsigned long *)0xFFE102BC)
#define LCD_PAL47_OFFSET 0x2BC

#define LCD_PAL48 (*(volatile unsigned long *)0xFFE102C0)
#define LCD_PAL48_OFFSET 0x2C0

#define LCD_PAL49 (*(volatile unsigned long *)0xFFE102C4)
#define LCD_PAL49_OFFSET 0x2C4

#define LCD_PAL50 (*(volatile unsigned long *)0xFFE102C8)
#define LCD_PAL50_OFFSET 0x2C8

#define LCD_PAL51 (*(volatile unsigned long *)0xFFE102CC)
#define LCD_PAL51_OFFSET 0x2CC

#define LCD_PAL52 (*(volatile unsigned long *)0xFFE102D0)
#define LCD_PAL52_OFFSET 0x2D0

#define LCD_PAL53 (*(volatile unsigned long *)0xFFE102D4)
#define LCD_PAL53_OFFSET 0x2D4

#define LCD_PAL54 (*(volatile unsigned long *)0xFFE102D8)
#define LCD_PAL54_OFFSET 0x2D8

#define LCD_PAL55 (*(volatile unsigned long *)0xFFE102DC)
#define LCD_PAL55_OFFSET 0x2DC

#define LCD_PAL56 (*(volatile unsigned long *)0xFFE102E0)
#define LCD_PAL56_OFFSET 0x2E0

#define LCD_PAL57 (*(volatile unsigned long *)0xFFE102E4)
#define LCD_PAL57_OFFSET 0x2E4

#define LCD_PAL58 (*(volatile unsigned long *)0xFFE102E8)
#define LCD_PAL58_OFFSET 0x2E8

#define LCD_PAL59 (*(volatile unsigned long *)0xFFE102EC)
#define LCD_PAL59_OFFSET 0x2EC

#define LCD_PAL60 (*(volatile unsigned long *)0xFFE102F0)
#define LCD_PAL60_OFFSET 0x2F0

#define LCD_PAL61 (*(volatile unsigned long *)0xFFE102F4)
#define LCD_PAL61_OFFSET 0x2F4

#define LCD_PAL62 (*(volatile unsigned long *)0xFFE102F8)
#define LCD_PAL62_OFFSET 0x2F8

#define LCD_PAL63 (*(volatile unsigned long *)0xFFE102FC)
#define LCD_PAL63_OFFSET 0x2FC

#define LCD_PAL64 (*(volatile unsigned long *)0xFFE10300)
#define LCD_PAL64_OFFSET 0x300

#define LCD_PAL65 (*(volatile unsigned long *)0xFFE10304)
#define LCD_PAL65_OFFSET 0x304

