FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define LCD_PAL66 (*(volatile unsigned long *)0xFFE10308)
#define LCD_PAL66_OFFSET 0x308

#define LCD_PAL67 (*(volatile unsigned long *)0xFFE1030C)
#define LCD_PAL67_OFFSET 0x30C

#define LCD_PAL68 (*(volatile unsigned long *)0xFFE10310)
#define LCD_PAL68_OFFSET 0x310

#define LCD_PAL69 (*(volatile unsigned long *)0xFFE10314)
#define LCD_PAL69_OFFSET 0x314

#define LCD_PAL70 (*(volatile unsigned long *)0xFFE10318)
#define LCD_PAL70_OFFSET 0x318

#define LCD_PAL71 (*(volatile unsigned long *)0xFFE1031C)
#define LCD_PAL71_OFFSET 0x31C

#define LCD_PAL72 (*(volatile unsigned long *)0xFFE10320)
#define LCD_PAL72_OFFSET 0x320

#define LCD_PAL73 (*(volatile unsigned long *)0xFFE10324)
#define LCD_PAL73_OFFSET 0x324

#define LCD_PAL74 (*(volatile unsigned long *)0xFFE10328)
#define LCD_PAL74_OFFSET 0x328

#define LCD_PAL75 (*(volatile unsigned long *)0xFFE1032C)
#define LCD_PAL75_OFFSET 0x32C

#define LCD_PAL76 (*(volatile unsigned long *)0xFFE10330)
#define LCD_PAL76_OFFSET 0x330

#define LCD_PAL77 (*(volatile unsigned long *)0xFFE10334)
#define LCD_PAL77_OFFSET 0x334

#define LCD_PAL78 (*(volatile unsigned long *)0xFFE10338)
#define LCD_PAL78_OFFSET 0x338

#define LCD_PAL79 (*(volatile unsigned long *)0xFFE1033C)
#define LCD_PAL79_OFFSET 0x33C

#define LCD_PAL80 (*(volatile unsigned long *)0xFFE10340)
#define LCD_PAL80_OFFSET 0x340

#define LCD_PAL81 (*(volatile unsigned long *)0xFFE10344)
#define LCD_PAL81_OFFSET 0x344

#define LCD_PAL82 (*(volatile unsigned long *)0xFFE10348)
#define LCD_PAL82_OFFSET 0x348

#define LCD_PAL83 (*(volatile unsigned long *)0xFFE1034C)
#define LCD_PAL83_OFFSET 0x34C

#define LCD_PAL84 (*(volatile unsigned long *)0xFFE10350)
#define LCD_PAL84_OFFSET 0x350

#define LCD_PAL85 (*(volatile unsigned long *)0xFFE10354)
#define LCD_PAL85_OFFSET 0x354

#define LCD_PAL86 (*(volatile unsigned long *)0xFFE10358)
#define LCD_PAL86_OFFSET 0x358

#define LCD_PAL87 (*(volatile unsigned long *)0xFFE1035C)
#define LCD_PAL87_OFFSET 0x35C

#define LCD_PAL88 (*(volatile unsigned long *)0xFFE10360)
#define LCD_PAL88_OFFSET 0x360

#define LCD_PAL89 (*(volatile unsigned long *)0xFFE10364)
#define LCD_PAL89_OFFSET 0x364

#define LCD_PAL90 (*(volatile unsigned long *)0xFFE10368)
#define LCD_PAL90_OFFSET 0x368

#define LCD_PAL91 (*(volatile unsigned long *)0xFFE1036C)
#define LCD_PAL91_OFFSET 0x36C

#define LCD_PAL92 (*(volatile unsigned long *)0xFFE10370)
#define LCD_PAL92_OFFSET 0x370

#define LCD_PAL93 (*(volatile unsigned long *)0xFFE10374)
#define LCD_PAL93_OFFSET 0x374

#define LCD_PAL94 (*(volatile unsigned long *)0xFFE10378)
#define LCD_PAL94_OFFSET 0x378

#define LCD_PAL95 (*(volatile unsigned long *)0xFFE1037C)
#define LCD_PAL95_OFFSET 0x37C

#define LCD_PAL96 (*(volatile unsigned long *)0xFFE10380)
#define LCD_PAL96_OFFSET 0x380

#define LCD_PAL97 (*(volatile unsigned long *)0xFFE10384)
#define LCD_PAL97_OFFSET 0x384

#define LCD_PAL98 (*(volatile unsigned long *)0xFFE10388)
#define LCD_PAL98_OFFSET 0x388

#define LCD_PAL99 (*(volatile unsigned long *)0xFFE1038C)
#define LCD_PAL99_OFFSET 0x38C

#define LCD_PAL100 (*(volatile unsigned long *)0xFFE10390)
#define LCD_PAL100_OFFSET 0x390

#define LCD_PAL101 (*(volatile unsigned long *)0xFFE10394)
#define LCD_PAL101_OFFSET 0x394

#define LCD_PAL102 (*(volatile unsigned long *)0xFFE10398)
#define LCD_PAL102_OFFSET 0x398

#define LCD_PAL103 (*(volatile unsigned long *)0xFFE1039C)
#define LCD_PAL103_OFFSET 0x39C

#define LCD_PAL104 (*(volatile unsigned long *)0xFFE103A0)
#define LCD_PAL104_OFFSET 0x3A0

#define LCD_PAL105 (*(volatile unsigned long *)0xFFE103A4)
#define LCD_PAL105_OFFSET 0x3A4

#define LCD_PAL106 (*(volatile unsigned long *)0xFFE103A8)
#define LCD_PAL106_OFFSET 0x3A8

#define LCD_PAL107 (*(volatile unsigned long *)0xFFE103AC)
#define LCD_PAL107_OFFSET 0x3AC

#define LCD_PAL108 (*(volatile unsigned long *)0xFFE103B0)
#define LCD_PAL108_OFFSET 0x3B0

#define LCD_PAL109 (*(volatile unsigned long *)0xFFE103B4)
#define LCD_PAL109_OFFSET 0x3B4

#define LCD_PAL110 (*(volatile unsigned long *)0xFFE103B8)
#define LCD_PAL110_OFFSET 0x3B8

#define LCD_PAL111 (*(volatile unsigned long *)0xFFE103BC)
#define LCD_PAL111_OFFSET 0x3BC

#define LCD_PAL112 (*(volatile unsigned long *)0xFFE103C0)
#define LCD_PAL112_OFFSET 0x3C0

#define LCD_PAL113 (*(volatile unsigned long *)0xFFE103C4)
#define LCD_PAL113_OFFSET 0x3C4

#define LCD_PAL114 (*(volatile unsigned long *)0xFFE103C8)
#define LCD_PAL114_OFFSET 0x3C8

#define LCD_PAL115 (*(volatile unsigned long *)0xFFE103CC)
#define LCD_PAL115_OFFSET 0x3CC

#define LCD_PAL116 (*(volatile unsigned long *)0xFFE103D0)
#define LCD_PAL116_OFFSET 0x3D0

#define LCD_PAL117 (*(volatile unsigned long *)0xFFE103D4)
#define LCD_PAL117_OFFSET 0x3D4

#define LCD_PAL118 (*(volatile unsigned long *)0xFFE103D8)
#define LCD_PAL118_OFFSET 0x3D8

#define LCD_PAL119 (*(volatile unsigned long *)0xFFE103DC)
#define LCD_PAL119_OFFSET 0x3DC

#define LCD_PAL120 (*(volatile unsigned long *)0xFFE103E0)
#define LCD_PAL120_OFFSET 0x3E0

#define LCD_PAL121 (*(volatile unsigned long *)0xFFE103E4)
#define LCD_PAL121_OFFSET 0x3E4

#define LCD_PAL122 (*(volatile unsigned long *)0xFFE103E8)
#define LCD_PAL122_OFFSET 0x3E8

#define LCD_PAL123 (*(volatile unsigned long *)0xFFE103EC)
#define LCD_PAL123_OFFSET 0x3EC

#define LCD_PAL124 (*(volatile unsigned long *)0xFFE103F0)
#define LCD_PAL124_OFFSET 0x3F0

#define LCD_PAL125 (*(volatile unsigned long *)0xFFE103F4)
#define LCD_PAL125_OFFSET 0x3F4

#define LCD_PAL126 (*(volatile unsigned long *)0xFFE103F8)
#define LCD_PAL126_OFFSET 0x3F8

#define LCD_PAL127 (*(volatile unsigned long *)0xFFE103FC)
#define LCD_PAL127_OFFSET 0x3FC

#define CRSR_IMG0 (*(volatile unsigned long *)0xFFE10800)
#define CRSR_IMG0_OFFSET 0x800

#define CRSR_IMG1 (*(volatile unsigned long *)0xFFE10804)
#define CRSR_IMG1_OFFSET 0x804

#define CRSR_IMG2 (*(volatile unsigned long *)0xFFE10808)
#define CRSR_IMG2_OFFSET 0x808

#define CRSR_IMG3 (*(volatile unsigned long *)0xFFE1080C)
#define CRSR_IMG3_OFFSET 0x80C

#define CRSR_IMG4 (*(volatile unsigned long *)0xFFE10810)
#define CRSR_IMG4_OFFSET 0x810

#define CRSR_IMG5 (*(volatile unsigned long *)0xFFE10814)
#define CRSR_IMG5_OFFSET 0x814

#define CRSR_IMG6 (*(volatile unsigned long *)0xFFE10818)
#define CRSR_IMG6_OFFSET 0x818

#define CRSR_IMG7 (*(volatile unsigned long *)0xFFE1081C)
#define CRSR_IMG7_OFFSET 0x81C

#define CRSR_IMG8 (*(volatile unsigned long *)0xFFE10820)
#define CRSR_IMG8_OFFSET 0x820

