FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define CRSR_IMG9 (*(volatile unsigned long *)0xFFE10824)
#define CRSR_IMG9_OFFSET 0x824

#define CRSR_IMG10 (*(volatile unsigned long *)0xFFE10828)
#define CRSR_IMG10_OFFSET 0x828

#define CRSR_IMG11 (*(volatile unsigned long *)0xFFE1082C)
#define CRSR_IMG11_OFFSET 0x82C

#define CRSR_IMG12 (*(volatile unsigned long *)0xFFE10830)
#define CRSR_IMG12_OFFSET 0x830

#define CRSR_IMG13 (*(volatile unsigned long *)0xFFE10834)
#define CRSR_IMG13_OFFSET 0x834

#define CRSR_IMG14 (*(volatile unsigned long *)0xFFE10838)
#define CRSR_IMG14_OFFSET 0x838

#define CRSR_IMG15 (*(volatile unsigned long *)0xFFE1083C)
#define CRSR_IMG15_OFFSET 0x83C

#define CRSR_IMG16 (*(volatile unsigned long *)0xFFE10840)
#define CRSR_IMG16_OFFSET 0x840

#define CRSR_IMG17 (*(volatile unsigned long *)0xFFE10844)
#define CRSR_IMG17_OFFSET 0x844

#define CRSR_IMG18 (*(volatile unsigned long *)0xFFE10848)
#define CRSR_IMG18_OFFSET 0x848

#define CRSR_IMG19 (*(volatile unsigned long *)0xFFE1084C)
#define CRSR_IMG19_OFFSET 0x84C

#define CRSR_IMG20 (*(volatile unsigned long *)0xFFE10850)
#define CRSR_IMG20_OFFSET 0x850

#define CRSR_IMG21 (*(volatile unsigned long *)0xFFE10854)
#define CRSR_IMG21_OFFSET 0x854

#define CRSR_IMG22 (*(volatile unsigned long *)0xFFE10858)
#define CRSR_IMG22_OFFSET 0x858

#define CRSR_IMG23 (*(volatile unsigned long *)0xFFE1085C)
#define CRSR_IMG23_OFFSET 0x85C

#define CRSR_IMG24 (*(volatile unsigned long *)0xFFE10860)
#define CRSR_IMG24_OFFSET 0x860

#define CRSR_IMG25 (*(volatile unsigned long *)0xFFE10864)
#define CRSR_IMG25_OFFSET 0x864

#define CRSR_IMG26 (*(volatile unsigned long *)0xFFE10868)
#define CRSR_IMG26_OFFSET 0x868

#define CRSR_IMG27 (*(volatile unsigned long *)0xFFE1086C)
#define CRSR_IMG27_OFFSET 0x86C

#define CRSR_IMG28 (*(volatile unsigned long *)0xFFE10870)
#define CRSR_IMG28_OFFSET 0x870

#define CRSR_IMG29 (*(volatile unsigned long *)0xFFE10874)
#define CRSR_IMG29_OFFSET 0x874

#define CRSR_IMG30 (*(volatile unsigned long *)0xFFE10878)
#define CRSR_IMG30_OFFSET 0x878

#define CRSR_IMG31 (*(volatile unsigned long *)0xFFE1087C)
#define CRSR_IMG31_OFFSET 0x87C

#define CRSR_IMG32 (*(volatile unsigned long *)0xFFE10880)
#define CRSR_IMG32_OFFSET 0x880

#define CRSR_IMG33 (*(volatile unsigned long *)0xFFE10884)
#define CRSR_IMG33_OFFSET 0x884

#define CRSR_IMG34 (*(volatile unsigned long *)0xFFE10888)
#define CRSR_IMG34_OFFSET 0x888

#define CRSR_IMG35 (*(volatile unsigned long *)0xFFE1088C)
#define CRSR_IMG35_OFFSET 0x88C

#define CRSR_IMG36 (*(volatile unsigned long *)0xFFE10890)
#define CRSR_IMG36_OFFSET 0x890

#define CRSR_IMG37 (*(volatile unsigned long *)0xFFE10894)
#define CRSR_IMG37_OFFSET 0x894

#define CRSR_IMG38 (*(volatile unsigned long *)0xFFE10898)
#define CRSR_IMG38_OFFSET 0x898

#define CRSR_IMG39 (*(volatile unsigned long *)0xFFE1089C)
#define CRSR_IMG39_OFFSET 0x89C

#define CRSR_IMG40 (*(volatile unsigned long *)0xFFE108A0)
#define CRSR_IMG40_OFFSET 0x8A0

#define CRSR_IMG41 (*(volatile unsigned long *)0xFFE108A4)
#define CRSR_IMG41_OFFSET 0x8A4

#define CRSR_IMG42 (*(volatile unsigned long *)0xFFE108A8)
#define CRSR_IMG42_OFFSET 0x8A8

#define CRSR_IMG43 (*(volatile unsigned long *)0xFFE108AC)
#define CRSR_IMG43_OFFSET 0x8AC

#define CRSR_IMG44 (*(volatile unsigned long *)0xFFE108B0)
#define CRSR_IMG44_OFFSET 0x8B0

#define CRSR_IMG45 (*(volatile unsigned long *)0xFFE108B4)
#define CRSR_IMG45_OFFSET 0x8B4

#define CRSR_IMG46 (*(volatile unsigned long *)0xFFE108B8)
#define CRSR_IMG46_OFFSET 0x8B8

#define CRSR_IMG47 (*(volatile unsigned long *)0xFFE108BC)
#define CRSR_IMG47_OFFSET 0x8BC

#define CRSR_IMG48 (*(volatile unsigned long *)0xFFE108C0)
#define CRSR_IMG48_OFFSET 0x8C0

#define CRSR_IMG49 (*(volatile unsigned long *)0xFFE108C4)
#define CRSR_IMG49_OFFSET 0x8C4

#define CRSR_IMG50 (*(volatile unsigned long *)0xFFE108C8)
#define CRSR_IMG50_OFFSET 0x8C8

#define CRSR_IMG51 (*(volatile unsigned long *)0xFFE108CC)
#define CRSR_IMG51_OFFSET 0x8CC

#define CRSR_IMG52 (*(volatile unsigned long *)0xFFE108D0)
#define CRSR_IMG52_OFFSET 0x8D0

#define CRSR_IMG53 (*(volatile unsigned long *)0xFFE108D4)
#define CRSR_IMG53_OFFSET 0x8D4

#define CRSR_IMG54 (*(volatile unsigned long *)0xFFE108D8)
#define CRSR_IMG54_OFFSET 0x8D8

#define CRSR_IMG55 (*(volatile unsigned long *)0xFFE108DC)
#define CRSR_IMG55_OFFSET 0x8DC

#define CRSR_IMG56 (*(volatile unsigned long *)0xFFE108E0)
#define CRSR_IMG56_OFFSET 0x8E0

#define CRSR_IMG57 (*(volatile unsigned long *)0xFFE108E4)
#define CRSR_IMG57_OFFSET 0x8E4

#define CRSR_IMG58 (*(volatile unsigned long *)0xFFE108E8)
#define CRSR_IMG58_OFFSET 0x8E8

#define CRSR_IMG59 (*(volatile unsigned long *)0xFFE108EC)
#define CRSR_IMG59_OFFSET 0x8EC

#define CRSR_IMG60 (*(volatile unsigned long *)0xFFE108F0)
#define CRSR_IMG60_OFFSET 0x8F0

#define CRSR_IMG61 (*(volatile unsigned long *)0xFFE108F4)
#define CRSR_IMG61_OFFSET 0x8F4

#define CRSR_IMG62 (*(volatile unsigned long *)0xFFE108F8)
#define CRSR_IMG62_OFFSET 0x8F8

#define CRSR_IMG63 (*(volatile unsigned long *)0xFFE108FC)
#define CRSR_IMG63_OFFSET 0x8FC

#define CRSR_IMG64 (*(volatile unsigned long *)0xFFE10900)
#define CRSR_IMG64_OFFSET 0x900

#define CRSR_IMG65 (*(volatile unsigned long *)0xFFE10904)
#define CRSR_IMG65_OFFSET 0x904

#define CRSR_IMG66 (*(volatile unsigned long *)0xFFE10908)
#define CRSR_IMG66_OFFSET 0x908

#define CRSR_IMG67 (*(volatile unsigned long *)0xFFE1090C)
#define CRSR_IMG67_OFFSET 0x90C

#define CRSR_IMG68 (*(volatile unsigned long *)0xFFE10910)
#define CRSR_IMG68_OFFSET 0x910

#define CRSR_IMG69 (*(volatile unsigned long *)0xFFE10914)
#define CRSR_IMG69_OFFSET 0x914

#define CRSR_IMG70 (*(volatile unsigned long *)0xFFE10918)
#define CRSR_IMG70_OFFSET 0x918

#define CRSR_IMG71 (*(volatile unsigned long *)0xFFE1091C)
#define CRSR_IMG71_OFFSET 0x91C

#define CRSR_IMG72 (*(volatile unsigned long *)0xFFE10920)
#define CRSR_IMG72_OFFSET 0x920

#define CRSR_IMG73 (*(volatile unsigned long *)0xFFE10924)
#define CRSR_IMG73_OFFSET 0x924

#define CRSR_IMG74 (*(volatile unsigned long *)0xFFE10928)
#define CRSR_IMG74_OFFSET 0x928

#define CRSR_IMG75 (*(volatile unsigned long *)0xFFE1092C)
#define CRSR_IMG75_OFFSET 0x92C

#define CRSR_IMG76 (*(volatile unsigned long *)0xFFE10930)
#define CRSR_IMG76_OFFSET 0x930

