FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define CRSR_IMG77 (*(volatile unsigned long *)0xFFE10934)
#define CRSR_IMG77_OFFSET 0x934

#define CRSR_IMG78 (*(volatile unsigned long *)0xFFE10938)
#define CRSR_IMG78_OFFSET 0x938

#define CRSR_IMG79 (*(volatile unsigned long *)0xFFE1093C)
#define CRSR_IMG79_OFFSET 0x93C

#define CRSR_IMG80 (*(volatile unsigned long *)0xFFE10940)
#define CRSR_IMG80_OFFSET 0x940

#define CRSR_IMG81 (*(volatile unsigned long *)0xFFE10944)
#define CRSR_IMG81_OFFSET 0x944

#define CRSR_IMG82 (*(volatile unsigned long *)0xFFE10948)
#define CRSR_IMG82_OFFSET 0x948

#define CRSR_IMG83 (*(volatile unsigned long *)0xFFE1094C)
#define CRSR_IMG83_OFFSET 0x94C

#define CRSR_IMG84 (*(volatile unsigned long *)0xFFE10950)
#define CRSR_IMG84_OFFSET 0x950

#define CRSR_IMG85 (*(volatile unsigned long *)0xFFE10954)
#define CRSR_IMG85_OFFSET 0x954

#define CRSR_IMG86 (*(volatile unsigned long *)0xFFE10958)
#define CRSR_IMG86_OFFSET 0x958

#define CRSR_IMG87 (*(volatile unsigned long *)0xFFE1095C)
#define CRSR_IMG87_OFFSET 0x95C

#define CRSR_IMG88 (*(volatile unsigned long *)0xFFE10960)
#define CRSR_IMG88_OFFSET 0x960

#define CRSR_IMG89 (*(volatile unsigned long *)0xFFE10964)
#define CRSR_IMG89_OFFSET 0x964

#define CRSR_IMG90 (*(volatile unsigned long *)0xFFE10968)
#define CRSR_IMG90_OFFSET 0x968

#define CRSR_IMG91 (*(volatile unsigned long *)0xFFE1096C)
#define CRSR_IMG91_OFFSET 0x96C

#define CRSR_IMG92 (*(volatile unsigned long *)0xFFE10970)
#define CRSR_IMG92_OFFSET 0x970

#define CRSR_IMG93 (*(volatile unsigned long *)0xFFE10974)
#define CRSR_IMG93_OFFSET 0x974

#define CRSR_IMG94 (*(volatile unsigned long *)0xFFE10978)
#define CRSR_IMG94_OFFSET 0x978

#define CRSR_IMG95 (*(volatile unsigned long *)0xFFE1097C)
#define CRSR_IMG95_OFFSET 0x97C

#define CRSR_IMG96 (*(volatile unsigned long *)0xFFE10980)
#define CRSR_IMG96_OFFSET 0x980

#define CRSR_IMG97 (*(volatile unsigned long *)0xFFE10984)
#define CRSR_IMG97_OFFSET 0x984

#define CRSR_IMG98 (*(volatile unsigned long *)0xFFE10988)
#define CRSR_IMG98_OFFSET 0x988

#define CRSR_IMG99 (*(volatile unsigned long *)0xFFE1098C)
#define CRSR_IMG99_OFFSET 0x98C

#define CRSR_IMG100 (*(volatile unsigned long *)0xFFE10990)
#define CRSR_IMG100_OFFSET 0x990

#define CRSR_IMG101 (*(volatile unsigned long *)0xFFE10994)
#define CRSR_IMG101_OFFSET 0x994

#define CRSR_IMG102 (*(volatile unsigned long *)0xFFE10998)
#define CRSR_IMG102_OFFSET 0x998

#define CRSR_IMG103 (*(volatile unsigned long *)0xFFE1099C)
#define CRSR_IMG103_OFFSET 0x99C

#define CRSR_IMG104 (*(volatile unsigned long *)0xFFE109A0)
#define CRSR_IMG104_OFFSET 0x9A0

#define CRSR_IMG105 (*(volatile unsigned long *)0xFFE109A4)
#define CRSR_IMG105_OFFSET 0x9A4

#define CRSR_IMG106 (*(volatile unsigned long *)0xFFE109A8)
#define CRSR_IMG106_OFFSET 0x9A8

#define CRSR_IMG107 (*(volatile unsigned long *)0xFFE109AC)
#define CRSR_IMG107_OFFSET 0x9AC

#define CRSR_IMG108 (*(volatile unsigned long *)0xFFE109B0)
#define CRSR_IMG108_OFFSET 0x9B0

#define CRSR_IMG109 (*(volatile unsigned long *)0xFFE109B4)
#define CRSR_IMG109_OFFSET 0x9B4

#define CRSR_IMG110 (*(volatile unsigned long *)0xFFE109B8)
#define CRSR_IMG110_OFFSET 0x9B8

#define CRSR_IMG111 (*(volatile unsigned long *)0xFFE109BC)
#define CRSR_IMG111_OFFSET 0x9BC

#define CRSR_IMG112 (*(volatile unsigned long *)0xFFE109C0)
#define CRSR_IMG112_OFFSET 0x9C0

#define CRSR_IMG113 (*(volatile unsigned long *)0xFFE109C4)
#define CRSR_IMG113_OFFSET 0x9C4

#define CRSR_IMG114 (*(volatile unsigned long *)0xFFE109C8)
#define CRSR_IMG114_OFFSET 0x9C8

#define CRSR_IMG115 (*(volatile unsigned long *)0xFFE109CC)
#define CRSR_IMG115_OFFSET 0x9CC

#define CRSR_IMG116 (*(volatile unsigned long *)0xFFE109D0)
#define CRSR_IMG116_OFFSET 0x9D0

#define CRSR_IMG117 (*(volatile unsigned long *)0xFFE109D4)
#define CRSR_IMG117_OFFSET 0x9D4

#define CRSR_IMG118 (*(volatile unsigned long *)0xFFE109D8)
#define CRSR_IMG118_OFFSET 0x9D8

#define CRSR_IMG119 (*(volatile unsigned long *)0xFFE109DC)
#define CRSR_IMG119_OFFSET 0x9DC

#define CRSR_IMG120 (*(volatile unsigned long *)0xFFE109E0)
#define CRSR_IMG120_OFFSET 0x9E0

#define CRSR_IMG121 (*(volatile unsigned long *)0xFFE109E4)
#define CRSR_IMG121_OFFSET 0x9E4

#define CRSR_IMG122 (*(volatile unsigned long *)0xFFE109E8)
#define CRSR_IMG122_OFFSET 0x9E8

#define CRSR_IMG123 (*(volatile unsigned long *)0xFFE109EC)
#define CRSR_IMG123_OFFSET 0x9EC

#define CRSR_IMG124 (*(volatile unsigned long *)0xFFE109F0)
#define CRSR_IMG124_OFFSET 0x9F0

#define CRSR_IMG125 (*(volatile unsigned long *)0xFFE109F4)
#define CRSR_IMG125_OFFSET 0x9F4

#define CRSR_IMG126 (*(volatile unsigned long *)0xFFE109F8)
#define CRSR_IMG126_OFFSET 0x9F8

#define CRSR_IMG127 (*(volatile unsigned long *)0xFFE109FC)
#define CRSR_IMG127_OFFSET 0x9FC

#define CRSR_IMG128 (*(volatile unsigned long *)0xFFE10A00)
#define CRSR_IMG128_OFFSET 0xA00

#define CRSR_IMG129 (*(volatile unsigned long *)0xFFE10A04)
#define CRSR_IMG129_OFFSET 0xA04

#define CRSR_IMG130 (*(volatile unsigned long *)0xFFE10A08)
#define CRSR_IMG130_OFFSET 0xA08

#define CRSR_IMG131 (*(volatile unsigned long *)0xFFE10A0C)
#define CRSR_IMG131_OFFSET 0xA0C

#define CRSR_IMG132 (*(volatile unsigned long *)0xFFE10A10)
#define CRSR_IMG132_OFFSET 0xA10

#define CRSR_IMG133 (*(volatile unsigned long *)0xFFE10A14)
#define CRSR_IMG133_OFFSET 0xA14

#define CRSR_IMG134 (*(volatile unsigned long *)0xFFE10A18)
#define CRSR_IMG134_OFFSET 0xA18

#define CRSR_IMG135 (*(volatile unsigned long *)0xFFE10A1C)
#define CRSR_IMG135_OFFSET 0xA1C

#define CRSR_IMG136 (*(volatile unsigned long *)0xFFE10A20)
#define CRSR_IMG136_OFFSET 0xA20

#define CRSR_IMG137 (*(volatile unsigned long *)0xFFE10A24)
#define CRSR_IMG137_OFFSET 0xA24

#define CRSR_IMG138 (*(volatile unsigned long *)0xFFE10A28)
#define CRSR_IMG138_OFFSET 0xA28

#define CRSR_IMG139 (*(volatile unsigned long *)0xFFE10A2C)
#define CRSR_IMG139_OFFSET 0xA2C

#define CRSR_IMG140 (*(volatile unsigned long *)0xFFE10A30)
#define CRSR_IMG140_OFFSET 0xA30

#define CRSR_IMG141 (*(volatile unsigned long *)0xFFE10A34)
#define CRSR_IMG141_OFFSET 0xA34

#define CRSR_IMG142 (*(volatile unsigned long *)0xFFE10A38)
#define CRSR_IMG142_OFFSET 0xA38

#define CRSR_IMG143 (*(volatile unsigned long *)0xFFE10A3C)
#define CRSR_IMG143_OFFSET 0xA3C

#define CRSR_IMG144 (*(volatile unsigned long *)0xFFE10A40)
#define CRSR_IMG144_OFFSET 0xA40

