FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define CRSR_IMG145 (*(volatile unsigned long *)0xFFE10A44)
#define CRSR_IMG145_OFFSET 0xA44

#define CRSR_IMG146 (*(volatile unsigned long *)0xFFE10A48)
#define CRSR_IMG146_OFFSET 0xA48

#define CRSR_IMG147 (*(volatile unsigned long *)0xFFE10A4C)
#define CRSR_IMG147_OFFSET 0xA4C

#define CRSR_IMG148 (*(volatile unsigned long *)0xFFE10A50)
#define CRSR_IMG148_OFFSET 0xA50

#define CRSR_IMG149 (*(volatile unsigned long *)0xFFE10A54)
#define CRSR_IMG149_OFFSET 0xA54

#define CRSR_IMG150 (*(volatile unsigned long *)0xFFE10A58)
#define CRSR_IMG150_OFFSET 0xA58

#define CRSR_IMG151 (*(volatile unsigned long *)0xFFE10A5C)
#define CRSR_IMG151_OFFSET 0xA5C

#define CRSR_IMG152 (*(volatile unsigned long *)0xFFE10A60)
#define CRSR_IMG152_OFFSET 0xA60

#define CRSR_IMG153 (*(volatile unsigned long *)0xFFE10A64)
#define CRSR_IMG153_OFFSET 0xA64

#define CRSR_IMG154 (*(volatile unsigned long *)0xFFE10A68)
#define CRSR_IMG154_OFFSET 0xA68

#define CRSR_IMG155 (*(volatile unsigned long *)0xFFE10A6C)
#define CRSR_IMG155_OFFSET 0xA6C

#define CRSR_IMG156 (*(volatile unsigned long *)0xFFE10A70)
#define CRSR_IMG156_OFFSET 0xA70

#define CRSR_IMG157 (*(volatile unsigned long *)0xFFE10A74)
#define CRSR_IMG157_OFFSET 0xA74

#define CRSR_IMG158 (*(volatile unsigned long *)0xFFE10A78)
#define CRSR_IMG158_OFFSET 0xA78

#define CRSR_IMG159 (*(volatile unsigned long *)0xFFE10A7C)
#define CRSR_IMG159_OFFSET 0xA7C

#define CRSR_IMG160 (*(volatile unsigned long *)0xFFE10A80)
#define CRSR_IMG160_OFFSET 0xA80

#define CRSR_IMG161 (*(volatile unsigned long *)0xFFE10A84)
#define CRSR_IMG161_OFFSET 0xA84

#define CRSR_IMG162 (*(volatile unsigned long *)0xFFE10A88)
#define CRSR_IMG162_OFFSET 0xA88

#define CRSR_IMG163 (*(volatile unsigned long *)0xFFE10A8C)
#define CRSR_IMG163_OFFSET 0xA8C

#define CRSR_IMG164 (*(volatile unsigned long *)0xFFE10A90)
#define CRSR_IMG164_OFFSET 0xA90

#define CRSR_IMG165 (*(volatile unsigned long *)0xFFE10A94)
#define CRSR_IMG165_OFFSET 0xA94

#define CRSR_IMG166 (*(volatile unsigned long *)0xFFE10A98)
#define CRSR_IMG166_OFFSET 0xA98

#define CRSR_IMG167 (*(volatile unsigned long *)0xFFE10A9C)
#define CRSR_IMG167_OFFSET 0xA9C

#define CRSR_IMG168 (*(volatile unsigned long *)0xFFE10AA0)
#define CRSR_IMG168_OFFSET 0xAA0

#define CRSR_IMG169 (*(volatile unsigned long *)0xFFE10AA4)
#define CRSR_IMG169_OFFSET 0xAA4

#define CRSR_IMG170 (*(volatile unsigned long *)0xFFE10AA8)
#define CRSR_IMG170_OFFSET 0xAA8

#define CRSR_IMG171 (*(volatile unsigned long *)0xFFE10AAC)
#define CRSR_IMG171_OFFSET 0xAAC

#define CRSR_IMG172 (*(volatile unsigned long *)0xFFE10AB0)
#define CRSR_IMG172_OFFSET 0xAB0

#define CRSR_IMG173 (*(volatile unsigned long *)0xFFE10AB4)
#define CRSR_IMG173_OFFSET 0xAB4

#define CRSR_IMG174 (*(volatile unsigned long *)0xFFE10AB8)
#define CRSR_IMG174_OFFSET 0xAB8

#define CRSR_IMG175 (*(volatile unsigned long *)0xFFE10ABC)
#define CRSR_IMG175_OFFSET 0xABC

#define CRSR_IMG176 (*(volatile unsigned long *)0xFFE10AC0)
#define CRSR_IMG176_OFFSET 0xAC0

#define CRSR_IMG177 (*(volatile unsigned long *)0xFFE10AC4)
#define CRSR_IMG177_OFFSET 0xAC4

#define CRSR_IMG178 (*(volatile unsigned long *)0xFFE10AC8)
#define CRSR_IMG178_OFFSET 0xAC8

#define CRSR_IMG179 (*(volatile unsigned long *)0xFFE10ACC)
#define CRSR_IMG179_OFFSET 0xACC

#define CRSR_IMG180 (*(volatile unsigned long *)0xFFE10AD0)
#define CRSR_IMG180_OFFSET 0xAD0

#define CRSR_IMG181 (*(volatile unsigned long *)0xFFE10AD4)
#define CRSR_IMG181_OFFSET 0xAD4

#define CRSR_IMG182 (*(volatile unsigned long *)0xFFE10AD8)
#define CRSR_IMG182_OFFSET 0xAD8

#define CRSR_IMG183 (*(volatile unsigned long *)0xFFE10ADC)
#define CRSR_IMG183_OFFSET 0xADC

#define CRSR_IMG184 (*(volatile unsigned long *)0xFFE10AE0)
#define CRSR_IMG184_OFFSET 0xAE0

#define CRSR_IMG185 (*(volatile unsigned long *)0xFFE10AE4)
#define CRSR_IMG185_OFFSET 0xAE4

#define CRSR_IMG186 (*(volatile unsigned long *)0xFFE10AE8)
#define CRSR_IMG186_OFFSET 0xAE8

#define CRSR_IMG187 (*(volatile unsigned long *)0xFFE10AEC)
#define CRSR_IMG187_OFFSET 0xAEC

#define CRSR_IMG188 (*(volatile unsigned long *)0xFFE10AF0)
#define CRSR_IMG188_OFFSET 0xAF0

#define CRSR_IMG189 (*(volatile unsigned long *)0xFFE10AF4)
#define CRSR_IMG189_OFFSET 0xAF4

#define CRSR_IMG190 (*(volatile unsigned long *)0xFFE10AF8)
#define CRSR_IMG190_OFFSET 0xAF8

#define CRSR_IMG191 (*(volatile unsigned long *)0xFFE10AFC)
#define CRSR_IMG191_OFFSET 0xAFC

#define CRSR_IMG192 (*(volatile unsigned long *)0xFFE10B00)
#define CRSR_IMG192_OFFSET 0xB00

#define CRSR_IMG193 (*(volatile unsigned long *)0xFFE10B04)
#define CRSR_IMG193_OFFSET 0xB04

#define CRSR_IMG194 (*(volatile unsigned long *)0xFFE10B08)
#define CRSR_IMG194_OFFSET 0xB08

#define CRSR_IMG195 (*(volatile unsigned long *)0xFFE10B0C)
#define CRSR_IMG195_OFFSET 0xB0C

#define CRSR_IMG196 (*(volatile unsigned long *)0xFFE10B10)
#define CRSR_IMG196_OFFSET 0xB10

#define CRSR_IMG197 (*(volatile unsigned long *)0xFFE10B14)
#define CRSR_IMG197_OFFSET 0xB14

#define CRSR_IMG198 (*(volatile unsigned long *)0xFFE10B18)
#define CRSR_IMG198_OFFSET 0xB18

#define CRSR_IMG199 (*(volatile unsigned long *)0xFFE10B1C)
#define CRSR_IMG199_OFFSET 0xB1C

#define CRSR_IMG200 (*(volatile unsigned long *)0xFFE10B20)
#define CRSR_IMG200_OFFSET 0xB20

#define CRSR_IMG201 (*(volatile unsigned long *)0xFFE10B24)
#define CRSR_IMG201_OFFSET 0xB24

#define CRSR_IMG202 (*(volatile unsigned long *)0xFFE10B28)
#define CRSR_IMG202_OFFSET 0xB28

#define CRSR_IMG203 (*(volatile unsigned long *)0xFFE10B2C)
#define CRSR_IMG203_OFFSET 0xB2C

#define CRSR_IMG204 (*(volatile unsigned long *)0xFFE10B30)
#define CRSR_IMG204_OFFSET 0xB30

#define CRSR_IMG205 (*(volatile unsigned long *)0xFFE10B34)
#define CRSR_IMG205_OFFSET 0xB34

#define CRSR_IMG206 (*(volatile unsigned long *)0xFFE10B38)
#define CRSR_IMG206_OFFSET 0xB38

#define CRSR_IMG207 (*(volatile unsigned long *)0xFFE10B3C)
#define CRSR_IMG207_OFFSET 0xB3C

#define CRSR_IMG208 (*(volatile unsigned long *)0xFFE10B40)
#define CRSR_IMG208_OFFSET 0xB40

#define CRSR_IMG209 (*(volatile unsigned long *)0xFFE10B44)
#define CRSR_IMG209_OFFSET 0xB44

#define CRSR_IMG210 (*(volatile unsigned long *)0xFFE10B48)
#define CRSR_IMG210_OFFSET 0xB48

#define CRSR_IMG211 (*(volatile unsigned long *)0xFFE10B4C)
#define CRSR_IMG211_OFFSET 0xB4C

#define CRSR_IMG212 (*(volatile unsigned long *)0xFFE10B50)
#define CRSR_IMG212_OFFSET 0xB50

