FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define CRSR_IMG213 (*(volatile unsigned long *)0xFFE10B54)
#define CRSR_IMG213_OFFSET 0xB54

#define CRSR_IMG214 (*(volatile unsigned long *)0xFFE10B58)
#define CRSR_IMG214_OFFSET 0xB58

#define CRSR_IMG215 (*(volatile unsigned long *)0xFFE10B5C)
#define CRSR_IMG215_OFFSET 0xB5C

#define CRSR_IMG216 (*(volatile unsigned long *)0xFFE10B60)
#define CRSR_IMG216_OFFSET 0xB60

#define CRSR_IMG217 (*(volatile unsigned long *)0xFFE10B64)
#define CRSR_IMG217_OFFSET 0xB64

#define CRSR_IMG218 (*(volatile unsigned long *)0xFFE10B68)
#define CRSR_IMG218_OFFSET 0xB68

#define CRSR_IMG219 (*(volatile unsigned long *)0xFFE10B6C)
#define CRSR_IMG219_OFFSET 0xB6C

#define CRSR_IMG220 (*(volatile unsigned long *)0xFFE10B70)
#define CRSR_IMG220_OFFSET 0xB70

#define CRSR_IMG221 (*(volatile unsigned long *)0xFFE10B74)
#define CRSR_IMG221_OFFSET 0xB74

#define CRSR_IMG222 (*(volatile unsigned long *)0xFFE10B78)
#define CRSR_IMG222_OFFSET 0xB78

#define CRSR_IMG223 (*(volatile unsigned long *)0xFFE10B7C)
#define CRSR_IMG223_OFFSET 0xB7C

#define CRSR_IMG224 (*(volatile unsigned long *)0xFFE10B80)
#define CRSR_IMG224_OFFSET 0xB80

#define CRSR_IMG225 (*(volatile unsigned long *)0xFFE10B84)
#define CRSR_IMG225_OFFSET 0xB84

#define CRSR_IMG226 (*(volatile unsigned long *)0xFFE10B88)
#define CRSR_IMG226_OFFSET 0xB88

#define CRSR_IMG227 (*(volatile unsigned long *)0xFFE10B8C)
#define CRSR_IMG227_OFFSET 0xB8C

#define CRSR_IMG228 (*(volatile unsigned long *)0xFFE10B90)
#define CRSR_IMG228_OFFSET 0xB90

#define CRSR_IMG229 (*(volatile unsigned long *)0xFFE10B94)
#define CRSR_IMG229_OFFSET 0xB94

#define CRSR_IMG230 (*(volatile unsigned long *)0xFFE10B98)
#define CRSR_IMG230_OFFSET 0xB98

#define CRSR_IMG231 (*(volatile unsigned long *)0xFFE10B9C)
#define CRSR_IMG231_OFFSET 0xB9C

#define CRSR_IMG232 (*(volatile unsigned long *)0xFFE10BA0)
#define CRSR_IMG232_OFFSET 0xBA0

#define CRSR_IMG233 (*(volatile unsigned long *)0xFFE10BA4)
#define CRSR_IMG233_OFFSET 0xBA4

#define CRSR_IMG234 (*(volatile unsigned long *)0xFFE10BA8)
#define CRSR_IMG234_OFFSET 0xBA8

#define CRSR_IMG235 (*(volatile unsigned long *)0xFFE10BAC)
#define CRSR_IMG235_OFFSET 0xBAC

#define CRSR_IMG236 (*(volatile unsigned long *)0xFFE10BB0)
#define CRSR_IMG236_OFFSET 0xBB0

#define CRSR_IMG237 (*(volatile unsigned long *)0xFFE10BB4)
#define CRSR_IMG237_OFFSET 0xBB4

#define CRSR_IMG238 (*(volatile unsigned long *)0xFFE10BB8)
#define CRSR_IMG238_OFFSET 0xBB8

#define CRSR_IMG239 (*(volatile unsigned long *)0xFFE10BBC)
#define CRSR_IMG239_OFFSET 0xBBC

#define CRSR_IMG240 (*(volatile unsigned long *)0xFFE10BC0)
#define CRSR_IMG240_OFFSET 0xBC0

#define CRSR_IMG241 (*(volatile unsigned long *)0xFFE10BC4)
#define CRSR_IMG241_OFFSET 0xBC4

#define CRSR_IMG242 (*(volatile unsigned long *)0xFFE10BC8)
#define CRSR_IMG242_OFFSET 0xBC8

#define CRSR_IMG243 (*(volatile unsigned long *)0xFFE10BCC)
#define CRSR_IMG243_OFFSET 0xBCC

#define CRSR_IMG244 (*(volatile unsigned long *)0xFFE10BD0)
#define CRSR_IMG244_OFFSET 0xBD0

#define CRSR_IMG245 (*(volatile unsigned long *)0xFFE10BD4)
#define CRSR_IMG245_OFFSET 0xBD4

#define CRSR_IMG246 (*(volatile unsigned long *)0xFFE10BD8)
#define CRSR_IMG246_OFFSET 0xBD8

#define CRSR_IMG247 (*(volatile unsigned long *)0xFFE10BDC)
#define CRSR_IMG247_OFFSET 0xBDC

#define CRSR_IMG248 (*(volatile unsigned long *)0xFFE10BE0)
#define CRSR_IMG248_OFFSET 0xBE0

#define CRSR_IMG249 (*(volatile unsigned long *)0xFFE10BE4)
#define CRSR_IMG249_OFFSET 0xBE4

#define CRSR_IMG250 (*(volatile unsigned long *)0xFFE10BE8)
#define CRSR_IMG250_OFFSET 0xBE8

#define CRSR_IMG251 (*(volatile unsigned long *)0xFFE10BEC)
#define CRSR_IMG251_OFFSET 0xBEC

#define CRSR_IMG252 (*(volatile unsigned long *)0xFFE10BF0)
#define CRSR_IMG252_OFFSET 0xBF0

#define CRSR_IMG253 (*(volatile unsigned long *)0xFFE10BF4)
#define CRSR_IMG253_OFFSET 0xBF4

#define CRSR_IMG254 (*(volatile unsigned long *)0xFFE10BF8)
#define CRSR_IMG254_OFFSET 0xBF8

#define CRSR_IMG255 (*(volatile unsigned long *)0xFFE10BFC)
#define CRSR_IMG255_OFFSET 0xBFC

#define CRSR_CTRL (*(volatile unsigned *)0xFFE10C00)
#define CRSR_CTRL_OFFSET 0xC00
#define CRSR_CTRL_CrsrOn_MASK 0x1
#define CRSR_CTRL_CrsrOn 0x1
#define CRSR_CTRL_CrsrOn_BIT 0
#define CRSR_CTRL_CrsrNum_MASK 0x30
#define CRSR_CTRL_CrsrNum_BIT 4

#define CRSR_CFG (*(volatile unsigned *)0xFFE10C04)
#define CRSR_CFG_OFFSET 0xC04
#define CRSR_CFG_CrsrSize_MASK 0x1
#define CRSR_CFG_CrsrSize 0x1
#define CRSR_CFG_CrsrSize_BIT 0
#define CRSR_CFG_FrameSync_MASK 0x2
#define CRSR_CFG_FrameSync 0x2
#define CRSR_CFG_FrameSync_BIT 1

#define CRSR_PAL0 (*(volatile unsigned *)0xFFE10C08)
#define CRSR_PAL0_OFFSET 0xC08
#define CRSR_PAL0_Red_MASK 0xFF
#define CRSR_PAL0_Red_BIT 0
#define CRSR_PAL0_Green_MASK 0xFF00
#define CRSR_PAL0_Green_BIT 8
#define CRSR_PAL0_Blue_MASK 0xFF0000
#define CRSR_PAL0_Blue_BIT 16

#define CRSR_PAL1 (*(volatile unsigned *)0xFFE10C0C)
#define CRSR_PAL1_OFFSET 0xC0C
#define CRSR_PAL1_Red_MASK 0xFF
#define CRSR_PAL1_Red_BIT 0
#define CRSR_PAL1_Green_MASK 0xFF00
#define CRSR_PAL1_Green_BIT 8
#define CRSR_PAL1_Blue_MASK 0xFF0000
#define CRSR_PAL1_Blue_BIT 16

#define CRSR_XY (*(volatile unsigned *)0xFFE10C10)
#define CRSR_XY_OFFSET 0xC10
#define CRSR_XY_CrsrX_MASK 0x3FF
#define CRSR_XY_CrsrX_BIT 0
#define CRSR_XY_CrsrY_MASK 0x3FF0000
#define CRSR_XY_CrsrY_BIT 16

#define CRSR_CLIP (*(volatile unsigned *)0xFFE10C14)
#define CRSR_CLIP_OFFSET 0xC14
#define CRSR_CLIP_CrsrClipX_MASK 0x3F
#define CRSR_CLIP_CrsrClipX_BIT 0
#define CRSR_CLIP_CrsrClipY_MASK 0x3F00
#define CRSR_CLIP_CrsrClipY_BIT 8

#define CRSR_INTMSK (*(volatile unsigned *)0xFFE10C20)
#define CRSR_INTMSK_OFFSET 0xC20
#define CRSR_INTMSK_CrsrIM_MASK 0x1
#define CRSR_INTMSK_CrsrIM 0x1
#define CRSR_INTMSK_CrsrIM_BIT 0

#define CRSR_INTCLR (*(volatile unsigned *)0xFFE10C24)
#define CRSR_INTCLR_OFFSET 0xC24
#define CRSR_INTCLR_CrsrIC_MASK 0x1
#define CRSR_INTCLR_CrsrIC 0x1
#define CRSR_INTCLR_CrsrIC_BIT 0

#define CRSR_INTRAW (*(volatile unsigned *)0xFFE10C28)
#define CRSR_INTRAW_OFFSET 0xC28
#define CRSR_INTRAW_CrsrRIS_MASK 0x1
#define CRSR_INTRAW_CrsrRIS 0x1
#define CRSR_INTRAW_CrsrRIS_BIT 0

#define CRSR_INTSTAT (*(volatile unsigned *)0xFFE10C2C)
#define CRSR_INTSTAT_OFFSET 0xC2C
#define CRSR_INTSTAT_CrsrMIS_MASK 0x1
#define CRSR_INTSTAT_CrsrMIS 0x1
#define CRSR_INTSTAT_CrsrMIS_BIT 0

#define VIC_BASE 0xFFFFF000

#define VICIRQStatus (*(volatile unsigned long *)0xFFFFF000)
#define VICIRQStatus_OFFSET 0x0

#define VICFIQStatus (*(volatile unsigned long *)0xFFFFF004)
#define VICFIQStatus_OFFSET 0x4

#define VICRawIntr (*(volatile unsigned long *)0xFFFFF008)
#define VICRawIntr_OFFSET 0x8

#define VICIntSelect (*(volatile unsigned long *)0xFFFFF00C)
#define VICIntSelect_OFFSET 0xC

#define VICIntEnable (*(volatile unsigned long *)0xFFFFF010)
#define VICIntEnable_OFFSET 0x10

#define VICIntEnClr (*(volatile unsigned long *)0xFFFFF014)
#define VICIntEnClr_OFFSET 0x14

#define VICSoftInt (*(volatile unsigned long *)0xFFFFF018)
#define VICSoftInt_OFFSET 0x18

#define VICSoftIntClear (*(volatile unsigned long *)0xFFFFF01C)
#define VICSoftIntClear_OFFSET 0x1C

