FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478.h
#define VICVectPriority28 (*(volatile unsigned long *)0xFFFFF270)
#define VICVectPriority28_OFFSET 0x270

#define VICVectPriority29 (*(volatile unsigned long *)0xFFFFF274)
#define VICVectPriority29_OFFSET 0x274

#define VICVectPriority30 (*(volatile unsigned long *)0xFFFFF278)
#define VICVectPriority30_OFFSET 0x278

#define VICVectPriority31 (*(volatile unsigned long *)0xFFFFF27C)
#define VICVectPriority31_OFFSET 0x27C

#define VICAddress (*(volatile unsigned long *)0xFFFFFF00)
#define VICAddress_OFFSET 0xF00

/* On LPC23xx, the names are USBClkCtrl and USBClkSt; on LPC24xx, the names are
OTG_CLK_CTRL and OTG_CLK_STAT respectively. */
#define USBOTG_CLK_BASE_ADDR	0xFFE0CFF0
#define OTG_CLK_CTRL        (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define OTG_CLK_STAT        (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x08))
/* USB OTG Controller */
#define USBOTG_BASE_ADDR	0xFFE0C100
#define OTG_INT_STAT        (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x00))
#define OTG_INT_EN          (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x04))
#define OTG_INT_SET         (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x08))
#define OTG_INT_CLR         (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x0C))
/* On LPC23xx, the name is USBPortSel, on LPC24xx, the name is OTG_STAT_CTRL */
#define OTG_STAT_CTRL       (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x10))
#define OTG_TIMER           (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x14))

#define INTERRUPT_CHANNEL_WDT           0
#define INTERRUPT_CHANNEL_SWI           1
#define INTERRUPT_CHANNEL_DBG_COMM_RX   2
#define INTERRUPT_CHANNEL_DBG_COMM_TX   3
#define INTERRUPT_CHANNEL_TIMER0        4
#define INTERRUPT_CHANNEL_TIMER1        5
#define INTERRUPT_CHANNEL_UART0         6
#define INTERRUPT_CHANNEL_UART1         7
#define INTERRUPT_CHANNEL_PWM0          8
#define INTERRUPT_CHANNEL_PWM1          8
#define INTERRUPT_CHANNEL_I2C0          9
#define INTERRUPT_CHANNEL_SPI           10
#define INTERRUPT_CHANNEL_SSP0          10
#define INTERRUPT_CHANNEL_SSP1          11
#define INTERRUPT_CHANNEL_PLL           12
#define INTERRUPT_CHANNEL_RTC           13
#define INTERRUPT_CHANNEL_EINT0         14
#define INTERRUPT_CHANNEL_EINT1         15
#define INTERRUPT_CHANNEL_EINT2         16
#define INTERRUPT_CHANNEL_LCD           16
#define INTERRUPT_CHANNEL_EINT3         17
#define INTERRUPT_CHANNEL_ADC0          18
#define INTERRUPT_CHANNEL_I2C1          19
#define INTERRUPT_CHANNEL_BOD           20
#define INTERRUPT_CHANNEL_ETHERNET      21
#define INTERRUPT_CHANNEL_USB           22
#define INTERRUPT_CHANNEL_CAN           23
#define INTERRUPT_CHANNEL_SD_MMC        24
#define INTERRUPT_CHANNEL_GP_DMA        25
#define INTERRUPT_CHANNEL_TIMER2        26
#define INTERRUPT_CHANNEL_TIMER3        27
#define INTERRUPT_CHANNEL_UART2         28
#define INTERRUPT_CHANNEL_UART3         29
#define INTERRUPT_CHANNEL_I2C2          30
#define INTERRUPT_CHANNEL_I2S           31


#endif
